#ifndef UE4SS_SDK_Stalker2_HPP
#define UE4SS_SDK_Stalker2_HPP

#include "Stalker2_enums.hpp"

struct FAIEntityCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x68

struct FAITickComponentCollection : public FBaseTickAggregationCollection
{
    TArray<class UAITickComponent*> AITickComponents;                                 // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FALifeScenarioGroupSIDSelector
{
    FString Value;                                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAbilityCamModifierStage
{
    float StageDuration;                                                              // 0x0000 (size: 0x4)
    float DistPercent;                                                                // 0x0004 (size: 0x4)
    float FOV;                                                                        // 0x0008 (size: 0x4)
    float PostProcessBlendWeight;                                                     // 0x000C (size: 0x4)
    FPostProcessSimplifiedSettings PostProcessSettings;                               // 0x0010 (size: 0x80)

}; // Size: 0x90

struct FAbilityParams
{
}; // Size: 0xC

struct FAbilityPrototypeSID
{
    FPrototypeSID AbilitySID;                                                         // 0x0000 (size: 0x40)
    FName ActivationTag;                                                              // 0x0040 (size: 0x8)

}; // Size: 0x48

struct FAchievementData
{
    class UAchievementTracker* Tracker;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FActionMimicSettings
{
    FName InputAction;                                                                // 0x0000 (size: 0x8)
    EMappingContext MappingContext;                                                   // 0x0008 (size: 0x4)
    int32 TriggerIndex;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FActorInteractionData
{
    FString InteractableTextToolName;                                                 // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FAdvancedControllerSettings
{
    int32 MappingIndex;                                                               // 0x0000 (size: 0x4)
    int32 TriggerIndex;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FAgentCollection : public FBaseTickAggregationCollection
{
}; // Size: 0xA0

struct FAgentDomainRestrictions
{
    EAgentDomain AgentDomain;                                                         // 0x0000 (size: 0x1)
    ESpaceRestrictionType RestrictionType;                                            // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FAgentModelCollection : public FBaseModelCollection
{
}; // Size: 0xB8

struct FAkComponentCollection : public FBaseTickAggregationCollection
{
    TArray<class UAkComponent*> AkComponents;                                         // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAkComponentRetargetRow : public FTableRowBase
{
    FName TargetSocketName;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAkLateReverbCollection : public FBaseTickAggregationCollection
{
    TArray<class UAkLateReverbComponent*> LateReverbComponents;                       // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAkRoomCollection : public FBaseTickAggregationCollection
{
    TArray<class UAkRoomComponent*> RoomComponents;                                   // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAkSurfaceReflectorSetCollection : public FBaseTickAggregationCollection
{
    TArray<class UAkSurfaceReflectorSetComponent*> SurfaceReflectorSetComponents;     // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FAnimAbilityData
{
    float BlendAlpha;                                                                 // 0x0000 (size: 0x4)
    float AimOffsetAlphaYaw;                                                          // 0x0004 (size: 0x4)
    float AimOffsetAlphaPitch;                                                        // 0x0008 (size: 0x4)
    class UBlendSpace* Offset;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FAnimBodyPartBonesConfig
{
    EAnimHitBodyPart HitBodyPart;                                                     // 0x0000 (size: 0x1)
    TSet<FName> Bones;                                                                // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FAnimBonesArray
{
}; // Size: 0x10

struct FAnimCutsceneData
{
    float BlendTime;                                                                  // 0x0000 (size: 0x4)
    bool CacheToggleFlag;                                                             // 0x0004 (size: 0x1)

}; // Size: 0x8

struct FAnimDamageData
{
}; // Size: 0x30

struct FAnimDialogContextualArray
{
    TMap<class ELookAtOwnerState, class FAnimSequenceArray> DialogContextualAnimations; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAnimDialogContextualWeightedArray
{
    TMap<class ELookAtOwnerState, class FAnimSequenceWeightedArray> DialogContextualAnimations; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FAnimFaceBlendConfig
{
    FAlphaBlend BlendIn;                                                              // 0x0000 (size: 0x30)
    bool bIsDynamicBlendOut;                                                          // 0x0030 (size: 0x1)
    float FaceBlendOutTime;                                                           // 0x0034 (size: 0x4)
    float FaceBlendOutTriggerTime;                                                    // 0x0038 (size: 0x4)
    FFloatRange AnimationLengthRange;                                                 // 0x003C (size: 0x10)
    FFloatRange BlendOutTriggerTimeRange;                                             // 0x004C (size: 0x10)

}; // Size: 0x60

struct FAnimHandIKData
{
    float Alpha;                                                                      // 0x0000 (size: 0x4)
    FAlphaBlend BlendArgs;                                                            // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FAnimHandItemData
{
    bool bHasItemInHands;                                                             // 0x0000 (size: 0x1)
    bool bHasEmptyHands;                                                              // 0x0001 (size: 0x1)
    class USkeletalMeshComponent* ItemSkeletal;                                       // 0x0008 (size: 0x8)
    class UInteractionComponent* ItemInteractable;                                    // 0x0010 (size: 0x8)
    bool bIsUsesLeftHand;                                                             // 0x0018 (size: 0x1)
    bool bIsUsesRightHand;                                                            // 0x0019 (size: 0x1)
    FAnimPlayerWeaponSwingData SwingData;                                             // 0x0020 (size: 0x80)
    FAnimPlayerWeaponInertiaData InertiaData;                                         // 0x00A0 (size: 0x98)

}; // Size: 0x138

struct FAnimHitBodyPart
{
    FAnimationSingleHit FirstHit;                                                     // 0x0000 (size: 0xC)
    FAnimationSingleHit SecondHit;                                                    // 0x000C (size: 0xC)
    float MinimalAngleBetweenHits;                                                    // 0x0018 (size: 0x4)
    FName NextHitAvailableCurveName;                                                  // 0x001C (size: 0x8)
    TArray<FName> AvailiableParentBoneNames;                                          // 0x0028 (size: 0x10)
    TArray<FName> ExcludedParentBoneNames;                                            // 0x0038 (size: 0x10)
    EAnimHitBodyPartType BodyType;                                                    // 0x0048 (size: 0x1)

}; // Size: 0x58

struct FAnimHitData
{
    bool bEnableAnimationHit;                                                         // 0x0000 (size: 0x1)
    TArray<FAnimHitBodyPart> Hits;                                                    // 0x0008 (size: 0x10)
    EAnimHitSourceType HitSourceType;                                                 // 0x0018 (size: 0x1)
    uint8 MaxCountOfSimultaneouslyPlayedHitAnimations;                                // 0x0019 (size: 0x1)
    uint8 NumberOfAnimationsWhenFirstWillBeStopped;                                   // 0x001A (size: 0x1)
    EAnimHitBodyPartType LastHittedBodyPart;                                          // 0x0080 (size: 0x1)
    float HitDirection;                                                               // 0x0084 (size: 0x4)
    float HitVerticalDirection;                                                       // 0x0088 (size: 0x4)
    EAnimDirections HitAnimDirection;                                                 // 0x008C (size: 0x1)
    EDeathAnimationType DeathAnimationType;                                           // 0x008D (size: 0x1)
    EHumanAnimDamageSource DeathDamageSource;                                         // 0x008E (size: 0x1)
    class UAnimSequence* DeadPose;                                                    // 0x0090 (size: 0x8)
    bool bDiedLyingDown;                                                              // 0x0098 (size: 0x1)
    bool bDiedFromAbove;                                                              // 0x0099 (size: 0x1)
    TMap<class FName, class FRotator> ForceWarpActorRotation;                         // 0x00A0 (size: 0x50)
    TArray<FAnimBodyPartBonesConfig> BodyPartBonesConfig;                             // 0x00F0 (size: 0x10)

}; // Size: 0x138

struct FAnimHitPhysCurves
{
    FPhysicsControlMultiplier WorldSpaceControlMultiplier;                            // 0x0000 (size: 0x70)
    class UCurveFloat* WorldSpaceStrengthMultiplier;                                  // 0x0070 (size: 0x8)
    class UCurveFloat* WorldSpaceBlendValue;                                          // 0x0078 (size: 0x8)
    FPhysicsControlMultiplier ParentSpaceControlMultiplier;                           // 0x0080 (size: 0x70)
    class UCurveFloat* ParentSpaceStrengthMultiplier;                                 // 0x00F0 (size: 0x8)

}; // Size: 0xF8

struct FAnimHitPhysics
{
    class UPhysicsControlComponent* Control;                                          // 0x0000 (size: 0x8)
    FPhysicsControlNames AllBodyModifiers;                                            // 0x0008 (size: 0x10)
    TMap<class FName, class FPhysicsControlNames> LimbBodyModifiers;                  // 0x0018 (size: 0x50)
    EAnimConstraintProfile HitConstraintProfile;                                      // 0x0068 (size: 0x1)
    FAnimPhysicSpaceControl WorldSpaceControls;                                       // 0x0070 (size: 0xA8)
    FAnimPhysicSpaceControl ParentSpaceControls;                                      // 0x0118 (size: 0xA8)
    TArray<FPhysicsControlLimbSetupData> LimbSetup;                                   // 0x01C0 (size: 0x10)
    TMap<class FName, class FAnimHitPhysCurves> HitCurvesForLimbs;                    // 0x01D0 (size: 0x50)
    float ImpulseDelay;                                                               // 0x0220 (size: 0x4)
    float HitStrength;                                                                // 0x0224 (size: 0x4)
    float DeadHitStrength;                                                            // 0x0228 (size: 0x4)
    TMap<EDamageSource, float> DeathDamageSourceImpulses;                             // 0x0230 (size: 0x50)
    TMap<class FName, class FAnimBonesArray> SetsOfBoneModifiersArray;                // 0x0280 (size: 0x50)
    TArray<FName> BodyModifierForKinematicMovement;                                   // 0x02D0 (size: 0x10)
    bool bEnableAllControlsOnHit;                                                     // 0x0380 (size: 0x1)

}; // Size: 0x388

struct FAnimHumanAimingData
{
    bool bIsAiming;                                                                   // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FAnimHumanCollectionsData
{
    class UHumanDefaultAnimCollection* DefaultAnimCollection;                         // 0x0000 (size: 0x8)
    class UHumanAnimCollection* AnimCollection;                                       // 0x0008 (size: 0x8)
    class UHumanFirearmAnimCollection* FirearmAnimCollection;                         // 0x0010 (size: 0x8)
    FHumanExternalAnimations ExternalAnimations;                                      // 0x0018 (size: 0xD0)
    FHumanWeaponExternalAnimations WeaponExternalAnimations;                          // 0x00E8 (size: 0x40)

}; // Size: 0x128

struct FAnimHumanDialogData
{
    TArray<FAnimSequenceWeighted> DialogIdleAnims;                                    // 0x0000 (size: 0x10)
    int32 LastIdleAnimsCount;                                                         // 0x0010 (size: 0x4)
    bool bDialogIdleChanged;                                                          // 0x0014 (size: 0x1)
    bool bInDialog;                                                                   // 0x0015 (size: 0x1)
    FFloatRange DialogIdleAnimCooldownRange;                                          // 0x0018 (size: 0x10)

}; // Size: 0x78

struct FAnimHumanFaceData
{
    TArray<class UAnimSequence*> DeathAnimations;                                     // 0x0000 (size: 0x10)
    class UAnimSequence* CurrentDeathAnimation;                                       // 0x0010 (size: 0x8)
    TArray<class UAnimMontage*> HitAnimations;                                        // 0x0018 (size: 0x10)
    class UAnimMontage* LastHitAnimation;                                             // 0x0028 (size: 0x8)
    TArray<class UAnimSequence*> WoundedAnimations;                                   // 0x0030 (size: 0x10)
    class UAnimSequence* CurrentWoundedAnimation;                                     // 0x0040 (size: 0x8)
    class UAnimSequence* LastWoundedAnimation;                                        // 0x0048 (size: 0x8)
    TMap<FName, float> BlendShapeCurves;                                              // 0x0050 (size: 0x50)
    EEmotionalFaceMasks CurrentFaceMask;                                              // 0x00A0 (size: 0x1)
    class USkeletalMeshComponent* FaceMeshComponent;                                  // 0x00A8 (size: 0x8)
    class USkeletalMeshComponent* CharacterSkeletalMeshComponent;                     // 0x00B0 (size: 0x8)
    FEyesLookAtData EyesLookAtData;                                                   // 0x00B8 (size: 0xC0)
    FAnimFaceBlendConfig FaceBlendConfig;                                             // 0x0178 (size: 0x60)
    EAnimationHeadTypes HeadType;                                                     // 0x01D8 (size: 0x1)
    TArray<float> BlockingMasks;                                                      // 0x01E0 (size: 0x10)
    TArray<FName> FastFaceBlendCurves;                                                // 0x01F0 (size: 0x10)
    TArray<FName> SlowFaceBlendCurves;                                                // 0x0200 (size: 0x10)
    bool bAlive;                                                                      // 0x0210 (size: 0x1)
    bool bIsThroatAnimationsEnabled;                                                  // 0x0211 (size: 0x1)
    bool bIsThroatAnimationPlaying;                                                   // 0x0212 (size: 0x1)
    bool bPlayingDummyDialogAnimation;                                                // 0x0213 (size: 0x1)
    bool bIsFaceAnimBlendingOut;                                                      // 0x0214 (size: 0x1)
    bool bIsFaceAnimPlaying;                                                          // 0x0215 (size: 0x1)
    bool bIsFaceTongueAnimPlaying;                                                    // 0x0216 (size: 0x1)
    float DisableIdleTongueCurveValue;                                                // 0x0218 (size: 0x4)

}; // Size: 0x220

struct FAnimHumanLookAtData
{
    class ULookAtRestrictionsDataAsset* RestrictionsConfigDA;                         // 0x0000 (size: 0x8)
    TArray<FRotationBodyPart> HorizontalBodyParts;                                    // 0x0008 (size: 0x10)
    TArray<FRotationBodyPart> VerticalBodyParts;                                      // 0x0018 (size: 0x10)
    FVector2D TargetRotation;                                                         // 0x0028 (size: 0x10)
    bool bIsRotating;                                                                 // 0x0130 (size: 0x1)
    bool bIsRotatingFullBody;                                                         // 0x0131 (size: 0x1)
    ELookAtOwnerState CurrentOwnerState;                                              // 0x0132 (size: 0x1)
    float FullBodyRotationRate;                                                       // 0x0134 (size: 0x4)
    float FullBodyRotationTimeGap;                                                    // 0x0138 (size: 0x4)
    bool bEnableCombatLookAt;                                                         // 0x013C (size: 0x1)
    float MaxLookAtAlphaChangeSpeed;                                                  // 0x0140 (size: 0x4)
    FVector LookAtLocation;                                                           // 0x0148 (size: 0x18)
    float LookAtAlpha;                                                                // 0x0160 (size: 0x4)
    bool bOnlyHeadRotateOnUpperBody;                                                  // 0x0164 (size: 0x1)
    float WeaponRotationInterpSpeed;                                                  // 0x0168 (size: 0x4)
    float WeaponRotationAngleOffset;                                                  // 0x016C (size: 0x4)
    FRotator TargetWeaponRotation;                                                    // 0x0170 (size: 0x18)
    float AdditionalWeaponTransformAlpha;                                             // 0x0188 (size: 0x4)
    FVector CloseToBodyWeaponShift;                                                   // 0x0190 (size: 0x18)
    float MaxWeaponShiftOnReload;                                                     // 0x01A8 (size: 0x4)
    bool bIsFullBodyRotatingBlockedOutside;                                           // 0x01AC (size: 0x1)

}; // Size: 0x1B0

struct FAnimHumanStateData : public FAnimStateData
{
    bool bInCombat;                                                                   // 0x0006 (size: 0x1)
    bool bWounded;                                                                    // 0x0007 (size: 0x1)
    bool bKnockedDown;                                                                // 0x0008 (size: 0x1)
    float KnockedDownPoseBlendTime;                                                   // 0x000C (size: 0x4)
    bool bCrouching;                                                                  // 0x0010 (size: 0x1)
    bool bSitting;                                                                    // 0x0011 (size: 0x1)
    bool bRotating;                                                                   // 0x0012 (size: 0x1)
    float CurveGaitValue;                                                             // 0x0014 (size: 0x4)
    float DynamicGaitValue;                                                           // 0x0018 (size: 0x4)
    float StateCurveValue;                                                            // 0x001C (size: 0x4)
    EAnimationStates CurveGaitState;                                                  // 0x0020 (size: 0x1)
    bool bHasMovementInput;                                                           // 0x0021 (size: 0x1)
    bool bHasContextualItemInHands;                                                   // 0x0022 (size: 0x1)
    bool bZombie;                                                                     // 0x0023 (size: 0x1)
    bool bSpawnedAsZombie;                                                            // 0x0024 (size: 0x1)
    bool bStandingUpAsZombie;                                                         // 0x0025 (size: 0x1)
    bool bShouldPlayLongBHIdle;                                                       // 0x0026 (size: 0x1)
    bool bDragDeadBody;                                                               // 0x0027 (size: 0x1)
    bool bShouldDisableLegIK;                                                         // 0x0028 (size: 0x1)
    bool bIsRenderRelevant;                                                           // 0x0029 (size: 0x1)
    float IsRotatingAngleThreshold;                                                   // 0x002C (size: 0x4)
    bool bShouldDisableInertialization;                                               // 0x0030 (size: 0x1)
    bool bMovementShouldDisableLookAt;                                                // 0x0031 (size: 0x1)
    bool bShouldCopyVirtualWeaponBone;                                                // 0x0032 (size: 0x1)
    bool bHasEmptyHandsInDialog;                                                      // 0x0033 (size: 0x1)
    bool bIsDeadAsNotZombie;                                                          // 0x0034 (size: 0x1)
    bool bIsDeadAsZombie;                                                             // 0x0035 (size: 0x1)
    bool bShouldTransitionToWeaponRelaxedIdle;                                        // 0x0036 (size: 0x1)
    bool bStandToRelaxIdle;                                                           // 0x0037 (size: 0x1)

}; // Size: 0x38

struct FAnimHumanWeaponConfig
{
    float CloseToBodyWeaponMinShift;                                                  // 0x0000 (size: 0x4)
    float CloseToBodyWeaponMaxShift;                                                  // 0x0004 (size: 0x4)
    FVector WeaponIKEffectorOffset;                                                   // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FAnimHumanWeaponData
{
    bool bHasWeaponInHands;                                                           // 0x0000 (size: 0x1)
    FAnimHumanAimingData AimingData;                                                  // 0x0001 (size: 0x1)
    bool bIsZombie;                                                                   // 0x0002 (size: 0x1)
    class USkeletalMeshComponent* WeaponMesh;                                         // 0x0008 (size: 0x8)
    class USkeletalMeshComponent* AttachMesh;                                         // 0x0010 (size: 0x8)
    FVector WeaponIKEffectorOffset;                                                   // 0x0018 (size: 0x18)
    bool bIsOneHanded;                                                                // 0x0030 (size: 0x1)

}; // Size: 0x38

struct FAnimInteractableData
{
    FVector InteractionDirection;                                                     // 0x0000 (size: 0x18)
    float InteractionDistance;                                                        // 0x0018 (size: 0x4)
    bool bShouldLerpToInteractable;                                                   // 0x001C (size: 0x1)
    float LerpSpeedMultiplier;                                                        // 0x0020 (size: 0x4)
    bool bShouldLerpIn3D;                                                             // 0x0024 (size: 0x1)
    bool bShouldToggleFOV;                                                            // 0x0025 (size: 0x1)
    TEnumAsByte<ECollisionEnabled::Type> CollisionType;                               // 0x0026 (size: 0x1)

}; // Size: 0x28

struct FAnimKnockDownData
{
    EKnockedDownState KnockedDownState;                                               // 0x0000 (size: 0x1)
    bool bIsStillKnockedDown;                                                         // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FAnimLocomotionData
{
    float Velocity;                                                                   // 0x0000 (size: 0x4)
    float AngleDirection;                                                             // 0x0004 (size: 0x4)
    float ClampedDirection;                                                           // 0x0008 (size: 0x4)
    uint8 BPDirection;                                                                // 0x000C (size: 0x1)
    EDirections Direction;                                                            // 0x000D (size: 0x1)
    FDirectionBlendData DirectionBlendParams;                                         // 0x0010 (size: 0x24)
    FMovementRotationStructure MovementRotation;                                      // 0x0034 (size: 0x28)
    float LegIKAlpha;                                                                 // 0x005C (size: 0x4)
    bool bLegIKEnabled;                                                               // 0x0060 (size: 0x1)
    FMovementPlayRateStructure MovementPlayRate;                                      // 0x0064 (size: 0x14)
    bool bEnablePlayRateCurves;                                                       // 0x0078 (size: 0x1)
    TMap<class EStateTag, class UCurveFloat*> MovementPlayRateCurves;                 // 0x0080 (size: 0x50)
    FVector HeadEvasionOffset;                                                        // 0x0118 (size: 0x18)

}; // Size: 0x130

struct FAnimMutantCollectionsData
{
    class UMutantAnimCollection* AnimCollection;                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAnimMutantStateData : public FAnimStateData
{
    bool bRotating;                                                                   // 0x0006 (size: 0x1)
    bool bStandToSit;                                                                 // 0x0007 (size: 0x1)
    bool bIsLeftHanded;                                                               // 0x0008 (size: 0x1)
    float ChanceToBeLeftHanded;                                                       // 0x000C (size: 0x4)
    float IsRotatingAngleThreshold;                                                   // 0x0010 (size: 0x4)
    EAwareness Awareness;                                                             // 0x0014 (size: 0x1)
    bool bShouldDisableLegIK;                                                         // 0x0015 (size: 0x1)
    bool bShouldDisableInertialization;                                               // 0x0016 (size: 0x1)

}; // Size: 0x18

struct FAnimPhysicSpaceControl
{
    FPhysicsControlData Data;                                                         // 0x0000 (size: 0x20)
    FPhysicsControlSettings Settings;                                                 // 0x0020 (size: 0x28)
    TMap<class FName, class FPhysicsControlNames> LimbControls;                       // 0x0048 (size: 0x50)
    FPhysicsControlNames AllControls;                                                 // 0x0098 (size: 0x10)

}; // Size: 0xA8

struct FAnimPhysicalData
{
    bool bEnablePhysicalHit;                                                          // 0x0001 (size: 0x1)
    FAnimHitPhysics Hit;                                                              // 0x0008 (size: 0x388)
    bool bRagdollEnabled;                                                             // 0x0390 (size: 0x1)
    bool bRagdollStaticPose;                                                          // 0x0391 (size: 0x1)
    bool bWasInRagdoll;                                                               // 0x0392 (size: 0x1)
    bool bUpBodyDirection;                                                            // 0x0393 (size: 0x1)
    FPoseSnapshot RagdollSnapshotPose;                                                // 0x0398 (size: 0x38)

}; // Size: 0x3D8

struct FAnimPlayerAimingData
{
    bool bAiming;                                                                     // 0x0000 (size: 0x1)
    float AimInFrame;                                                                 // 0x0004 (size: 0x4)
    float AimOutFrame;                                                                // 0x0008 (size: 0x4)
    float AimAlpha;                                                                   // 0x000C (size: 0x4)
    float AimCameraShakeAlpha;                                                        // 0x0010 (size: 0x4)
    EAnimationAimState AimState;                                                      // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FAnimPlayerAutoCoverData
{
    bool bFrontTraceBlocked;                                                          // 0x0000 (size: 0x1)
    bool bRightTraceBlocked;                                                          // 0x0001 (size: 0x1)
    bool bLeftTraceBlocked;                                                           // 0x0002 (size: 0x1)
    bool bUpTraceBlocked;                                                             // 0x0003 (size: 0x1)
    FVector LastNonBlockedSideTraceStart;                                             // 0x0008 (size: 0x18)
    bool bInCover;                                                                    // 0x0020 (size: 0x1)
    bool bAutoCoverActionActive;                                                      // 0x0021 (size: 0x1)
    float AimLeanTime;                                                                // 0x0024 (size: 0x4)
    float ApproachTransitionPlayRate;                                                 // 0x0028 (size: 0x4)
    float LeaningAlpha;                                                               // 0x002C (size: 0x4)
    bool bCanChangeLeanSide;                                                          // 0x0030 (size: 0x1)
    bool bCoverlessLeaning;                                                           // 0x0031 (size: 0x1)
    bool bCoverlessLeaningRight;                                                      // 0x0032 (size: 0x1)
    float MinRangeDistanceToCover;                                                    // 0x0034 (size: 0x4)
    float MaxRangeDistanceToChangeLeanSide;                                           // 0x0038 (size: 0x4)
    float TraceCapsuleRadius;                                                         // 0x003C (size: 0x4)
    float CoverForwardTraceRange;                                                     // 0x0040 (size: 0x4)
    float CoverAimTraceRange;                                                         // 0x0044 (size: 0x4)
    float CoverUpperTraceRange;                                                       // 0x0048 (size: 0x4)
    float CoverSideTracesRange;                                                       // 0x004C (size: 0x4)
    float CoverLeanTracesRange;                                                       // 0x0050 (size: 0x4)
    int32 CoverLeanTracesIterations;                                                  // 0x0054 (size: 0x4)
    float CoverTraceHorizontalShift;                                                  // 0x0058 (size: 0x4)
    float CoverTraceVerticalShift;                                                    // 0x005C (size: 0x4)
    float MinCoverWidth;                                                              // 0x0060 (size: 0x4)
    float ApproachTransitionMinPlayRate;                                              // 0x0064 (size: 0x4)
    float ApproachTransitionMaxPlayRate;                                              // 0x0068 (size: 0x4)
    EAutoCoverState CoverState;                                                       // 0x006C (size: 0x1)
    float HeadHeightStand;                                                            // 0x0070 (size: 0x4)
    float HeadHeightCrouch;                                                           // 0x0074 (size: 0x4)
    float HeadHeightLowCrouch;                                                        // 0x0078 (size: 0x4)
    float TickInterval;                                                               // 0x007C (size: 0x4)
    float AccumulatedTime;                                                            // 0x0080 (size: 0x4)
    bool bTraceDirectionBindedToCamera;                                               // 0x0084 (size: 0x1)

}; // Size: 0x88

struct FAnimPlayerBaseWeaponData
{
    ELongIdleType LongIdleType;                                                       // 0x0000 (size: 0x1)
    FCharacterItemWeightedAnimations InactiveIdle;                                    // 0x0008 (size: 0x18)
    float InactiveIdleFrame;                                                          // 0x0020 (size: 0x4)
    bool bActionSlotActive;                                                           // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FAnimPlayerCameraData
{
    FTransform TargetCameraTransform;                                                 // 0x0000 (size: 0x60)
    float CameraTransformAlpha;                                                       // 0x0060 (size: 0x4)
    float DetectorCameraShakeAlpha;                                                   // 0x0064 (size: 0x4)
    float ClampedControlPitch;                                                        // 0x0068 (size: 0x4)

}; // Size: 0x90

struct FAnimPlayerClimbingData
{
    bool bAnimClimbStarted;                                                           // 0x0000 (size: 0x1)
    EAnimClimbState AnimClimbState;                                                   // 0x0001 (size: 0x1)
    float ClimbUpSpeed;                                                               // 0x0004 (size: 0x4)
    float ClimbDownSpeed;                                                             // 0x0008 (size: 0x4)
    float EnterDownSpeed;                                                             // 0x000C (size: 0x4)
    float EnterUpSpeed;                                                               // 0x0010 (size: 0x4)
    float ExitUpSpeed;                                                                // 0x0014 (size: 0x4)
    float CameraYaw;                                                                  // 0x0018 (size: 0x4)
    float CameraPitch;                                                                // 0x001C (size: 0x4)
    bool bLongIdleEnable;                                                             // 0x0020 (size: 0x1)
    bool bJumpingOffLadderState;                                                      // 0x0021 (size: 0x1)
    bool bJumpingOffLadderBottomState;                                                // 0x0022 (size: 0x1)
    ELadderType LadderType;                                                           // 0x0023 (size: 0x1)
    float BottomOffset;                                                               // 0x0024 (size: 0x4)
    TMap<ELadderType, float> FrontOffset;                                             // 0x0028 (size: 0x50)
    float SingleStepHeight;                                                           // 0x0078 (size: 0x4)
    float CameraFocusOnExitTime;                                                      // 0x007C (size: 0x4)
    float CameraFocusOnExitInterpSpeed;                                               // 0x0080 (size: 0x4)
    class UCurveFloat* EnterTransitionCurve;                                          // 0x0088 (size: 0x8)
    float TimeToStartLongIdle;                                                        // 0x0090 (size: 0x4)

}; // Size: 0x130

struct FAnimPlayerCollectionsData
{
    class UPlayerDefaultAnimCollection* DefaultAnimCollection;                        // 0x0000 (size: 0x8)
    class UPlayerDefaultAnimCollection* DragDeadBodyAnimCollection;                   // 0x0008 (size: 0x8)
    class UPlayerAnimCollection* AnimCollection;                                      // 0x0010 (size: 0x8)
    class UPlayerFirearmAnimCollection* FirearmAnimCollection;                        // 0x0018 (size: 0x8)
    class UPlayerThrowableItemAnimCollection* ThrowableAnimCollection;                // 0x0020 (size: 0x8)
    class UPlayerKnifeAnimCollection* KnifeAnimCollection;                            // 0x0028 (size: 0x8)
    class UItemAnimCollection* ItemAnimCollection;                                    // 0x0030 (size: 0x8)
    class UInteractableAnimCollection* ItemInteractableAnimCollection;                // 0x0038 (size: 0x8)
    class UWeaponAttachAnimCollection* AttachAnimCollection;                          // 0x0040 (size: 0x8)
    class UPlayerDetectorAnimCollection* DetectorAnimCollection;                      // 0x0048 (size: 0x8)
    FPlayerExternalAnimations ExternalAnimations;                                     // 0x0050 (size: 0x278)
    bool bWeaponSubgraphToggle;                                                       // 0x02C8 (size: 0x1)
    float WeaponSubgraphBlend;                                                        // 0x02CC (size: 0x4)
    bool bAdditionalSubgraphToggle;                                                   // 0x02D0 (size: 0x1)
    float AdditionalSubgraphBlend;                                                    // 0x02D4 (size: 0x4)
    TMap<ESubgraphBlendTypes, float> SubgraphDefaultBlendTime;                        // 0x02D8 (size: 0x50)

}; // Size: 0x328

struct FAnimPlayerDetectorData
{
    bool bHasDetectorInHands;                                                         // 0x0000 (size: 0x1)
    class USkeletalMeshComponent* DetectorSkeletal;                                   // 0x0008 (size: 0x8)
    FAnimPlayerWeaponSwingData SwingData;                                             // 0x0010 (size: 0x80)
    FAnimPlayerWeaponInertiaData InertiaData;                                         // 0x0090 (size: 0x98)

}; // Size: 0x128

struct FAnimPlayerDialogData
{
    bool bInDialog;                                                                   // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FAnimPlayerDodgeData
{
    TSet<AObj*> CollidedObjects;                                                      // 0x0000 (size: 0x50)

}; // Size: 0x68

struct FAnimPlayerFirearmData
{
    EWeaponIdleType IdleType;                                                         // 0x0000 (size: 0x1)
    EShutterState ShutterState;                                                       // 0x0001 (size: 0x1)
    bool IsJammed;                                                                    // 0x0002 (size: 0x1)
    int32 JamIdleIndex;                                                               // 0x0004 (size: 0x4)
    bool bTwinMagazineShifted;                                                        // 0x0008 (size: 0x1)
    EWeaponCustomAdditionalIdle AdditionalIdle;                                       // 0x0009 (size: 0x1)
    EFireType FireTypes;                                                              // 0x000A (size: 0x1)
    float LeftHandCurveValueInverse;                                                  // 0x000C (size: 0x4)
    float WeaponLeftHandCurveValueInverse;                                            // 0x0010 (size: 0x4)
    float LeftHandMovementAlpha;                                                      // 0x0014 (size: 0x4)
    bool bIsLeftHandIdleUnlocked;                                                     // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FAnimPlayerGuitarData
{
    float CameraPitchLimit;                                                           // 0x0000 (size: 0x4)
    float CameraYawLimit;                                                             // 0x0004 (size: 0x4)
    float CameraResetInterpSpeed;                                                     // 0x0008 (size: 0x4)
    int32 CurrentChord;                                                               // 0x000C (size: 0x4)
    EAnimGuitarState AnimGuitarState;                                                 // 0x0010 (size: 0x1)
    EAnimGuitarRightHandState RightHandState;                                         // 0x0011 (size: 0x1)
    bool bPlayingGuitar;                                                              // 0x0012 (size: 0x1)
    bool bPlayFromContextual;                                                         // 0x0013 (size: 0x1)
    bool bIsMajorScale;                                                               // 0x0014 (size: 0x1)
    bool bShouldExitGuitar;                                                           // 0x0015 (size: 0x1)
    bool bAutoStrumMode;                                                              // 0x0016 (size: 0x1)
    float CameraYaw;                                                                  // 0x0018 (size: 0x4)
    float CameraPitch;                                                                // 0x001C (size: 0x4)

}; // Size: 0x24

struct FAnimPlayerHitData
{
    class UAnimSequence* DeathSequence;                                               // 0x0000 (size: 0x8)
    float DeathCameraDistance;                                                        // 0x0008 (size: 0x4)
    float HitDirection;                                                               // 0x000C (size: 0x4)
    FVector HitLocation;                                                              // 0x0010 (size: 0x18)
    EPlayerAnimDamageSource DeathDamageSource;                                        // 0x0028 (size: 0x1)
    EAnimDirections HitAnimDirection;                                                 // 0x0029 (size: 0x1)
    EDeathAnimationType DeathAnimationType;                                           // 0x002A (size: 0x1)
    bool bDiedLyingDown;                                                              // 0x002B (size: 0x1)
    bool bIsDeathAnimationEnded;                                                      // 0x002C (size: 0x1)
    bool bKnockedDown;                                                                // 0x002D (size: 0x1)
    FRotator KnockDownRotation;                                                       // 0x0030 (size: 0x18)
    class UCurveFloat* KnockDownRotateCurve;                                          // 0x0048 (size: 0x8)

}; // Size: 0x80

struct FAnimPlayerIdleSwayData
{
    class UCurveVector* BaseCurve;                                                    // 0x0000 (size: 0x8)
    class UCurveVector* StaminaAmplitudeCurve;                                        // 0x0008 (size: 0x8)
    class UCurveFloat* StaminaCycleTimeCurve;                                         // 0x0010 (size: 0x8)
    float InitialDelay;                                                               // 0x0018 (size: 0x4)
    float StandCycleTimeModifier;                                                     // 0x001C (size: 0x4)
    float StandAmplitudeXModifier;                                                    // 0x0020 (size: 0x4)
    float StandAmplitudeYModifier;                                                    // 0x0024 (size: 0x4)
    float CrouchCycleTimeModifier;                                                    // 0x0028 (size: 0x4)
    float CrouchAmplitudeXModifier;                                                   // 0x002C (size: 0x4)
    float CrouchAmplitudeYModifier;                                                   // 0x0030 (size: 0x4)
    float MoveCycleTimeModifier;                                                      // 0x0034 (size: 0x4)
    float MoveAmplitudeXModifier;                                                     // 0x0038 (size: 0x4)
    float MoveAmplitudeYModifier;                                                     // 0x003C (size: 0x4)
    FRotator Rotation;                                                                // 0x0040 (size: 0x18)
    float Alpha;                                                                      // 0x0058 (size: 0x4)
    class UCurveVector* ActiveCurve;                                                  // 0x0060 (size: 0x8)
    float InterpSpeed;                                                                // 0x0068 (size: 0x4)

}; // Size: 0xF0

struct FAnimPlayerLookAtData
{
    TMap<class FName, class FAnimPlayerLookAtPreset> Presets;                         // 0x0000 (size: 0x50)
    FAnimPlayerLookAtPreset ActivePreset;                                             // 0x0050 (size: 0xC)
    class UCurveFloat* EnteringSpeed;                                                 // 0x0060 (size: 0x8)
    class UCurveFloat* CenteringSpeed;                                                // 0x0068 (size: 0x8)
    class UCurveFloat* CursorFreemoveDistanceFactor;                                  // 0x0070 (size: 0x8)
    class UCurveFloat* CursorApproachDirectionFactor;                                 // 0x0078 (size: 0x8)
    float CenteringTime;                                                              // 0x00A8 (size: 0x4)
    float PlayerLookAtTimer;                                                          // 0x00AC (size: 0x4)
    float MaxFreemoveSpeed;                                                           // 0x00B0 (size: 0x4)
    float MinStopSpeed;                                                               // 0x00B4 (size: 0x4)
    float DialogEnteringTime;                                                         // 0x00B8 (size: 0x4)
    float SwitchTargertFactor;                                                        // 0x00BC (size: 0x4)

}; // Size: 0xD0

struct FAnimPlayerLookAtPreset
{
    float RotationFreemoveEdge;                                                       // 0x0000 (size: 0x4)
    float RotationStopEdge;                                                           // 0x0004 (size: 0x4)
    bool bShouldRepeatTargetMovement;                                                 // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FAnimPlayerMaterialData
{
    class UMaterialParameterCollection* FoliageCollectionAsset;                       // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FAnimPlayerShadowData
{
    TArray<FSnapshotMapping> SnapshotMapping;                                         // 0x0000 (size: 0x10)
    bool bHasWeaponInHands;                                                           // 0x0010 (size: 0x1)
    bool bAiming;                                                                     // 0x0011 (size: 0x1)
    bool bShouldUseBHLocomotion;                                                      // 0x0012 (size: 0x1)
    float AngleDirection;                                                             // 0x0014 (size: 0x4)
    float TurnTime;                                                                   // 0x0018 (size: 0x4)
    FMovementPlayRateStructure MovementPlayRate;                                      // 0x001C (size: 0x14)

}; // Size: 0x30

struct FAnimPlayerStateData : public FAnimStateData
{
    bool bWalkingOverride;                                                            // 0x0006 (size: 0x1)
    bool bCrouching;                                                                  // 0x0007 (size: 0x1)
    bool bLowCrouching;                                                               // 0x0008 (size: 0x1)
    bool bClimbing;                                                                   // 0x0009 (size: 0x1)
    bool bLimping;                                                                    // 0x000A (size: 0x1)
    bool bShootingUnfocusableTarget;                                                  // 0x000B (size: 0x1)
    bool bDragDeadBody;                                                               // 0x000C (size: 0x1)
    bool bActionSlotActive;                                                           // 0x000D (size: 0x1)
    bool bIsLeftHandBusy;                                                             // 0x000E (size: 0x1)
    bool bIsInspectingItem;                                                           // 0x000F (size: 0x1)
    bool bCrouchingOverride;                                                          // 0x0010 (size: 0x1)
    bool bLowCrouchingOverride;                                                       // 0x0011 (size: 0x1)
    bool bSprintingOverride;                                                          // 0x0012 (size: 0x1)
    bool bInAirOverride;                                                              // 0x0013 (size: 0x1)
    float CrouchingInWaterInterruptionTime;                                           // 0x0014 (size: 0x4)
    float SprintingInWaterInterruptionTime;                                           // 0x0018 (size: 0x4)
    float InAirInWaterInterruptionTime;                                               // 0x001C (size: 0x4)
    float CombatIdleDuration;                                                         // 0x0020 (size: 0x4)
    bool bCombatMoveIdle;                                                             // 0x0024 (size: 0x1)
    bool bCombatCrouchIdle;                                                           // 0x0025 (size: 0x1)
    bool bCombatActionActive;                                                         // 0x0026 (size: 0x1)
    float CombatIdleCooldown;                                                         // 0x0028 (size: 0x4)
    bool bForceBindedHandsLookVertical;                                               // 0x002C (size: 0x1)
    bool bHasExoskeleton;                                                             // 0x002D (size: 0x1)
    float CurveGaitValue;                                                             // 0x0030 (size: 0x4)
    float DynamicGaitValue;                                                           // 0x0034 (size: 0x4)
    EAnimationStates EnumGaitState;                                                   // 0x0038 (size: 0x1)

}; // Size: 0x3C

struct FAnimPlayerStealthData
{
    bool bStealth;                                                                    // 0x0000 (size: 0x1)
    float StealthInFrame;                                                             // 0x0004 (size: 0x4)
    float StealthOutFrame;                                                            // 0x0008 (size: 0x4)
    float StealthAlpha;                                                               // 0x000C (size: 0x4)
    EAnimationStealthState StealthState;                                              // 0x0010 (size: 0x1)
    class UCurveFloat* StealthKillSnapCurve;                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FAnimPlayerTransitionData
{
    bool bHasVelocity;                                                                // 0x0000 (size: 0x1)
    bool bMovingUp;                                                                   // 0x0001 (size: 0x1)
    bool bMovingDown;                                                                 // 0x0002 (size: 0x1)
    bool bReadyForLanding;                                                            // 0x0003 (size: 0x1)
    bool bCanEnterSprint;                                                             // 0x0004 (size: 0x1)
    float LerpToTargetAlpha;                                                          // 0x0008 (size: 0x4)
    float LerpToTargetTime;                                                           // 0x000C (size: 0x4)

}; // Size: 0x70

struct FAnimPlayerUnfocusableTargetData
{
    bool bTargetingUnfocusable;                                                       // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FAnimPlayerVaultingData
{
    EVaultState State;                                                                // 0x0000 (size: 0x1)
    bool bIsVaulting;                                                                 // 0x0001 (size: 0x1)
    bool bIsAnimInProgress;                                                           // 0x0002 (size: 0x1)
    bool bIsVaultingOver;                                                             // 0x0003 (size: 0x1)
    bool bIsVaultingOnTop;                                                            // 0x0004 (size: 0x1)
    class UAnimSequence* Sequence;                                                    // 0x0008 (size: 0x8)
    float VaultAlpha;                                                                 // 0x0010 (size: 0x4)
    TMap<class EMainHandEquipmentType, class UAnimSequence*> VaultingSequences;       // 0x0018 (size: 0x50)
    TMap<class EMainHandEquipmentType, class UAnimSequence*> VaultOverSequences;      // 0x0068 (size: 0x50)

}; // Size: 0xB8

struct FAnimPlayerWeaponData
{
    bool bHasWeaponInHands;                                                           // 0x0000 (size: 0x1)
    class USkeletalMeshComponent* WeaponMesh;                                         // 0x0008 (size: 0x8)
    class USkeletalMeshComponent* AttachMesh;                                         // 0x0010 (size: 0x8)
    FAnimPlayerBaseWeaponData BaseWeaponData;                                         // 0x0018 (size: 0x28)
    FAnimPlayerAimingData AimingData;                                                 // 0x0040 (size: 0x18)
    FAnimPlayerFirearmData FirearmData;                                               // 0x0058 (size: 0x1C)

}; // Size: 0x78

struct FAnimPlayerWeaponInertiaData
{
    float AlphaInterpSpeed;                                                           // 0x0000 (size: 0x4)
    float TranslationInterpSpeed;                                                     // 0x0004 (size: 0x4)
    float RotationInterpSpeed;                                                        // 0x0008 (size: 0x4)
    float InertiaStartThreshold;                                                      // 0x000C (size: 0x4)
    class UCurveVector* RotationCurve;                                                // 0x0040 (size: 0x8)
    class UCurveVector* TranslationCurve;                                             // 0x0048 (size: 0x8)
    class UCurveFloat* TimeScaleCurve;                                                // 0x0050 (size: 0x8)
    class UCurveFloat* AmplitudeScaleCurve;                                           // 0x0058 (size: 0x8)
    FRotator AdditionalInertiaRotation;                                               // 0x0060 (size: 0x18)
    FVector AdditionalInertiaTranslation;                                             // 0x0078 (size: 0x18)
    float InertiaAlpha;                                                               // 0x0090 (size: 0x4)

}; // Size: 0x98

struct FAnimPlayerWeaponPushbackData
{
    float PushbackInteprolateTolerance;                                               // 0x0000 (size: 0x4)
    float PushbackInteprolateSpeed;                                                   // 0x0004 (size: 0x4)
    EAnimPushbackState State;                                                         // 0x0008 (size: 0x1)
    float Alpha;                                                                      // 0x000C (size: 0x4)
    FVector WeaponTranslation;                                                        // 0x0010 (size: 0x18)
    FRotator WeaponRotation;                                                          // 0x0028 (size: 0x18)
    FAlphaBlend Blend;                                                                // 0x0040 (size: 0x30)

}; // Size: 0x80

struct FAnimPlayerWeaponSwingData
{
    FRotator ItemTotalRotation;                                                       // 0x0020 (size: 0x18)
    FVector ItemTotalShift;                                                           // 0x0038 (size: 0x18)
    FVector ItemSocketTotalShift;                                                     // 0x0050 (size: 0x18)

}; // Size: 0x80

struct FAnimPoseSearchLocomotionData
{
    FTrajectorySampleRange Trajectory;                                                // 0x0000 (size: 0x18)
    FGameplayTagContainer Tags;                                                       // 0x0018 (size: 0x20)
    class UCurveFloat* StrafeRotateInterpSpeedCurve;                                  // 0x0038 (size: 0x8)
    bool bForcedIdling;                                                               // 0x0040 (size: 0x1)
    bool bShouldInterrupt;                                                            // 0x0041 (size: 0x1)
    float EnableLookAtAlpha;                                                          // 0x0044 (size: 0x4)
    FMotionMatchingSettings Settings;                                                 // 0x0048 (size: 0x30)
    FPoseSearchProceduralMovement ProceduralMovement;                                 // 0x0080 (size: 0x70)
    FWarpingVectorValue FloorNormal;                                                  // 0x00F0 (size: 0x20)
    class UPoseSearchSearchableAsset* Searchable;                                     // 0x0110 (size: 0x8)
    float StrideScale;                                                                // 0x0118 (size: 0x4)
    float LegIKAlpha;                                                                 // 0x011C (size: 0x4)
    bool bUseRelaxLocomotion;                                                         // 0x0120 (size: 0x1)
    float HistoryExpirationSeconds;                                                   // 0x012C (size: 0x4)
    TMap<EAnimPoseSearchMoveType, float> MoveTypeStayInIndexTime;                     // 0x0130 (size: 0x50)
    ESmartCoverType SmartCoverType;                                                   // 0x0180 (size: 0x1)
    bool bUsingSmartCoverAnimPose;                                                    // 0x0181 (size: 0x1)
    float MoveBehaviorOnlyTransitionUseTime;                                          // 0x0184 (size: 0x4)
    class UPoseSearchLocomotionCharacterMovementComponent* MovementComponent;         // 0x01C0 (size: 0x8)

}; // Size: 0x1D0

struct FAnimSequenceArray
{
    TArray<TSoftObjectPtr<UAnimSequenceBase>> Animations;                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimSequenceWeighted
{
    float ChanceToPlay;                                                               // 0x0000 (size: 0x4)
    class UAnimSequenceBase* Animation;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FAnimSequenceWeightedArray
{
    TArray<FSoftAnimWeighted> Animations;                                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAnimSleepData
{
    bool bSleep;                                                                      // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FAnimStateData
{
    bool bAlive;                                                                      // 0x0000 (size: 0x1)
    bool bMoving;                                                                     // 0x0001 (size: 0x1)
    bool bWalking;                                                                    // 0x0002 (size: 0x1)
    bool bRunning;                                                                    // 0x0003 (size: 0x1)
    bool bSprinting;                                                                  // 0x0004 (size: 0x1)
    bool bInAir;                                                                      // 0x0005 (size: 0x1)

}; // Size: 0x6

struct FAnimTwoHandsIKData
{
    FAnimHandIKData LeftHand;                                                         // 0x0008 (size: 0x38)
    FAnimHandIKData RightHand;                                                        // 0x0040 (size: 0x38)

}; // Size: 0x78

struct FAnimValveData
{
    EValveState ValveState;                                                           // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FAnimWeaponSwingContainer
{
    class UCurveFloat* ItemRotationCurve;                                             // 0x0000 (size: 0x8)
    class UCurveFloat* ItemHorizontalTranslationShiftCurve;                           // 0x0008 (size: 0x8)
    class UCurveFloat* ItemSocketHorizontalTranslationShiftCurve;                     // 0x0010 (size: 0x8)
    class UCurveFloat* ItemVerticalTranslationShiftCurve;                             // 0x0018 (size: 0x8)
    class UCurveFloat* ItemExtraVerticalTranslationShiftCurve;                        // 0x0020 (size: 0x8)
    float HorizontalItemTranslationInterpSpeed;                                       // 0x0028 (size: 0x4)
    float VerticalItemTranslationInterpSpeed;                                         // 0x002C (size: 0x4)
    float ItemRotationInterpSpeed;                                                    // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FAnimWoundedData
{
    bool bWounded;                                                                    // 0x0000 (size: 0x1)
    EWoundedAnimState WoundedState;                                                   // 0x0001 (size: 0x1)
    FRotator SlopeCorrectionDelta;                                                    // 0x0008 (size: 0x18)
    float EnterRagdollTime;                                                           // 0x0020 (size: 0x4)
    float SlopeTestSweepUpOffset;                                                     // 0x0024 (size: 0x4)
    float SlopeTestSweepDownOffset;                                                   // 0x0028 (size: 0x4)
    float SlopeTestSweepSphereRadius;                                                 // 0x002C (size: 0x4)
    TEnumAsByte<ECollisionChannel> SlopeTestCollisionChannel;                         // 0x0030 (size: 0x1)

}; // Size: 0x48

struct FAnimationSingleHit
{
    bool bPlay;                                                                       // 0x0000 (size: 0x1)
    float PlayRate;                                                                   // 0x0004 (size: 0x4)
    float HitDirection;                                                               // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FAnomalyCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FAnomalyHitArgs
{
}; // Size: 0x1

struct FAnomalyModelCollection : public FBaseModelCollection
{
}; // Size: 0xA0

struct FArtifactCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FAttachDetachAnimations
{
    FCharacterWeaponAnimations AttachAnimation;                                       // 0x0000 (size: 0x20)
    FCharacterWeaponAnimations DetachAnimation;                                       // 0x0020 (size: 0x20)
    FCharacterWeaponAnimations DetachTwinMagazineShifted;                             // 0x0040 (size: 0x20)
    UClass* AttachAnimBlueprint;                                                      // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FAttachMeshesData
{
    TArray<class UMeshComponent*> ArrayMeshes;                                        // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FAttachedMagazineStruct
{
    class UMeshComponent* MagazineMesh;                                               // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FAttractionPoint
{
    TWeakObjectPtr<class AActor> LookAtActor;                                         // 0x0050 (size: 0x8)
    TWeakObjectPtr<class USkeletalMeshComponent> SkeletalMesh;                        // 0x0058 (size: 0x8)
    FName SID;                                                                        // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FAutoInteractionData : public FInteractionData
{
}; // Size: 0x18

struct FBackgroundSettings
{
    class UTexture2D* Icon;                                                           // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FBaseLegIKData
{
}; // Size: 0x8

struct FBaseModelCollection : public FBaseTickAggregationCollection
{
}; // Size: 0xA0

struct FBaseTickAggregationCollection
{
}; // Size: 0x68

struct FBodyMeshSIDSelector
{
    FString Value;                                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBodyPartRestriction
{
    float RotationLimit;                                                              // 0x0000 (size: 0x4)
    float RotationSpeed;                                                              // 0x0004 (size: 0x4)
    bool RotationBlocked;                                                             // 0x0008 (size: 0x1)
    bool bShouldRotateIndependently;                                                  // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FBoolOverridableProperty : public FOverridableProperty
{
    bool DefaultValue;                                                                // 0x0018 (size: 0x1)
    bool CurrentValue;                                                                // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FBuckRecoilKeys
{
    TArray<FRecoilKeys> BuckRecoilKeys;                                               // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FBulletProjectileHitArgs
{
    EAmmoType Type;                                                                   // 0x0000 (size: 0x1)
    EAmmoCaliber Caliber;                                                             // 0x0001 (size: 0x1)

}; // Size: 0xC

struct FCaptureConfig
{
    float CaptureAngle;                                                               // 0x0000 (size: 0x4)
    float CaptureWarmup;                                                              // 0x0004 (size: 0x4)
    float TileLimitsForZCoords;                                                       // 0x0008 (size: 0x4)
    float LoadTileOverlapSize;                                                        // 0x000C (size: 0x4)
    float CaptureTileOverlap;                                                         // 0x0010 (size: 0x4)
    FVector CaptureStartLocation;                                                     // 0x0018 (size: 0x18)
    int32 WorldPartitionTiles;                                                        // 0x0030 (size: 0x4)
    int32 LargeImagesNum;                                                             // 0x0034 (size: 0x4)
    float IterativeCellSize;                                                          // 0x0038 (size: 0x4)
    uint32 SingleTileMinimapResolution;                                               // 0x003C (size: 0x4)
    float TargetGamma;                                                                // 0x0040 (size: 0x4)
    bool bCreateFoliage;                                                              // 0x0044 (size: 0x1)

}; // Size: 0x48

struct FChangeFireTypeAnimation
{
    EFireType FromFireType;                                                           // 0x0000 (size: 0x1)
    EFireType ToFireType;                                                             // 0x0001 (size: 0x1)
    FCharacterWeaponAnimations Animations;                                            // 0x0008 (size: 0x20)

}; // Size: 0x28

struct FChangeFireTypeAnimations
{
    TArray<FChangeFireTypeAnimation> AnimationsArray;                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FCharacterDetectorAnimations
{
    class UAnimMontage* Character;                                                    // 0x0000 (size: 0x8)
    TMap<int32, FCharacterWeaponAnimations> CharacterWithWeapon;                      // 0x0008 (size: 0x50)
    class UAnimMontage* Detector;                                                     // 0x0058 (size: 0x8)
    class UAnimMontage* Weapon;                                                       // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FCharacterDetectorFailedLandingAnimations
{
    TMap<class EMainHandEquipmentType, class UAnimMontage*> FailedLanding;            // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FCharacterDetectorWeaponAnimations
{
    class UAnimMontage* CharacterLeftHand;                                            // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCharacterItemWeightedAnimations
{
    class UAnimSequence* Character;                                                   // 0x0000 (size: 0x8)
    class UAnimSequence* Item;                                                        // 0x0008 (size: 0x8)
    float Weight;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FCharacterWeaponAnimations
{
    class UAnimMontage* Character;                                                    // 0x0000 (size: 0x8)
    class UAnimMontage* CharacterLeftHand;                                            // 0x0008 (size: 0x8)
    class UAnimMontage* Weapon;                                                       // 0x0010 (size: 0x8)
    float PlayRate;                                                                   // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FCodelockInteractionAnimations
{
    class UAnimMontage* CodelockMontage;                                              // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCommonHitArgs
{
    float Damage;                                                                     // 0x0000 (size: 0x4)
    float ImpulseStr;                                                                 // 0x0004 (size: 0x4)
    float ArmorDamage;                                                                // 0x0008 (size: 0x4)
    float ArmorPiercing;                                                              // 0x000C (size: 0x4)
    float Bleeding;                                                                   // 0x0010 (size: 0x4)
    float BleedingChanceIncrement;                                                    // 0x0014 (size: 0x4)
    FVector ImpulseDir;                                                               // 0x0018 (size: 0x18)
    FUID DamageDealerUID;                                                             // 0x0030 (size: 0x4)
    FHitResult HitResult;                                                             // 0x0038 (size: 0xE8)
    EDamageType DamageType;                                                           // 0x0120 (size: 0x1)
    bool bDirectDamageSkipCalculations;                                               // 0x0121 (size: 0x1)
    bool bShouldIgnoreArmor;                                                          // 0x0122 (size: 0x1)
    TArray<FEffectValueOverridePair> ApplicableEffects;                               // 0x0128 (size: 0x10)
    EDamageSource DamageSource;                                                       // 0x0138 (size: 0x1)
    FWeapon Weapon;                                                                   // 0x013C (size: 0x8)
    bool bFlownThroughObject;                                                         // 0x0144 (size: 0x1)
    float LaunchTimestamp;                                                            // 0x0148 (size: 0x4)
    bool bIsFractionDamage;                                                           // 0x014C (size: 0x1)

}; // Size: 0x150

struct FCompassTypeSettings
{
    bool bIsCompassType;                                                              // 0x0000 (size: 0x1)
    bool bVisibleIfTrack;                                                             // 0x0001 (size: 0x1)
    ECompassPosition CompassPosition;                                                 // 0x0002 (size: 0x1)
    int32 ZOrder;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FComplexAttachAnimations
{
    EWeaponIdleType WeaponIdleType;                                                   // 0x0000 (size: 0x1)
    class UAnimMontage* AttachAttachingAnimation;                                     // 0x0008 (size: 0x8)
    class UAnimMontage* AttachDetachingAnimation;                                     // 0x0010 (size: 0x8)
    class UAnimMontage* CharacterAttachModeIn;                                        // 0x0018 (size: 0x8)
    class UAnimMontage* WeaponAttachModeIn;                                           // 0x0020 (size: 0x8)
    class UAnimMontage* AttachAttachModeIn;                                           // 0x0028 (size: 0x8)
    class UAnimMontage* CharacterAttachModeOut;                                       // 0x0030 (size: 0x8)
    class UAnimMontage* WeaponAttachModeOut;                                          // 0x0038 (size: 0x8)
    class UAnimMontage* AttachAttachModeOut;                                          // 0x0040 (size: 0x8)
    bool bIsBindedToWeaponBehaviour;                                                  // 0x0048 (size: 0x1)
    class UAnimMontage* CharacterAttachShoot;                                         // 0x0050 (size: 0x8)
    class UAnimMontage* WeaponAttachShoot;                                            // 0x0058 (size: 0x8)
    class UAnimMontage* AttachAttachShoot;                                            // 0x0060 (size: 0x8)
    class UAnimMontage* CharacterAttachReload;                                        // 0x0068 (size: 0x8)
    class UAnimMontage* WeaponAttachReload;                                           // 0x0070 (size: 0x8)
    class UAnimMontage* AttachAttachReload;                                           // 0x0078 (size: 0x8)
    class UAnimMontage* CharacterAttachReloadTactical;                                // 0x0080 (size: 0x8)
    class UAnimMontage* WeaponAttachReloadTactical;                                   // 0x0088 (size: 0x8)
    class UAnimMontage* AttachAttachReloadTactical;                                   // 0x0090 (size: 0x8)
    class UAnimMontage* AttachAttachShootEnd;                                         // 0x0098 (size: 0x8)
    TArray<class UAnimMontage*> AttachJamAnimations;                                  // 0x00A0 (size: 0x10)
    class UPlayerFirearmAnimCollection* WeaponAnimCollection;                         // 0x00B0 (size: 0x8)

}; // Size: 0xB8

struct FContextualActionGlobalVariablePrototypeSID
{
    FString Value;                                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FContextualActionModelCollection : public FBaseModelCollection
{
}; // Size: 0xA0

struct FContextualActionNotifyWeaponEquipData
{
    FPrototypeSID ItemSID;                                                            // 0x0000 (size: 0x40)
    EMainHandEquipmentType SlotToEquip;                                               // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FContextualActionsGameGraphInfo
{
    TArray<uint32> GameGraphVertices;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FContextualItemAttachment
{
    EContextualItemAttachType ContextualItemAttachType;                               // 0x0000 (size: 0x4)
    FName SocketName;                                                                 // 0x0004 (size: 0x8)
    FName AttachmentName;                                                             // 0x000C (size: 0x8)
    class UStaticMesh* MeshToBeAttached;                                              // 0x0018 (size: 0x8)
    class USkeletalMesh* SkeletalMeshToBeAttached;                                    // 0x0020 (size: 0x8)
    class UNiagaraSystem* NiagaraAsset;                                               // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FContextualItemDetachment
{
    FName AttachmentName;                                                             // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FCreatorTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FCriticalHitAnimations
{
    TSet<FName> HitBones;                                                             // 0x0000 (size: 0x50)
    TArray<FDirectionalAnimation> DirectionalAnimations;                              // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FCutsceneBlinkConfig
{
    float MinTimeInterval;                                                            // 0x0000 (size: 0x4)
    float MaxTimeInterval;                                                            // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FDamageInteractVFXData
{
    class UNiagaraComponent* InteractDamageVFX;                                       // 0x0000 (size: 0x8)

}; // Size: 0x10

struct FDeadBodyInteractionData : public FActorInteractionData
{
    bool bOverweight;                                                                 // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FDebugRestrictionSettings
{
    TArray<class TSubclassOf<UNavArea>> InRestrictedAreas;                            // 0x0000 (size: 0x10)
    TArray<class TSubclassOf<UNavArea>> OutRestrictedAreas;                           // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDefaultRestrictions
{
    bool bEnabled;                                                                    // 0x0000 (size: 0x1)
    bool bIgnoreDuringEmission;                                                       // 0x0001 (size: 0x1)
    ESpaceRestrictionType GlobalRestriction;                                          // 0x0002 (size: 0x1)
    TArray<FAgentDomainRestrictions> AgentDomainRestrictions;                         // 0x0008 (size: 0x10)
    TArray<FFactionRestrictions> FactionRestrictions;                                 // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FDestructibleModelCollection : public FBaseModelCollection
{
}; // Size: 0xA0

struct FDestructibleObjectCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FDestructionAction
{
}; // Size: 0x18

struct FDetectorToggleFlashlightAnimations
{
    TMap<class EMainHandEquipmentType, class UAnimMontage*> ToggleFlashlight;         // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FDialogAnimationType
{
    EDialogAnimationType Value;                                                       // 0x0000 (size: 0x8)
    EDialogAnimationCategory DialogAnimationCategory;                                 // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FDialogAnswerInfo
{
    bool bAvailable;                                                                  // 0x0004 (size: 0x1)
    EDialogAnswerColor AnswerColor;                                                   // 0x0005 (size: 0x1)

}; // Size: 0x28

struct FDialogAnswersStyles
{
    FString AnswerDisabled;                                                           // 0x0000 (size: 0x10)
    FString AnswerDefault;                                                            // 0x0010 (size: 0x10)
    FString AnswerDefaultHovered;                                                     // 0x0020 (size: 0x10)
    FString AnswerDefaultRead;                                                        // 0x0030 (size: 0x10)
    FString AnswerDefaultHoveredRead;                                                 // 0x0040 (size: 0x10)
    FString AnswerQuest;                                                              // 0x0050 (size: 0x10)
    FString AnswerQuestHovered;                                                       // 0x0060 (size: 0x10)
    FString AnswerQuestRead;                                                          // 0x0070 (size: 0x10)
    FString AnswerQuestHoveredRead;                                                   // 0x0080 (size: 0x10)
    FString AnswerWithDangerAction;                                                   // 0x0090 (size: 0x10)
    FString AnswerWithDangerActionHovered;                                            // 0x00A0 (size: 0x10)
    FString AnswerWithGetAction;                                                      // 0x00B0 (size: 0x10)
    FString AnswerWithGetActionHovered;                                               // 0x00C0 (size: 0x10)
    FString AnswerWithGiveAction;                                                     // 0x00D0 (size: 0x10)
    FString AnswerWithGiveActionHovered;                                              // 0x00E0 (size: 0x10)
    FString ActionDisabled;                                                           // 0x00F0 (size: 0x10)
    FString ActionDefault;                                                            // 0x0100 (size: 0x10)
    FString ActionDefaultHovered;                                                     // 0x0110 (size: 0x10)
    FString ActionQuest;                                                              // 0x0120 (size: 0x10)
    FString ActionQuestHovered;                                                       // 0x0130 (size: 0x10)
    FString ActionDanger;                                                             // 0x0140 (size: 0x10)
    FString ActionDangerHovered;                                                      // 0x0150 (size: 0x10)
    FString ActionGet;                                                                // 0x0160 (size: 0x10)
    FString ActionGetHovered;                                                         // 0x0170 (size: 0x10)
    FString ActionGive;                                                               // 0x0180 (size: 0x10)
    FString ActionGiveHovered;                                                        // 0x0190 (size: 0x10)
    FString BackgroundDisabled;                                                       // 0x01A0 (size: 0x10)
    FString BackgroundDefault;                                                        // 0x01B0 (size: 0x10)
    FString BackgroundDefaultHovered;                                                 // 0x01C0 (size: 0x10)
    FString BackgroundDefaultRead;                                                    // 0x01D0 (size: 0x10)
    FString BackgroundDefaultHoveredRead;                                             // 0x01E0 (size: 0x10)
    FString BackgroundQuest;                                                          // 0x01F0 (size: 0x10)
    FString BackgroundQuestHovered;                                                   // 0x0200 (size: 0x10)
    FString BackgroundQuestRead;                                                      // 0x0210 (size: 0x10)
    FString BackgroundQuestHoveredRead;                                               // 0x0220 (size: 0x10)
    FString BackgroundDanger;                                                         // 0x0230 (size: 0x10)
    FString BackgroundDangerHovered;                                                  // 0x0240 (size: 0x10)
    FString BackgroundGet;                                                            // 0x0250 (size: 0x10)
    FString BackgroundGetHovered;                                                     // 0x0260 (size: 0x10)
    FString BackgroundGive;                                                           // 0x0270 (size: 0x10)
    FString BackgroundGiveHovered;                                                    // 0x0280 (size: 0x10)
    FString IconDisabled;                                                             // 0x0290 (size: 0x10)
    FString IconDefault;                                                              // 0x02A0 (size: 0x10)
    FString IconDefaultHovered;                                                       // 0x02B0 (size: 0x10)
    FString IconDefaultRead;                                                          // 0x02C0 (size: 0x10)
    FString IconDefaultHoveredRead;                                                   // 0x02D0 (size: 0x10)
    FString IconQuest;                                                                // 0x02E0 (size: 0x10)
    FString IconQuestHovered;                                                         // 0x02F0 (size: 0x10)
    FString IconQuestRead;                                                            // 0x0300 (size: 0x10)
    FString IconQuestHoveredRead;                                                     // 0x0310 (size: 0x10)
    FString IconDanger;                                                               // 0x0320 (size: 0x10)
    FString IconDangerHovered;                                                        // 0x0330 (size: 0x10)
    FString IconGet;                                                                  // 0x0340 (size: 0x10)
    FString IconGetHovered;                                                           // 0x0350 (size: 0x10)
    FString IconGive;                                                                 // 0x0360 (size: 0x10)
    FString IconGiveHovered;                                                          // 0x0370 (size: 0x10)

}; // Size: 0x380

struct FDialogFolderInfo
{
    FText FolderName;                                                                 // 0x0000 (size: 0x18)
    TArray<FDialogAnswerInfo> Answers;                                                // 0x0018 (size: 0x10)
    FUID MemberUID;                                                                   // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FDialogMemberData
{
    FString DialogMemberName;                                                         // 0x0000 (size: 0x10)
    bool bOptionalMember;                                                             // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FDialogUIInfo
{
}; // Size: 0x60

struct FDifficultyData
{
    class UTexture2D* DifficultyImage;                                                // 0x0000 (size: 0x8)
    class USetDifficulty* DifficultyButtonAction;                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDirectionBlendData
{
    float Forward;                                                                    // 0x0000 (size: 0x4)
    float Backward;                                                                   // 0x0004 (size: 0x4)
    float Left;                                                                       // 0x0008 (size: 0x4)
    float Right;                                                                      // 0x000C (size: 0x4)
    float ForwardLeft;                                                                // 0x0010 (size: 0x4)
    float ForwardRight;                                                               // 0x0014 (size: 0x4)
    float BackwardLeft;                                                               // 0x0018 (size: 0x4)
    float BackwardRight;                                                              // 0x001C (size: 0x4)
    float BlendInterpSpeed;                                                           // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FDirectionalAnimation
{
    float MinAngle;                                                                   // 0x0000 (size: 0x4)
    float MaxAngle;                                                                   // 0x0004 (size: 0x4)
    float AnimationAngle;                                                             // 0x0008 (size: 0x4)
    class UAnimMontage* Animation;                                                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FDirectionalLightState
{
    FLightState Light;                                                                // 0x0000 (size: 0x300)
    FLightShaftsState LightShafts;                                                    // 0x0300 (size: 0x60)

}; // Size: 0x360

struct FDisplaySettings
{
    FName TitleBackgroundStyleId;                                                     // 0x0000 (size: 0x8)
    FName TitleBorderLineStyleId;                                                     // 0x0008 (size: 0x8)
    FName InsideMarkerStyleId;                                                        // 0x0010 (size: 0x8)
    FName MarkerBackgroundStyleId;                                                    // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FDoorMovableData
{
    FName ComponentName;                                                              // 0x0000 (size: 0x8)
    float OpenAngularSpeed;                                                           // 0x0008 (size: 0x4)
    float OpenAngle;                                                                  // 0x000C (size: 0x4)
    float StealthOpenAngularSpeed;                                                    // 0x0010 (size: 0x4)
    float StealthOpenAngle;                                                           // 0x0014 (size: 0x4)
    class UStaticMeshComponent* DoorMeshComponent;                                    // 0x0018 (size: 0x8)
    float InitialAngle;                                                               // 0x0020 (size: 0x4)
    EDoorMoveDirection CurrentDirection;                                              // 0x0025 (size: 0x1)

}; // Size: 0x28

struct FDoubleLineSettings
{
    FString FindTag;                                                                  // 0x0000 (size: 0x10)
    FString CorrectTag;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FDragDeadBodyAnimations
{
    class UAnimMontage* PickUpBodyFaceUp;                                             // 0x0000 (size: 0x8)
    class UAnimMontage* DropBody;                                                     // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FDynamicEnvironmentParticleDataRow : public FTableRowBase
{
    EDynamicParticleType ParticleType;                                                // 0x0008 (size: 0x1)
    TSet<TSubclassOf<UNiagaraParameterProvider>> Providers;                           // 0x0010 (size: 0x50)
    bool bCanSpawnOnWater;                                                            // 0x0060 (size: 0x1)
    bool bStopOnCutscene;                                                             // 0x0061 (size: 0x1)
    FParticleIndoorSpawnPrototype IndoorSpawnPrototype;                               // 0x0068 (size: 0x30)
    FParticleBiomePrototype BiomeSpawnPrototype;                                      // 0x0098 (size: 0x38)
    FParticleDistancePrototype PlayerDistancePrototype;                               // 0x00D0 (size: 0x10)
    FParticleWindIntensityPrototype WindIntensityPrototype;                           // 0x00E0 (size: 0x10)
    TMap<class EWeather, class FParticleActorSpawnPrototype> ActorSpawnPrototypes;    // 0x00F0 (size: 0x50)
    TMap<class EWeather, class FParticlePlayerComponentSpawnPrototype> PlayerComponentSpawnPrototypes; // 0x0140 (size: 0x50)
    TMap<class EWeather, class FParticleActorComponentSpawnPrototype> ActorComponentSpawnPrototypes; // 0x0190 (size: 0x50)
    TArray<TSoftObjectPtr<UNiagaraSystem>> ActorParticleVFXes;                        // 0x01E0 (size: 0x10)
    TSoftObjectPtr<UNiagaraSystem> PlayerParticleVFX;                                 // 0x01F0 (size: 0x30)
    FLightningStrikeParticleVFXPrototype LightningStrikeVFX;                          // 0x0220 (size: 0xF8)
    FLightningStrikeDamagePrototype LightningStrikeDamagePrototype;                   // 0x0318 (size: 0x38)

}; // Size: 0x350

struct FDynamicObstacleAvoidanceAgentSettings
{
    float AgentAvoidanceRadiusMargin;                                                 // 0x0000 (size: 0x4)
    float MinMovementSpeed;                                                           // 0x0004 (size: 0x4)
    float AgentTimeOfImpactToConsiderWaiting;                                         // 0x0008 (size: 0x4)
    float SpeedRecoveryTimeout;                                                       // 0x000C (size: 0x4)
    float AgentPriorityTimeout;                                                       // 0x0010 (size: 0x4)
    float AgentRepathingTimeout;                                                      // 0x0014 (size: 0x4)
    float AgentFailMovementTimeout;                                                   // 0x0018 (size: 0x4)
    bool AllowPriorityAgent;                                                          // 0x001C (size: 0x1)
    bool bMergeObstacles;                                                             // 0x001D (size: 0x1)
    bool bCanFailMovement;                                                            // 0x001E (size: 0x1)

}; // Size: 0x20

struct FDynamicObstacleAvoidanceQuerrySettings
{
    float StartTrackingDistance;                                                      // 0x0000 (size: 0x4)
    float EndTrackingOffset;                                                          // 0x0004 (size: 0x4)
    float PreferredAvoidanceCorridorWidth;                                            // 0x0008 (size: 0x4)
    float MaxCorridorSectionLength;                                                   // 0x000C (size: 0x4)
    float ObstaclesQueryDistance;                                                     // 0x0010 (size: 0x4)
    float AgentMinAvoidanceSampleStep;                                                // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FDynamicObstacleAvoidanceSystemSettings
{
    bool bEnabled;                                                                    // 0x0000 (size: 0x1)
    int32 MaxUpdateAgentsPerTick;                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FEffectPrototypeSID
{
    FPrototypeSID EffectSID;                                                          // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FEffectValueOverridePair
{
}; // Size: 0xC

struct FElectroAnomalyBakedData
{
    int32 CirclePointsCount;                                                          // 0x0000 (size: 0x4)
    TArray<FVector> TraceStartPoints;                                                 // 0x0008 (size: 0x10)
    TArray<FVector> TraceEndPoints;                                                   // 0x0018 (size: 0x10)
    TArray<FVector> TraceUpVectors;                                                   // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FElectroAnomalyBakedDataFloat
{
    int32 CirclePointsCount;                                                          // 0x0000 (size: 0x4)
    TArray<FVector3f> TraceStartPoints;                                               // 0x0008 (size: 0x10)
    TArray<FVector3f> TraceEndPoints;                                                 // 0x0018 (size: 0x10)
    TArray<FVector3f> TraceUpVectors;                                                 // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FEncounterSpawnPointData
{
    FTransform SpawnTransform;                                                        // 0x0000 (size: 0x60)
    FObjPrototypeSID ObjPrototypeSID;                                                 // 0x0060 (size: 0x40)
    EPsyNPCType PsyNPCType;                                                           // 0x00A0 (size: 0x1)

}; // Size: 0xB0

struct FEnvironmentParticlePrototype
{
}; // Size: 0x8

struct FEquipUnequipAnimations
{
    class UAnimMontage* Equip;                                                        // 0x0000 (size: 0x8)
    class UAnimMontage* Unequip;                                                      // 0x0008 (size: 0x8)
    class UAnimMontage* FastUnequip;                                                  // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FEquipmentItemSlot
{
}; // Size: 0x18

struct FEquipmentNavigationPath
{
    double MinAngle;                                                                  // 0x0000 (size: 0x8)
    double MaxAngle;                                                                  // 0x0008 (size: 0x8)
    EInventoryEquipmentSlot TargetSlot;                                               // 0x0010 (size: 0x1)

}; // Size: 0x18

struct FEquipmentNavigationPaths
{
    TArray<FEquipmentNavigationPath> NavigationPaths;                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FEventData
{
    TSoftObjectPtr<UAkAudioEvent> AkEvent;                                            // 0x0000 (size: 0x30)
    FVector RelativeTransform;                                                        // 0x0030 (size: 0x18)

}; // Size: 0x48

struct FExplosionHitArgs
{
    FVector ExplosionLocation;                                                        // 0x0000 (size: 0x18)
    float ExplosionRadius;                                                            // 0x0018 (size: 0x4)
    class AActor* ExplosiveActor;                                                     // 0x0020 (size: 0x8)
    FString ExplosiveActorPrototypeID;                                                // 0x0028 (size: 0x10)
    FUID ExplosionInstigatorUID;                                                      // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FExponentialHeightFogState
{
    FFloatParameter FogDensity;                                                       // 0x0000 (size: 0x60)
    FFloatParameter FogHeightFalloff;                                                 // 0x0060 (size: 0x60)
    FFloatParameter SecondFogDensity;                                                 // 0x00C0 (size: 0x60)
    FFloatParameter SecondFogFalloff;                                                 // 0x0120 (size: 0x60)
    FFloatParameter SecondFogOffset;                                                  // 0x0180 (size: 0x60)
    FFloatParameter ScatteringDistribution;                                           // 0x01E0 (size: 0x60)
    FLinearColorParameter Albedo;                                                     // 0x0240 (size: 0x60)
    FLinearColorParameter Emissive;                                                   // 0x02A0 (size: 0x60)
    FFloatParameter ExtinctionScale;                                                  // 0x0300 (size: 0x60)
    FLinearColorParameter SkyAtmosphereAmbientContributionColorScale;                 // 0x0360 (size: 0x60)
    FLinearColorParameter DirectionalInscatteringColor;                               // 0x03C0 (size: 0x60)
    FFloatParameter DirectionalInscatteringExponent;                                  // 0x0420 (size: 0x60)

}; // Size: 0x480

struct FEyesLookAtData
{
    TMap<class ECutsceneBlinkProfile, class FCutsceneBlinkConfig> CutsceneBlinkConfigs; // 0x0000 (size: 0x50)
    class UAnimMontage* BlinkAnimation;                                               // 0x0050 (size: 0x8)
    float BlinkOnEyeMoveThreshold;                                                    // 0x0058 (size: 0x4)
    float BlinkOnEyeMoveInterval;                                                     // 0x005C (size: 0x4)
    float ControlRigEnableInterpSpeed;                                                // 0x0060 (size: 0x4)
    float ControlRigDisableInterpSpeed;                                               // 0x0064 (size: 0x4)
    float CutsceneProceduralEyesWeight;                                               // 0x0068 (size: 0x4)
    float CutsceneProceduralEyesAmplitude;                                            // 0x006C (size: 0x4)
    float CutsceneProceduralEyesIntensity;                                            // 0x0070 (size: 0x4)
    bool bShouldBeEnabled;                                                            // 0x0074 (size: 0x1)
    float ControlRigAlpha;                                                            // 0x0078 (size: 0x4)
    float CutsceneEyesLookAtWeight;                                                   // 0x007C (size: 0x4)
    FVector LookAtLocation;                                                           // 0x0080 (size: 0x18)
    class AActor* LookAtActor;                                                        // 0x0098 (size: 0x8)
    class USkeletalMeshComponent* LookAtSkeletalMesh;                                 // 0x00A0 (size: 0x8)
    ECutsceneBlinkProfile CutsceneBlinkProfile;                                       // 0x00A8 (size: 0x1)
    ECutsceneEyesIdleProfile CutsceneEyesIdleProfile;                                 // 0x00A9 (size: 0x1)
    float TimeToNextBlink;                                                            // 0x00AC (size: 0x4)
    float BlinkOnEyeMoveCooldown;                                                     // 0x00B0 (size: 0x4)
    float CutsceneHeadControlRigAlpha;                                                // 0x00B4 (size: 0x4)
    float CutsceneHeadLookAtWeight;                                                   // 0x00B8 (size: 0x4)
    bool bShouldOffOnEdges;                                                           // 0x00BC (size: 0x1)

}; // Size: 0xC0

struct FFactionOverridableProperty : public FOverridableProperty
{
    FFactionSelector DefaultValue;                                                    // 0x0018 (size: 0x60)
    FFactionSelector CurrentValue;                                                    // 0x0078 (size: 0x60)

}; // Size: 0xD8

struct FFactionRestrictions
{
    FFactionSelector Faction;                                                         // 0x0000 (size: 0x60)
    ESpaceRestrictionType RestrictionType;                                            // 0x0060 (size: 0x1)

}; // Size: 0x68

struct FFactionSelector
{
    FString Value;                                                                    // 0x0000 (size: 0x10)
    TSet<FString> AllowedFactionsFilter;                                              // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FFactionSelectorArray
{
    TArray<FFactionSelector> Factions;                                                // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FFeedbackSettings
{
}; // Size: 0x1

struct FFireTypeDisplayInfo
{
    FString DisplayTextSid;                                                           // 0x0000 (size: 0x10)
    class UTexture2D* DisplayTexture;                                                 // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FFireTypeSlotSettings
{
    class UTexture* BackgroundTexture;                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FFloatParameter : public FParameter
{
    class UCurveFloat* Curve;                                                         // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FFloatValueLocalisationPair
{
    float PercentValue;                                                               // 0x0000 (size: 0x4)
    FText Loc10N;                                                                     // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FFogParams
{
    float Density;                                                                    // 0x0000 (size: 0x4)
    FFloatInterval Height;                                                            // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FForceFeedbackArgs
{
}; // Size: 0x8

struct FForceFeedbackParams
{
    FName Tag;                                                                        // 0x0000 (size: 0x8)
    bool bLooping;                                                                    // 0x0008 (size: 0x1)
    bool bIgnoreTimeDilation;                                                         // 0x0009 (size: 0x1)
    bool bPlayWhilePaused;                                                            // 0x000A (size: 0x1)

}; // Size: 0xC

struct FFourLegIKData : public FBaseLegIKData
{
    FLegIKData FrontLeftFootIKData;                                                   // 0x0008 (size: 0x10)
    FLegIKData FrontRightFootIKData;                                                  // 0x0018 (size: 0x10)
    FLegIKData BackLeftFootIKData;                                                    // 0x0028 (size: 0x10)
    FLegIKData BackRightFootIKData;                                                   // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FGSCComponentReference
{
    TSoftObjectPtr<AActor> OtherActor;                                                // 0x0000 (size: 0x30)
    FName ComponentProperty;                                                          // 0x0030 (size: 0x8)
    FString PathToComponent;                                                          // 0x0038 (size: 0x10)

}; // Size: 0x50

struct FGSC_RelationColors : public FTableRowBase
{
    FName ColourStyleID;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGSC_WidgetProgressStyle : public FTableRowBase
{
    FProgressBarStyle ProgressBarStyle;                                               // 0x0010 (size: 0x2F0)

}; // Size: 0x300

struct FGSC_WidgetStyle : public FTableRowBase
{
    FLinearColor Colour;                                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FGUIDIndex
{
}; // Size: 0x4

struct FGameGraphContextualAction
{
    FGuid QuestGuid;                                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameGraphContextualActions
{
    TArray<FGameGraphContextualAction> ContextualActions;                             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameGraphSceneProxyDrawParams
{
    bool bEnableMinMaxPathColoring;                                                   // 0x0000 (size: 0x1)
    bool bEnableAgentSupportMaskColoring;                                             // 0x0001 (size: 0x1)
    bool bEnablePolyBindConnectivityColoring;                                         // 0x0002 (size: 0x1)
    bool bDebugContextualActions;                                                     // 0x0003 (size: 0x1)
    int32 PolyBindConnectivityNavDataIdx;                                             // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FGlobalVariable
{
}; // Size: 0x18

struct FGridInfo
{
    FName GridName;                                                                   // 0x0000 (size: 0x8)
    double OverrideStreamingDistance;                                                 // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FGroomCategory
{
}; // Size: 0x78

struct FGroomVariation
{
}; // Size: 0xE0

struct FGroupUID : public FUID
{
}; // Size: 0x4

struct FHeadFlashlightComponentCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FHintControllerSettings
{
    FName InputAction;                                                                // 0x0000 (size: 0x8)
    FName CustomInputIconName;                                                        // 0x0008 (size: 0x8)
    EMappingContext MappingContext;                                                   // 0x0010 (size: 0x4)
    FAdvancedControllerSettings GamepadAdvancedSettings;                              // 0x0014 (size: 0x8)
    FAdvancedControllerSettings KeyboardAdvancedSettings;                             // 0x001C (size: 0x8)

}; // Size: 0x24

struct FHintStyleSettings
{
    EHintDescriptionSettings DescriptionSettings;                                     // 0x0000 (size: 0x1)
    FName HintDescriptionFontStyleSID;                                                // 0x0004 (size: 0x8)
    FString HintDescriptionSID;                                                       // 0x0010 (size: 0x10)
    float HintAndDescriptionGap;                                                      // 0x0020 (size: 0x4)
    float HintHeight;                                                                 // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FHintViewSettings
{
    FName InputAction;                                                                // 0x0000 (size: 0x8)
    EMappingContext MappingContext;                                                   // 0x0008 (size: 0x4)
    int32 InputMappingIndex;                                                          // 0x000C (size: 0x4)
    EHintProgressType ProgressType;                                                   // 0x0010 (size: 0x1)
    float HintHeight;                                                                 // 0x0014 (size: 0x4)
    FName CustomInputAction;                                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FHintsData : public FTableRowBase
{
    TMap<class EGSCInputDeviceType, class FSlateBrush> PlatformIcons;                 // 0x0008 (size: 0x50)
    FLinearColor BackgroundColor;                                                     // 0x0058 (size: 0x10)
    bool bOverrideBackgroundBrush;                                                    // 0x0068 (size: 0x1)
    FSlateBrush BackgroundBrush;                                                      // 0x0070 (size: 0xF0)
    FMargin BackgroundPadding;                                                        // 0x0160 (size: 0x10)

}; // Size: 0x170

struct FHintsDataTable : public FTableRowBase
{
    bool bCheckPlatform;                                                              // 0x0008 (size: 0x1)
    TMap<class EGSCInputDeviceType, class FSlateBrush> PlatformIcons;                 // 0x0010 (size: 0x50)
    TMap<class EGSCInputDeviceType, class FHintsData> PlatformData;                   // 0x0060 (size: 0x50)

}; // Size: 0xB0

struct FHintsInputDataTable : public FTableRowBase
{
    FSlateBrush PlatformIcons;                                                        // 0x0010 (size: 0xF0)

}; // Size: 0x100

struct FHitBlocker
{
    FName JointName;                                                                  // 0x0000 (size: 0x8)
    int32 ElementIndex;                                                               // 0x0008 (size: 0x4)
    float MaxPiercing;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FHoldInteractionData : public FInteractionData
{
    float HoldTime;                                                                   // 0x0018 (size: 0x4)
    float DecreaseTime;                                                               // 0x001C (size: 0x4)
    bool bDoNotDecrease;                                                              // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FHoverAction
{
    EHintHoverActionType HoverAction;                                                 // 0x0000 (size: 0x1)
    class UUserWidget* ActionWidget;                                                  // 0x0008 (size: 0x8)
    FLinearColor HoverColorAndOpacity;                                                // 0x0010 (size: 0x10)
    FLinearColor UnHoverColorAndOpacity;                                              // 0x0020 (size: 0x10)
    ESlateVisibility HoverVisibility;                                                 // 0x0030 (size: 0x1)
    ESlateVisibility UnHoverVisibility;                                               // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FHumanAnimLocomotionData
{
    float Velocity;                                                                   // 0x0000 (size: 0x4)
    float AngleDirection;                                                             // 0x0004 (size: 0x4)
    float ClampedDirection;                                                           // 0x0008 (size: 0x4)
    uint8 BPDirection;                                                                // 0x000C (size: 0x1)
    EDirections Direction;                                                            // 0x000D (size: 0x1)
    FDirectionBlendData DirectionBlendParams;                                         // 0x0010 (size: 0x24)

}; // Size: 0x88

struct FHumanDeathAnimArray
{
    TArray<class UAnimMontage*> Animations;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FHumanDeathAnimations
{
    TMap<class EAnimHitBodyPart, class FHumanDeathDirectionalAnimMap> BulletDeathAnimations; // 0x0000 (size: 0x50)
    TMap<class EAnimDirections, class FHumanDeathAnimArray> ExplosionDeathAnimations; // 0x0050 (size: 0x50)
    TMap<class EHumanAnimDamageSource, class FHumanDeathAnimArray> DeathAnimations;   // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FHumanDeathDirectionalAnimMap
{
    TMap<class EAnimDirections, class FHumanDeathAnimArray> DirectionalAnimations;    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHumanExternalAnimations
{
    FHumanHitAnimations DefaultHits;                                                  // 0x0000 (size: 0x28)
    FHumanHitAnimations ShotgunHits;                                                  // 0x0028 (size: 0x28)
    FHumanKnockDownAnimations KnockdownAnimations;                                    // 0x0050 (size: 0x28)
    FHumanLookAtAnimations LookAt;                                                    // 0x0078 (size: 0x18)
    class UAnimSequence* IdleStand;                                                   // 0x0090 (size: 0x8)
    class UAnimSequence* IdleCrouch;                                                  // 0x0098 (size: 0x8)
    class UAnimSequence* IdleRelaxed;                                                 // 0x00A0 (size: 0x8)
    class UAnimSequence* IdleRelaxedAdditive;                                         // 0x00A8 (size: 0x8)
    class UAnimSequence* StandToCrouch;                                               // 0x00B0 (size: 0x8)
    class UAnimSequence* CrouchToStand;                                               // 0x00B8 (size: 0x8)
    class UAnimSequence* StandToRelax;                                                // 0x00C0 (size: 0x8)
    class UAnimSequence* RelaxToStand;                                                // 0x00C8 (size: 0x8)

}; // Size: 0xD0

struct FHumanFirearmInternalAnimations
{
    FCharacterWeaponAnimations ShootingInHip;                                         // 0x0000 (size: 0x20)
    TMap<class EAnimationStates, class FHumanStateReloadAnimations> Reloading;        // 0x0020 (size: 0x50)
    TMap<class EAnimationStates, class FHumanStateReloadAnimations> ReloadingInCover; // 0x0070 (size: 0x50)
    TArray<class UAnimMontage*> Melee;                                                // 0x00C0 (size: 0x10)

}; // Size: 0xD0

struct FHumanHitAnimations
{
    class UBlendSpace1D* Head;                                                        // 0x0000 (size: 0x8)
    class UBlendSpace1D* UpperBody;                                                   // 0x0008 (size: 0x8)
    class UBlendSpace1D* LowerBody;                                                   // 0x0010 (size: 0x8)
    class UBlendSpace1D* LeftLeg;                                                     // 0x0018 (size: 0x8)
    class UBlendSpace1D* RightLeg;                                                    // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FHumanHumanAttachAnimBlueprintsBySID
{
    UClass* AttachAnimBlueprint;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FHumanKnockDownAnimations
{
    class UAnimSequence* KnockDownInForward;                                          // 0x0000 (size: 0x8)
    class UAnimSequence* KnockDownInBackward;                                         // 0x0008 (size: 0x8)
    class UAnimSequence* KnockDownInLeft;                                             // 0x0010 (size: 0x8)
    class UAnimSequence* KnockDownInRight;                                            // 0x0018 (size: 0x8)
    class UAnimSequence* KnockDownOut;                                                // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FHumanLookAtAnimations
{
    class UBlendSpace* CoverStandBlindLeft;                                           // 0x0000 (size: 0x8)
    class UBlendSpace* CoverCrouchBlindLeft;                                          // 0x0008 (size: 0x8)
    class UBlendSpace* CoverCrouchBlindTop;                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FHumanStateReloadAnimations
{
    TMap<class FName, class FMagazineReloadAnimations> MagazineReload;                // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHumanTransitionAnimations
{
    class UAnimMontage* TransitionTo;                                                 // 0x0000 (size: 0x8)
    class UAnimMontage* TransitionFrom;                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FHumanWeaponAnimations
{
    class UHumanAnimCollection* AnimCollection;                                       // 0x0000 (size: 0x8)
    UClass* HumanAnimBlueprint;                                                       // 0x0008 (size: 0x8)
    TMap<class FString, class FHumanHumanAttachAnimBlueprintsBySID> AttachBlueprintbySID; // 0x0010 (size: 0x50)
    FCharacterWeaponAnimations EquipWeapon;                                           // 0x0060 (size: 0x20)
    FCharacterWeaponAnimations UnequipWeapon;                                         // 0x0080 (size: 0x20)
    FCharacterWeaponAnimations EquipWeaponFast;                                       // 0x00A0 (size: 0x20)
    FCharacterWeaponAnimations UnequipWeaponFast;                                     // 0x00C0 (size: 0x20)
    FCharacterWeaponAnimations EquipWeaponRelax;                                      // 0x00E0 (size: 0x20)
    FCharacterWeaponAnimations UnequipWeaponRelax;                                    // 0x0100 (size: 0x20)

}; // Size: 0x120

struct FHumanWeaponExternalAnimations
{
    class UAnimSequence* IdleCommon;                                                  // 0x0000 (size: 0x8)
    class UAnimSequence* IdleCrouchCommon;                                            // 0x0008 (size: 0x8)
    class UAnimSequence* Idle;                                                        // 0x0010 (size: 0x8)
    class UAnimSequence* IdleRelaxed;                                                 // 0x0018 (size: 0x8)
    class UAnimSequence* IdleAdd;                                                     // 0x0020 (size: 0x8)
    class UAnimSequence* IdleRelaxedAdd;                                              // 0x0028 (size: 0x8)
    class UAnimSequence* LowCoverIdleAdditive;                                        // 0x0030 (size: 0x8)
    class UAnimSequence* HighCoverIdleAdditive;                                       // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FIconSettings
{
    StyleManagerActionType StyleAction;                                               // 0x0000 (size: 0x1)
    bool bIconCheckPlatform;                                                          // 0x0001 (size: 0x1)
    FSlateBrush Brush;                                                                // 0x0010 (size: 0xF0)
    bool bEnableResize;                                                               // 0x0100 (size: 0x1)
    FVector2D IconSize;                                                               // 0x0108 (size: 0x10)

}; // Size: 0x120

struct FInfoScreenSettings
{
    FText TitleText;                                                                  // 0x0000 (size: 0x18)
    FText DescriptionText;                                                            // 0x0018 (size: 0x18)
    FSoftObjectPath Image;                                                            // 0x0030 (size: 0x20)

}; // Size: 0x50

struct FInitialCollectionSize
{
    int32 AgentView;                                                                  // 0x0000 (size: 0x4)
    int32 AgentModel;                                                                 // 0x0004 (size: 0x4)
    int32 AnomalyView;                                                                // 0x0008 (size: 0x4)
    int32 AnomalyModel;                                                               // 0x000C (size: 0x4)
    int32 ArtifactView;                                                               // 0x0010 (size: 0x4)
    int32 ProjectileView;                                                             // 0x0014 (size: 0x4)
    int32 AIComponent;                                                                // 0x0018 (size: 0x4)
    int32 AkComponent;                                                                // 0x001C (size: 0x4)
    int32 AkLateReverbComponent;                                                      // 0x0020 (size: 0x4)
    int32 AkRoomComponent;                                                            // 0x0024 (size: 0x4)
    int32 AkSurfaceReflectorSetComponent;                                             // 0x0028 (size: 0x4)
    int32 ItemContainer;                                                              // 0x002C (size: 0x4)
    int32 DestructibleView;                                                           // 0x0030 (size: 0x4)
    int32 DestructibleModel;                                                          // 0x0034 (size: 0x4)
    int32 WetnessComponent;                                                           // 0x0038 (size: 0x4)
    int32 FlashlightComponent;                                                        // 0x003C (size: 0x4)
    int32 ContextualActionModel;                                                      // 0x0040 (size: 0x4)
    int32 QuestNode;                                                                  // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FInjectorAnimations
{
    class UAnimMontage* PlayerHealAnimation;                                          // 0x0000 (size: 0x8)
    class UAnimMontage* HumanHealAnimation;                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FInputBufferIPUStruct
{
}; // Size: 0x70

struct FInputMappingSettingsElementModels
{
    bool IsAnchor;                                                                    // 0x0000 (size: 0x1)
    FString AnchorLocalization;                                                       // 0x0008 (size: 0x10)
    bool SaveAnchor;                                                                  // 0x0018 (size: 0x1)
    class UInputAction* Action;                                                       // 0x0020 (size: 0x8)
    EMappingContext MappingContext;                                                   // 0x0028 (size: 0x4)
    bool IsMappable;                                                                  // 0x002C (size: 0x1)
    FName PlayerMappableOption;                                                       // 0x0030 (size: 0x8)
    FName AlternativePlayerMappableOption;                                            // 0x0038 (size: 0x8)
    bool IsActive;                                                                    // 0x0040 (size: 0x1)
    bool bHaveBindedActions;                                                          // 0x0041 (size: 0x1)
    FName BindedPlayerMappableOption;                                                 // 0x0044 (size: 0x8)
    FName BindedAltPlayerMappableOption;                                              // 0x004C (size: 0x8)
    FText DisplayCategory;                                                            // 0x0058 (size: 0x18)
    FString NameLocSID;                                                               // 0x0070 (size: 0x10)
    FString DescriptionLocSID;                                                        // 0x0080 (size: 0x10)

}; // Size: 0x90

struct FInputStoryDataEntry
{
}; // Size: 0x18

struct FInspectArtifactAnimations
{
    class UAnimMontage* InspectArtifact;                                              // 0x0000 (size: 0x8)
    class UAnimMontage* InspectArtifactWithBackpack;                                  // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FIntInterval
{
    int32 Min;                                                                        // 0x0000 (size: 0x4)
    int32 Max;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FInteractEffectData
{
    FPrototypeSID PrototypeSID;                                                       // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FInteractObject
{
    FPrototypeSID PrototypeSID;                                                       // 0x0000 (size: 0x40)
    int32 Count;                                                                      // 0x0040 (size: 0x4)
    bool bConsumedOnUse;                                                              // 0x0044 (size: 0x1)

}; // Size: 0x48

struct FInteractObjectData
{
    FPrototypeSID PrototypeSID;                                                       // 0x0000 (size: 0x40)
    int32 Count;                                                                      // 0x0040 (size: 0x4)
    float MinDurability;                                                              // 0x0044 (size: 0x4)
    float MaxDurability;                                                              // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FInteractableAnimations
{
    class UAnimMontage* Item;                                                         // 0x0000 (size: 0x8)
    class UAnimMontage* Character;                                                    // 0x0008 (size: 0x8)
    class UAnimMontage* CharacterWithDetector;                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FInteractableDisplayInfo
{
    FText TitleText;                                                                  // 0x0000 (size: 0x18)
    FText InteractActionText;                                                         // 0x0018 (size: 0x18)
    FText InteractActionTextSmall;                                                    // 0x0030 (size: 0x18)
    EInteractionType InteractionType;                                                 // 0x0048 (size: 0x1)
    EDisplayPriority DisplayPriority;                                                 // 0x0049 (size: 0x1)
    bool bOverweight;                                                                 // 0x004A (size: 0x1)
    bool bShowDurability;                                                             // 0x004B (size: 0x1)
    bool bShowUpgrade;                                                                // 0x004C (size: 0x1)

}; // Size: 0x50

struct FInteractionData
{
    FString InteractableTextToolAction;                                               // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FInteractionHitInfo
{
    class AActor* HitActor;                                                           // 0x0000 (size: 0x8)
    class UPrimitiveComponent* HitComponent;                                          // 0x0008 (size: 0x8)
    TArray<TWeakObjectPtr<UInteractionComponent>> Interactions;                       // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FItemContainerData : public FActorInteractionData
{
    bool bShowDurability;                                                             // 0x0018 (size: 0x1)
    bool bShowUpgrade;                                                                // 0x0019 (size: 0x1)

}; // Size: 0x20

struct FItemContainerModelCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FItemContainerUID : public FUID
{
}; // Size: 0x4

struct FItemLock
{
    int32 ItemCount;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FItemUID : public FUID
{
}; // Size: 0x4

struct FJournalQuest
{
}; // Size: 0x70

struct FJournalQuestStageData
{
}; // Size: 0xC

struct FLegIKData
{
    FName FootName;                                                                   // 0x0000 (size: 0x8)
    FName FootSocketName;                                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FLightShaftsState
{
    FLinearColorParameter BloomTint;                                                  // 0x0000 (size: 0x60)

}; // Size: 0x60

struct FLightState
{
    FFloatParameter Intensity;                                                        // 0x0000 (size: 0x60)
    FLinearColorParameter LightColor;                                                 // 0x0060 (size: 0x60)
    FFloatParameter Temperature;                                                      // 0x00C0 (size: 0x60)
    FFloatParameter ShadowAmount;                                                     // 0x0120 (size: 0x60)
    FFloatParameter MoonOpacity;                                                      // 0x0180 (size: 0x60)
    FLinearColorParameter CloudScatteredLuminanceScale;                               // 0x01E0 (size: 0x60)
    FLinearColorParameter SunDiskColorScale;                                          // 0x0240 (size: 0x60)
    FFloatParameter VolumetricScatteringIntensity;                                    // 0x02A0 (size: 0x60)

}; // Size: 0x300

struct FLightningBallNavigationData
{
    bool bIsPatrolPoint;                                                              // 0x0000 (size: 0x1)
    FVector PointLocation;                                                            // 0x0008 (size: 0x18)
    TArray<int32> NeighborPoints;                                                     // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FLightningStrikeDamagePrototype : public FEnvironmentParticlePrototype
{
    float PlayerHitProbability;                                                       // 0x0008 (size: 0x4)
    float PlayerHitCheckTime;                                                         // 0x000C (size: 0x4)
    float HeightPriorityRadius;                                                       // 0x0010 (size: 0x4)
    float HeightPriorityUsageProbability;                                             // 0x0014 (size: 0x4)
    TArray<FEffectPrototypeSID> PlayerHitEffects;                                     // 0x0018 (size: 0x10)
    TArray<FEffectPrototypeSID> NPCHitEffects;                                        // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FLightningStrikeParticleVFXPrototype : public FEnvironmentParticlePrototype
{
    TSoftObjectPtr<UNiagaraSystem> LightningStrikeDefault;                            // 0x0008 (size: 0x30)
    FLightningStrikeVFXMaterialPrototype LightningStrikeMetal;                        // 0x0038 (size: 0x40)
    FLightningStrikeVFXMaterialPrototype LightningStrikeWater;                        // 0x0078 (size: 0x40)
    FLightningStrikeVFXMaterialPrototype LightningStrikeWood;                         // 0x00B8 (size: 0x40)

}; // Size: 0xF8

struct FLightningStrikeVFXMaterialPrototype
{
    TSoftObjectPtr<UNiagaraSystem> NiagaraSystem;                                     // 0x0000 (size: 0x30)
    TArray<EPhysicalMaterialType> PhysicalMaterialTypes;                              // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FLinearColorParameter : public FParameter
{
    class UCurveLinearColor* Curve;                                                   // 0x0058 (size: 0x8)

}; // Size: 0x60

struct FLoadingScreenBehaviourSettings
{
    float MinimumLoadingScreenDisplayTime;                                            // 0x0000 (size: 0x4)
    bool bAutoCompleteWhenLoadingComplete;                                            // 0x0004 (size: 0x1)
    bool bWaitForManualStop;                                                          // 0x0005 (size: 0x1)

}; // Size: 0x8

struct FLockStruct
{
    TArray<FItemLock> LockedByItems;                                                  // 0x0000 (size: 0x10)
    TMap<class FString, class FGlobalVariable> LockedByGlobalVariables;               // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FLookAtAngleParams
{
    bool bAllowEyeRotate;                                                             // 0x0000 (size: 0x1)
    FRotator MaxAngleOfEyeRotate;                                                     // 0x0008 (size: 0x18)
    bool bAllowHeadRotate;                                                            // 0x0020 (size: 0x1)
    FRotator MaxAngleOfHeadRotate;                                                    // 0x0028 (size: 0x18)
    bool bAllowBodyRotate;                                                            // 0x0040 (size: 0x1)
    FRotator MaxAngleOfBodyRotate;                                                    // 0x0048 (size: 0x18)

}; // Size: 0x60

struct FLookAtMutantData
{
    double AimingYaw;                                                                 // 0x0000 (size: 0x8)
    double AimingPitch;                                                               // 0x0008 (size: 0x8)
    float MaxRotationAngleYaw;                                                        // 0x0010 (size: 0x4)
    float MaxRotationAnglePitch;                                                      // 0x0014 (size: 0x4)
    float RotationSpeed;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FMagazineReloadAnimations
{
    TMap<class EAnimationReloadTypes, class FCharacterWeaponAnimations> MagazineReloadAnimations; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FManagerTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FMapTypeSettings
{
    bool bIsMapType;                                                                  // 0x0000 (size: 0x1)
    FZoomInterval ZoomInterval;                                                       // 0x0004 (size: 0x8)
    FZoomInterval TrackedZoomInterval;                                                // 0x000C (size: 0x8)
    int32 ZOrder;                                                                     // 0x0014 (size: 0x4)
    bool bSupportHubFolding;                                                          // 0x0018 (size: 0x1)

}; // Size: 0x1C

struct FMarkerIconData : public FTableRowBase
{
    TMap<class EMarkerState, class FMarkerStateIconsData> MarkerStateIcons;           // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FMarkerIconPair
{
    class UTexture2D* Active;                                                         // 0x0000 (size: 0x8)
    class UTexture2D* Innactive;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMarkerIconSettings
{
    class UTexture2D* Texture;                                                        // 0x0000 (size: 0x8)
    class UTexture2D* TextureTracked;                                                 // 0x0008 (size: 0x8)
    double RelativeScale;                                                             // 0x0010 (size: 0x8)
    FName ColorSID;                                                                   // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FMarkerStateIconsData
{
    FName ColorStyle;                                                                 // 0x0000 (size: 0x8)
    FMarkerIconPair Compass;                                                          // 0x0008 (size: 0x10)
    FMarkerIconPair Map;                                                              // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FMarkerTypeSettings
{
    FMarkerIconSettings IconSettings;                                                 // 0x0000 (size: 0x20)
    bool bTrackable;                                                                  // 0x0020 (size: 0x1)
    bool bHaveDiscoveredState;                                                        // 0x0021 (size: 0x1)
    FCompassTypeSettings CompassTypeSettings;                                         // 0x0024 (size: 0x8)
    FMapTypeSettings MapTypeSettings;                                                 // 0x002C (size: 0x1C)

}; // Size: 0x48

struct FMaterialScalarDrivingProperties
{
    class UMaterialParameterCollection* MaterialCollectionToUpdate;                   // 0x0000 (size: 0x8)
    FName ParameterName;                                                              // 0x0008 (size: 0x8)
    float InterpolationTime;                                                          // 0x0010 (size: 0x4)
    float TargetValue;                                                                // 0x0014 (size: 0x4)

}; // Size: 0x28

struct FMeleeHitArgs
{
}; // Size: 0x1

struct FMenuButtonData
{
    TSoftClassPtr<UMenuButtonBase> ButtonStyleClass;                                  // 0x0000 (size: 0x30)
    FString ButtonNameSID;                                                            // 0x0030 (size: 0x10)
    class UMenuButtonActionBase* ButtonAction;                                        // 0x0040 (size: 0x8)
    TArray<FShortcutData> ButtonShortcuts;                                            // 0x0048 (size: 0x10)
    TArray<class UMenuButtonStateDefiner*> ButtonDefiners;                            // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FMenuHintSettings
{
    EMappingContext MappingContext;                                                   // 0x0000 (size: 0x4)
    int32 KeyboardAndMouseMappingIndex;                                               // 0x0004 (size: 0x4)
    int32 GamepadMappingIndex;                                                        // 0x0008 (size: 0x4)
    int32 TriggerIndex;                                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FMeshCategory
{
    FName MeshCategory;                                                               // 0x0000 (size: 0x8)
    TArray<FMeshesData> MeshesData;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FMeshSoundPlacerDataRow : public FTableRowBase
{
    float RaycastSphereRadius;                                                        // 0x0008 (size: 0x4)
    float RubberBandDistanceAtWalk;                                                   // 0x000C (size: 0x4)
    float RubberBandDistanceAtRun;                                                    // 0x0010 (size: 0x4)
    float RubberBandDistanceAtSprint;                                                 // 0x0014 (size: 0x4)
    float RubberBandSpeed;                                                            // 0x0018 (size: 0x4)
    TSoftObjectPtr<UAkAudioEvent> StopAkEvent;                                        // 0x0020 (size: 0x30)
    TArray<FMeshCategory> MeshCategories;                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FMeshesData
{
    TSoftObjectPtr<UStaticMesh> StaticMesh;                                           // 0x0000 (size: 0x30)
    TArray<FEventData> EventsData;                                                    // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FModelSpawnerParams
{
}; // Size: 0x10

struct FModifyVFXValue
{
    FName AttachmentName;                                                             // 0x0000 (size: 0x8)
    FName ValueToBeModified;                                                          // 0x0008 (size: 0x8)
    float ValueModifierPerSec;                                                        // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FModioLegendData
{
    class UModioLegendModel* BrowseShortcutsModel;                                    // 0x0000 (size: 0x8)
    class UModioLegendModel* DetailsShortcutsModel;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FMontageSection
{
    FString Value;                                                                    // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMoveSettings
{
    float SpeedMapZoom;                                                               // 0x0000 (size: 0x4)
    float Speed;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FMovementParams
{
    float WalkSpeed;                                                                  // 0x0000 (size: 0x4)
    float RunSpeed;                                                                   // 0x0004 (size: 0x4)
    float CrouchSpeed;                                                                // 0x0008 (size: 0x4)
    float LowCrouchSpeed;                                                             // 0x000C (size: 0x4)
    float SprintSpeed;                                                                // 0x0010 (size: 0x4)
    float ClimbSpeedCoef;                                                             // 0x0014 (size: 0x4)
    float JumpSpeedCoef;                                                              // 0x0018 (size: 0x4)
    float LimpSpeedCoef;                                                              // 0x001C (size: 0x4)
    float WalkDiagonalBackCoef;                                                       // 0x0020 (size: 0x4)
    float RunDiagonalBackCoef;                                                        // 0x0024 (size: 0x4)
    float WalkBackCoef;                                                               // 0x0028 (size: 0x4)
    float RunBackCoef;                                                                // 0x002C (size: 0x4)
    float MoveBackCrouchCoef;                                                         // 0x0030 (size: 0x4)
    float MoveBackLowCrouchCoef;                                                      // 0x0034 (size: 0x4)
    float AirControlCoef;                                                             // 0x0038 (size: 0x4)
    float WalkTransitionCoef;                                                         // 0x003C (size: 0x4)
    float BaseTurnRate;                                                               // 0x0040 (size: 0x4)
    float BaseLookUpRate;                                                             // 0x0044 (size: 0x4)
    float MaxSlowdownValue;                                                           // 0x0048 (size: 0x4)
    float StaggerAngle;                                                               // 0x004C (size: 0x4)
    bool bCanDash;                                                                    // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FMovementPlayRateStructure
{
    float ForwardValue;                                                               // 0x0000 (size: 0x4)
    float RightValue;                                                                 // 0x0004 (size: 0x4)
    float PlayRate;                                                                   // 0x0008 (size: 0x4)
    float LastForwardValue;                                                           // 0x000C (size: 0x4)
    float LastRightValue;                                                             // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FMovementRotationStructure
{
    float TurnTime;                                                                   // 0x0000 (size: 0x4)
    float TurnAngle;                                                                  // 0x0004 (size: 0x4)
    bool bEnableTurnInterp;                                                           // 0x0008 (size: 0x1)
    float TurnInterpSpeed;                                                            // 0x000C (size: 0x4)
    float TurnInterpThreshold;                                                        // 0x0010 (size: 0x4)

}; // Size: 0x28

struct FMultiClickInteractionData : public FInteractionData
{
    float ClickPercentageIncrease;                                                    // 0x0018 (size: 0x4)
    float PercentageDecrease;                                                         // 0x001C (size: 0x4)
    bool bDoNotDecrease;                                                              // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FNameDisplaySettings
{
    FMargin Margin;                                                                   // 0x0000 (size: 0x10)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0010 (size: 0x1)
    TEnumAsByte<EVerticalAlignment> VerticalAlignment;                                // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FNamesWidgetDisplaySettings
{
    FMargin Margin;                                                                   // 0x0000 (size: 0x10)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0010 (size: 0x1)
    TEnumAsByte<EVerticalAlignment> VerticalAlignment;                                // 0x0011 (size: 0x1)
    FSlateChildSize SlateChildSize;                                                   // 0x0014 (size: 0x8)

}; // Size: 0x1C

struct FNavModifierBodyConfig
{
    FName PhysicalBodyName;                                                           // 0x0000 (size: 0x8)
    TArray<int32> ShapeIndexesToProcess;                                              // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FNavModifierHolder
{
}; // Size: 0x30

struct FNiagaraValueCopyFromTo
{
    FName AttachmentName;                                                             // 0x0000 (size: 0x8)
    FName CopyFrom;                                                                   // 0x0008 (size: 0x8)
    FName CopyTo;                                                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FNoteFilterSettings
{
    bool bIsEnableFilter;                                                             // 0x0000 (size: 0x1)
    ENoteType Filter;                                                                 // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FNotificationModel
{
    FText Title;                                                                      // 0x0000 (size: 0x18)
    FText Description;                                                                // 0x0018 (size: 0x18)
    int32 Count;                                                                      // 0x0030 (size: 0x4)
    EHintType HintType;                                                               // 0x0034 (size: 0x1)
    bool bItemsRemoved;                                                               // 0x0035 (size: 0x1)
    EInteractionSystemNotificationsType Type;                                         // 0x0036 (size: 0x1)
    FVector Location;                                                                 // 0x0038 (size: 0x18)
    FString AudiologChainPrototypeID;                                                 // 0x0050 (size: 0x10)
    float AudiologDuration;                                                           // 0x0060 (size: 0x4)

}; // Size: 0x78

struct FObjPrototypeSID
{
    FPrototypeSID ObjSID;                                                             // 0x0000 (size: 0x40)

}; // Size: 0x40

struct FObjectPhaseSettings
{
}; // Size: 0x28

struct FOverlapVolumeEffect
{
    FPrototypeSID EffectPrototype;                                                    // 0x0008 (size: 0x40)
    uint8 AddOnBeginOverlap;                                                          // 0x0048 (size: 0x1)
    uint8 RemoveOnEndOverlap;                                                         // 0x0048 (size: 0x1)
    uint8 IgnorePlayer;                                                               // 0x0048 (size: 0x1)
    uint8 IgnoreAI;                                                                   // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FOverridableProperty
{
}; // Size: 0x18

struct FPDAUsageAnimations
{
    class UAnimSequenceBase* EquipPDA;                                                // 0x0000 (size: 0x8)
    class UAnimSequenceBase* InteractWithPDA;                                         // 0x0008 (size: 0x8)
    class UAnimSequenceBase* UnequipPDA;                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FParameter
{
    TMap<class EWeather, class FParameterTransition> TransitionOverrides;             // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FParameterTransition
{
    float StartOffset;                                                                // 0x0000 (size: 0x4)
    float Duration;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FParticleActorComponentSpawnPrototype : public FEnvironmentParticlePrototype
{
    FParticleActorSpawnPrototype ActorSpawnPrototype;                                 // 0x0008 (size: 0x30)
    FParticlePlayerComponentSpawnPrototype PlayerComponentSpawnPrototype;             // 0x0038 (size: 0x30)

}; // Size: 0x68

struct FParticleActorSpawnPrototype : public FEnvironmentParticlePrototype
{
    float BaseSpawnProbability;                                                       // 0x0008 (size: 0x4)
    float SpawnProbabilityIncrement;                                                  // 0x000C (size: 0x4)
    float SpawnProbabilityCheckTime;                                                  // 0x0010 (size: 0x4)
    float MinSpawnDistance;                                                           // 0x0014 (size: 0x4)
    float MaxSpawnDistance;                                                           // 0x0018 (size: 0x4)
    float SurfaceHeightOffset;                                                        // 0x001C (size: 0x4)
    float LocationCheckTime;                                                          // 0x0020 (size: 0x4)
    int32 MaxParticleCount;                                                           // 0x0024 (size: 0x4)
    bool bSpawnInPlayerViewport;                                                      // 0x0028 (size: 0x1)

}; // Size: 0x30

struct FParticleBiomePrototype : public FParticleConditionPrototype
{
    TArray<FString> AllowedBiomeNames;                                                // 0x0008 (size: 0x10)
    TArray<FString> CountableBiomeNames;                                              // 0x0018 (size: 0x10)
    float BiomeCheckRadius;                                                           // 0x0028 (size: 0x4)
    float MinBiomeCompatabilityPercent;                                               // 0x002C (size: 0x4)

}; // Size: 0x38

struct FParticleConditionPrototype : public FEnvironmentParticlePrototype
{
}; // Size: 0x8

struct FParticleDaytimePrototype : public FParticleConditionPrototype
{
    float SpawnTime;                                                                  // 0x0008 (size: 0x4)
    float DespawnTime;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FParticleDistancePrototype : public FParticleConditionPrototype
{
    float MaxDistance;                                                                // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FParticleExplosionPrototype : public FEnvironmentParticlePrototype
{
    float ExplosionDistance;                                                          // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FParticleGunshotPrototype : public FEnvironmentParticlePrototype
{
    float GunshotDistance;                                                            // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FParticleIndoorSpawnPrototype : public FEnvironmentParticlePrototype
{
    TArray<EAudioRoomPresetBase> IgnoredAudioRoomPresets;                             // 0x0008 (size: 0x10)
    TArray<EAudioRoomPresetBandwidth> ForbiddenBandwidthTypes;                        // 0x0018 (size: 0x10)
    float MinDistanceToAudioVolume;                                                   // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FParticleLairPrototype : public FParticleConditionPrototype
{
    float LairCheckDistance;                                                          // 0x0008 (size: 0x4)
    TArray<EAgentType> AllowedNPCTypes;                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FParticlePlayerComponentSpawnPrototype : public FEnvironmentParticlePrototype
{
    float BaseSpawnProbability;                                                       // 0x0008 (size: 0x4)
    float SpawnProbabilityIncrement;                                                  // 0x000C (size: 0x4)
    float SpawnProbabilityCheckTime;                                                  // 0x0010 (size: 0x4)
    float LocationCheckTime;                                                          // 0x0014 (size: 0x4)
    FVector PlayerHeadOffset;                                                         // 0x0018 (size: 0x18)

}; // Size: 0x30

struct FParticleRainIntensityPrototype : public FParticleConditionPrototype
{
    FFloatInterval AllowedRainIntensityInterval;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FParticleWeatherPrototype : public FParticleConditionPrototype
{
    TArray<EWeather> AllowedWeatherTypes;                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FParticleWindIntensityPrototype : public FParticleConditionPrototype
{
    FFloatInterval AllowedWindIntensityInterval;                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPhysicalManagerCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x78

struct FPhysicsHitArgs
{
    class AActor* StimulusActor;                                                      // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPhysicsObjectCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FPlayAnimationOnAttachedItemData
{
    FName AttachmentName;                                                             // 0x0000 (size: 0x8)
    class UAnimationAsset* AnimationAsset;                                            // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FPlayerAutoCoverAnimations
{
    class UAnimSequence* StandInCoverPose;                                            // 0x0000 (size: 0x8)
    class UAnimSequence* ApproachCover;                                               // 0x0008 (size: 0x8)
    class UAnimSequence* ApproachCoverLeft;                                           // 0x0010 (size: 0x8)
    class UAnimSequence* ApproachCoverRight;                                          // 0x0018 (size: 0x8)
    class UAnimSequence* ExitCover;                                                   // 0x0020 (size: 0x8)
    class UAnimSequence* CanLeanLeftPose;                                             // 0x0028 (size: 0x8)
    class UAnimSequence* CanLeanRightPose;                                            // 0x0030 (size: 0x8)
    class UAnimSequence* AimLeftPose;                                                 // 0x0038 (size: 0x8)
    class UAnimSequence* AimRightPose;                                                // 0x0040 (size: 0x8)
    class UBlendSpace* AimLeftPoseBlendSpace;                                         // 0x0048 (size: 0x8)
    class UBlendSpace* AimRightPoseBlendSpace;                                        // 0x0050 (size: 0x8)
    class UAnimSequence* AimUpPose;                                                   // 0x0058 (size: 0x8)
    class UAnimSequence* AimlessShootLeftPose;                                        // 0x0060 (size: 0x8)
    class UAnimSequence* AimlessShootRightPose;                                       // 0x0068 (size: 0x8)
    class UAnimSequence* AimlessShootUpPose;                                          // 0x0070 (size: 0x8)

}; // Size: 0x78

struct FPlayerDeathAnimArray
{
    TArray<class UAnimMontage*> Animations;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPlayerDeathAnimations
{
    TMap<class EAnimDirections, class FPlayerDeathAnimArray> BulletDeathAnimations;   // 0x0000 (size: 0x50)
    TMap<class EAnimDirections, class FPlayerDeathAnimArray> ExplosionDeathAnimations; // 0x0050 (size: 0x50)
    TMap<class EPlayerAnimDamageSource, class FPlayerDeathAnimArray> DeathAnimations; // 0x00A0 (size: 0x50)

}; // Size: 0xF0

struct FPlayerDialogAnimations
{
    TMap<class EDialogAnimationType, class UAnimSequenceBase*> DialogAnimations;      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FPlayerExternalAnimations
{
    FPlayerLocomotionAnimations UpperBody;                                            // 0x0000 (size: 0x128)
    FPlayerLocomotionAnimations LowerBody;                                            // 0x0128 (size: 0x128)
    class UAnimSequence* LookVertical;                                                // 0x0250 (size: 0x8)
    FPlayerLeansAnimations Leans;                                                     // 0x0258 (size: 0x20)

}; // Size: 0x278

struct FPlayerFirearmInternalAnimations
{
    FCharacterWeaponAnimations ShootingInHip;                                         // 0x0000 (size: 0x20)
    FCharacterWeaponAnimations ShootingInAim;                                         // 0x0020 (size: 0x20)
    TMap<class EAnimationShootingTypes, class FCharacterWeaponAnimations> Shooting;   // 0x0040 (size: 0x50)
    TMap<class FName, class FCharacterWeaponAnimations> ShootingWithScope;            // 0x0090 (size: 0x50)
    TMap<class FString, class FAttachDetachAnimations> AttachingBySID;                // 0x00E0 (size: 0x50)
    TArray<FCharacterWeaponAnimations> Jamming;                                       // 0x0130 (size: 0x10)
    TMap<class FName, class FCharacterWeaponAnimations> UniqueAttachJamming;          // 0x0140 (size: 0x50)
    TMap<class FName, class FMagazineReloadAnimations> Reloading;                     // 0x0190 (size: 0x50)
    TMap<class FName, class FMagazineReloadAnimations> OneHandReloading;              // 0x01E0 (size: 0x50)
    FCharacterWeaponAnimations MeleeAnimation;                                        // 0x0230 (size: 0x20)
    TMap<class EAnimSwitchFireTypeMode, class FChangeFireTypeAnimations> SwitchFireType; // 0x0250 (size: 0x50)
    class UAnimMontage* PickUpItem;                                                   // 0x02A0 (size: 0x8)
    class UAnimSequence* CharacterHipIdleSequence;                                    // 0x02A8 (size: 0x8)
    class UAnimSequence* WeaponHipIdleSequence;                                       // 0x02B0 (size: 0x8)

}; // Size: 0x2B8

struct FPlayerGuitarAnimations
{
    class UAnimMontage* ChordTransition;                                              // 0x0000 (size: 0x8)
    class UAnimSequence* GuitarItemEnterAnimation;                                    // 0x0008 (size: 0x8)
    class UAnimSequence* GuitarItemExitAnimation;                                     // 0x0010 (size: 0x8)
    TMap<class EAnimGuitarState, class UAkAudioEvent*> StrumUpSounds;                 // 0x0018 (size: 0x50)
    TMap<class EAnimGuitarState, class UAkAudioEvent*> StrumDownSounds;               // 0x0068 (size: 0x50)
    TMap<class EAnimGuitarState, class UAkAudioEvent*> GlissSounds;                   // 0x00B8 (size: 0x50)

}; // Size: 0x108

struct FPlayerInternalAnimations
{
    class UAnimMontage* PickingUpItem;                                                // 0x0000 (size: 0x8)
    class UAnimMontage* JumpLand;                                                     // 0x0008 (size: 0x8)
    class UAnimMontage* JumpLandLowCrouch;                                            // 0x0010 (size: 0x8)
    class UAnimMontage* FailedLanding;                                                // 0x0018 (size: 0x8)
    class UAnimMontage* ToggleFlashlightStand;                                        // 0x0020 (size: 0x8)
    class UAnimMontage* ToggleFlashlightLowCrouch;                                    // 0x0028 (size: 0x8)
    class UCurveFloat* EnterRagdollCurve;                                             // 0x0030 (size: 0x8)
    FEquipUnequipAnimations EquipUnequip;                                             // 0x0038 (size: 0x18)
    FEquipUnequipAnimations RemoveReturnLeftHand;                                     // 0x0050 (size: 0x18)
    TMap<class EAgentType, class UAnimMontage*> DragWeaponByNPC;                      // 0x0068 (size: 0x50)

}; // Size: 0xB8

struct FPlayerKnifeInternalAnimations
{
    FCharacterWeaponAnimations Hit;                                                   // 0x0000 (size: 0x20)
    FCharacterWeaponAnimations OneHandHit;                                            // 0x0020 (size: 0x20)
    TMap<class EAnimStealthKillPose, class FCharacterWeaponAnimations> StealthKills;  // 0x0040 (size: 0x50)
    FCharacterWeaponAnimations PlayingWithKnife;                                      // 0x0090 (size: 0x20)

}; // Size: 0xB0

struct FPlayerLeansAnimations
{
    class UAnimSequence* LeanLeftIn;                                                  // 0x0000 (size: 0x8)
    class UAnimSequence* LeanLeftOut;                                                 // 0x0008 (size: 0x8)
    class UAnimSequence* LeanRightIn;                                                 // 0x0010 (size: 0x8)
    class UAnimSequence* LeanRightOut;                                                // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FPlayerLocomotionAnimations
{
    class UAnimSequence* StandIdleInHip;                                              // 0x0000 (size: 0x8)
    class UAnimSequence* CrouchIdleInHip;                                             // 0x0008 (size: 0x8)
    class UAnimSequence* LowCrouchIdleInHip;                                          // 0x0010 (size: 0x8)
    FTransitionAnimations StandToCrouch;                                              // 0x0018 (size: 0x10)
    FTransitionAnimations CrouchToLowCrouch;                                          // 0x0028 (size: 0x10)
    FTransitionAnimations StandToLowCrouch;                                           // 0x0038 (size: 0x10)
    class UBlendSpace* Sprint;                                                        // 0x0048 (size: 0x8)
    class UBlendSpace* SprintWithDetector;                                            // 0x0050 (size: 0x8)
    class UBlendSpace* Run;                                                           // 0x0058 (size: 0x8)
    class UBlendSpace* RunWithDetector;                                               // 0x0060 (size: 0x8)
    class UBlendSpace* RunCombat;                                                     // 0x0068 (size: 0x8)
    class UBlendSpace* Walk;                                                          // 0x0070 (size: 0x8)
    class UBlendSpace* WalkWithDetector;                                              // 0x0078 (size: 0x8)
    class UBlendSpace* WalkAim;                                                       // 0x0080 (size: 0x8)
    class UBlendSpace* WalkLimp;                                                      // 0x0088 (size: 0x8)
    class UBlendSpace* Crouch;                                                        // 0x0090 (size: 0x8)
    class UBlendSpace* CrouchAim;                                                     // 0x0098 (size: 0x8)
    class UBlendSpace* LowCrouch;                                                     // 0x00A0 (size: 0x8)
    class UBlendSpace* LowCrouchAim;                                                  // 0x00A8 (size: 0x8)
    class UBlendSpace* WalkStart;                                                     // 0x00B0 (size: 0x8)
    class UBlendSpace* WalkStop;                                                      // 0x00B8 (size: 0x8)
    class UBlendSpace* RunStart;                                                      // 0x00C0 (size: 0x8)
    class UBlendSpace* RunStop;                                                       // 0x00C8 (size: 0x8)
    class UBlendSpace* RunToSprint;                                                   // 0x00D0 (size: 0x8)
    class UBlendSpace* SprintStop;                                                    // 0x00D8 (size: 0x8)
    class UAnimSequence* SprintToRun;                                                 // 0x00E0 (size: 0x8)
    class UAnimSequence* StandTurnInPlace;                                            // 0x00E8 (size: 0x8)
    class UAnimSequence* CrouchTurnInPlace;                                           // 0x00F0 (size: 0x8)
    class UAnimSequence* JumpStart;                                                   // 0x00F8 (size: 0x8)
    class UAnimSequence* JumpLoop;                                                    // 0x0100 (size: 0x8)
    class UAnimSequence* JumpEnd;                                                     // 0x0108 (size: 0x8)
    class UAnimSequence* JumpStartLowCrouch;                                          // 0x0110 (size: 0x8)
    class UAnimSequence* JumpLoopLowCrouch;                                           // 0x0118 (size: 0x8)
    class UAnimSequence* JumpEndLowCrouch;                                            // 0x0120 (size: 0x8)

}; // Size: 0x128

struct FPlayerThrowableItemInternalAnimations
{
    TMap<class EAnimationThrowingType, class FCharacterWeaponAnimations> Throw;       // 0x0000 (size: 0x50)
    TMap<class EAnimationThrowingType, class FCharacterWeaponAnimations> CancelThrow; // 0x0050 (size: 0x50)
    class UCurveFloat* StrongThrowForceCurve;                                         // 0x00A0 (size: 0x8)
    class UCurveFloat* LightThrowForceCurve;                                          // 0x00A8 (size: 0x8)
    class UCurveVector* StrongThrowDirectionOffsetCurve;                              // 0x00B0 (size: 0x8)
    class UCurveVector* LightThrowDirectionOffsetCurve;                               // 0x00B8 (size: 0x8)

}; // Size: 0xC0

struct FPlayerWeaponAnimations
{
    class UPlayerAnimCollection* AnimCollection;                                      // 0x0000 (size: 0x8)
    TMap<class FName, class UPlayerFirearmAnimCollection*> AttachWeaponAnimCollections; // 0x0008 (size: 0x50)
    UClass* PlayerAnimBlueprint;                                                      // 0x0058 (size: 0x8)
    FCharacterWeaponAnimations EquipWeapon;                                           // 0x0060 (size: 0x20)
    FCharacterWeaponAnimations UnequipWeapon;                                         // 0x0080 (size: 0x20)
    class UAnimMontage* AttachSelectorUnequip;                                        // 0x00A0 (size: 0x8)
    FEquipUnequipAnimations RemoveReturnLeftHand;                                     // 0x00A8 (size: 0x18)
    FAnimWeaponSwingContainer WeaponSwingConfigInHip;                                 // 0x00C0 (size: 0x38)
    FAnimWeaponSwingContainer WeaponSwingConfigInAim;                                 // 0x00F8 (size: 0x38)
    FWeaponInertiaContainer StopHipSwingInertia;                                      // 0x0130 (size: 0x20)
    FWeaponInertiaContainer StopAimSwingInertia;                                      // 0x0150 (size: 0x20)
    FWeaponInertiaContainer SprintStopInertia;                                        // 0x0170 (size: 0x20)
    FWeaponPushbackContainer HipPushback;                                             // 0x0190 (size: 0x38)
    TMap<class FName, class FWeaponPushbackContainer> AimPushback;                    // 0x01C8 (size: 0x50)
    FPlayerWeaponIdlingAnimations InactiveLongIdles;                                  // 0x0218 (size: 0x18)

}; // Size: 0x230

struct FPlayerWeaponIdlingAnimations
{
    float TimeToLaunchInactiveIdle;                                                   // 0x0000 (size: 0x4)
    TArray<FCharacterItemWeightedAnimations> Idles;                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPoseSearchForceRunInsteadSprintConfigs
{
    float DistanceFromPathStart;                                                      // 0x0000 (size: 0x4)
    float DistanceToPathEnd;                                                          // 0x0004 (size: 0x4)
    float DistanceToNextPortal;                                                       // 0x0008 (size: 0x4)
    float PortalRotationAngleThreshold;                                               // 0x000C (size: 0x4)

}; // Size: 0x10

struct FPoseSearchLocomotionAnimCollectionData
{
    class UPoseSearchSearchableAsset* Searchable;                                     // 0x0000 (size: 0x8)
    class UPoseSearchSearchableAsset* SearchableRelaxState;                           // 0x0008 (size: 0x8)
    class UPoseSearchLocomotionDescriptor* Descriptor;                                // 0x0010 (size: 0x8)
    class UPoseSearchLocomotionDescriptor* DescriptorRelaxState;                      // 0x0018 (size: 0x8)
    FPoseSearchMovementTagConfigs MovementTagConfigs;                                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FPoseSearchMovementTagConfigs
{
    FPoseSearchForceRunInsteadSprintConfigs ForceRunInsteadSprintConfigs;             // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPossibleInhabitantFaction
{
    FFactionSelector Faction;                                                         // 0x0000 (size: 0x60)
    FSpawnSettingsPerPlayerRank SpawnSettingsPerPlayerRanks;                          // 0x0060 (size: 0xA0)

}; // Size: 0x100

struct FPossibleInhabitantFactionsOverridableProperty : public FOverridableProperty
{
    TArray<FPossibleInhabitantFaction> DefaultValue;                                  // 0x0018 (size: 0x10)
    TArray<FPossibleInhabitantFaction> CurrentValue;                                  // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FPostProcessSimplifiedSettings
{
    FVector4 ColorSaturation;                                                         // 0x0000 (size: 0x20)
    FVector4 ColorContrast;                                                           // 0x0020 (size: 0x20)
    FVector4 ColorGamma;                                                              // 0x0040 (size: 0x20)
    uint8 bOverride_ColorSaturation;                                                  // 0x0060 (size: 0x1)
    uint8 bOverride_ColorContrast;                                                    // 0x0060 (size: 0x1)
    uint8 bOverride_ColorGamma;                                                       // 0x0060 (size: 0x1)
    float FilmToe;                                                                    // 0x0064 (size: 0x4)
    uint8 bOverride_FilmToe;                                                          // 0x0068 (size: 0x1)
    FWeightedBlendables WeightedBlendables;                                           // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FPostProcessState
{
    FFloatParameter DiffuseColorBoost;                                                // 0x0000 (size: 0x60)
    FFloatParameter SkylightLeaking;                                                  // 0x0060 (size: 0x60)

}; // Size: 0xC0

struct FProcessorsArray
{
    TArray<class UForceFeedbackProcessorBase*> ListOfProcessors;                      // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FProgressMaterialData
{
    FSlateBrush ProgressMaterialBrush;                                                // 0x0000 (size: 0xF0)
    FName MaterialParameterName;                                                      // 0x00F0 (size: 0x8)

}; // Size: 0x100

struct FProjectileCollection : public FBaseTickAggregationCollection
{
    TArray<class AProjectile*> Projectiles;                                           // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FProjectileHitArgs
{
}; // Size: 0x1

struct FProjectileImpactFXData
{
    class AAgent* HitAgent;                                                           // 0x0000 (size: 0x8)

}; // Size: 0x228

struct FPrototypeFeedbackArgs : public FForceFeedbackArgs
{
    FString PrototypeSID;                                                             // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FPrototypeSID
{
    FString Value;                                                                    // 0x0000 (size: 0x10)
    EPrototypeClass PrototypeClass;                                                   // 0x0020 (size: 0x4)
    FName Subtype;                                                                    // 0x0024 (size: 0x8)

}; // Size: 0x40

struct FPsySpawnStruct
{
    uint32 GameGraphMinComponentVerticesCount;                                        // 0x002C (size: 0x4)
    TSoftClassPtr<AAgent> CurrentPsyPrototypeClass;                                   // 0x0030 (size: 0x30)

}; // Size: 0x130

struct FQuestNodeCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FQuestStageSelectSettings
{
    FLinearColor CollorMein;                                                          // 0x0000 (size: 0x10)
    FLinearColor CollorSecondary;                                                     // 0x0010 (size: 0x10)
    class UTexture2D* Icon;                                                           // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FQuestStatusSettings
{
    FLinearColor Collor;                                                              // 0x0000 (size: 0x10)
    FString LocalisationSid;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRainState
{
    FFloatParameter Intensity;                                                        // 0x0000 (size: 0x60)
    FFloatParameter WeatherLightningSpawnRate;                                        // 0x0060 (size: 0x60)
    FFloatParameter Wetness;                                                          // 0x00C0 (size: 0x60)
    FFloatParameter Drying;                                                           // 0x0120 (size: 0x60)
    FFloatParameter MaxWetnessValue;                                                  // 0x0180 (size: 0x60)
    FLinearColorParameter LightningColor;                                             // 0x01E0 (size: 0x60)

}; // Size: 0x240

struct FRazerChromaDamageSettings
{
    FRazerChromaEvent Event;                                                          // 0x0000 (size: 0x18)
    float DamageThreshold;                                                            // 0x0018 (size: 0x4)
    TArray<EDamageSource> DamageSources;                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FRazerChromaEvent
{
    FString AnimationName;                                                            // 0x0000 (size: 0x10)
    int32 Priority;                                                                   // 0x0010 (size: 0x4)
    bool bLoopAnimation;                                                              // 0x0014 (size: 0x1)

}; // Size: 0x18

struct FRazerChromaVitalsSettings
{
    FRazerChromaEvent Event;                                                          // 0x0000 (size: 0x18)
    float Threshold;                                                                  // 0x0018 (size: 0x4)
    bool bEnableIfHigher;                                                             // 0x001C (size: 0x1)

}; // Size: 0x20

struct FReactionDesc
{
    ERelationLevel RelationToProvoker;                                                // 0x0000 (size: 0x1)
    ERelationLevel RelationToRequester;                                               // 0x0001 (size: 0x1)
    int32 ReactionValue;                                                              // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRebuildData
{
    FName SocketName;                                                                 // 0x0000 (size: 0x8)
    FName ParentSocketName;                                                           // 0x0008 (size: 0x8)
    bool bIsFlipped;                                                                  // 0x0010 (size: 0x1)
    class UStaticMesh* Mesh;                                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FRecoilKeys
{
    float X;                                                                          // 0x0000 (size: 0x4)
    float Y;                                                                          // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRelationLevelRange
{
    int32 Start;                                                                      // 0x0000 (size: 0x4)
    int32 End;                                                                        // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FRelationRequestDesc
{
    TArray<FReactionDesc> Reactions;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRengeSettings
{
    int32 Min;                                                                        // 0x0000 (size: 0x4)
    int32 Max;                                                                        // 0x0004 (size: 0x4)
    FLinearColor WarningColor;                                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FRestrictionsMap
{
    bool bIsFullBodyRotationBlocked;                                                  // 0x0000 (size: 0x1)
    float UpperBodyHorizontalLimit;                                                   // 0x0004 (size: 0x4)
    float UpperBodyVerticalLimit;                                                     // 0x0008 (size: 0x4)
    bool bRotateFullBodyDespiteUpperBody;                                             // 0x000C (size: 0x1)
    float InteractLimit;                                                              // 0x0010 (size: 0x4)
    bool bOnlyHeadRotateOnUpperBody;                                                  // 0x0014 (size: 0x1)
    float bFullBodyRotateSatisfyAngle;                                                // 0x0018 (size: 0x4)
    FRotator PoseRotationOffset;                                                      // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FRichWidgetRow : public FTableRowBase
{
    TSubclassOf<class UUserWidget> WidgetToDisplay;                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FRightClickMenuData
{
    class UItemSlotBaseWidget* ClickedItemSlot;                                       // 0x0008 (size: 0x8)

}; // Size: 0x6D8

struct FRightClickMenuItemData
{
}; // Size: 0x40

struct FRoleDisplaySettings
{
    FMargin Margin;                                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FRotationBodyPart
{
    ERotationPartType BodyType;                                                       // 0x0000 (size: 0x1)
    float Rotation;                                                                   // 0x0004 (size: 0x4)
    float FinalRotation;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FScarPhaseData
{
    TArray<FEffectPrototypeSID> EffectsToApply;                                       // 0x0000 (size: 0x10)
    TArray<FEffectPrototypeSID> EffectsToRemove;                                      // 0x0010 (size: 0x10)
    TArray<FAbilityPrototypeSID> AbilitiesToGive;                                     // 0x0020 (size: 0x10)
    float PhaseHPThreshold;                                                           // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FSectionTitleDisplaySettings
{
    FMargin Margin;                                                                   // 0x0000 (size: 0x10)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FShootingPatternKey
{
}; // Size: 0xC

struct FShortcutData
{
    bool bShowLegend;                                                                 // 0x0000 (size: 0x1)
    FHintStyleSettings LegendButtonStyle;                                             // 0x0008 (size: 0x28)
    FMenuHintSettings MenuHintSettings;                                               // 0x0030 (size: 0x10)
    FString InputAction;                                                              // 0x0040 (size: 0x10)
    class UMenuButtonActionBase* ExecuteAction;                                       // 0x0050 (size: 0x8)
    ETriggerEvent InputEventType;                                                     // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FSignalToReceive
{
    FGSCComponentReference SenderComponentRef;                                        // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSignalToSend
{
    FGSCComponentReference ReceiverComponentRef;                                      // 0x0000 (size: 0x50)
    FGuid ReceiverGuid;                                                               // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FSimpleMovingAnimations
{
    class UAnimSequence* Forward;                                                     // 0x0000 (size: 0x8)
    class UAnimSequence* Backward;                                                    // 0x0008 (size: 0x8)
    class UAnimSequence* Left;                                                        // 0x0010 (size: 0x8)
    class UAnimSequence* Right;                                                       // 0x0018 (size: 0x8)
    class UAnimSequence* ForwardLeft;                                                 // 0x0020 (size: 0x8)
    class UAnimSequence* ForwardRight;                                                // 0x0028 (size: 0x8)
    class UAnimSequence* BackwardLeft;                                                // 0x0030 (size: 0x8)
    class UAnimSequence* BackwardRight;                                               // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FSingleClickInteractionData : public FInteractionData
{
}; // Size: 0x18

struct FSkyAtmosphereBaseState
{
    FFloatParameter MultiScattering;                                                  // 0x0000 (size: 0x60)
    FFloatParameter AbsorptionScale;                                                  // 0x0060 (size: 0x60)
    FLinearColorParameter Absorption;                                                 // 0x00C0 (size: 0x60)
    FLinearColorParameter SkyLuminanceFactor;                                         // 0x0120 (size: 0x60)
    FFloatParameter AerialPerspectiveDistanceScale;                                   // 0x0180 (size: 0x60)
    FFloatParameter HeightFogContribution;                                            // 0x01E0 (size: 0x60)
    FFloatParameter ColorPower;                                                       // 0x0240 (size: 0x60)

}; // Size: 0x2A0

struct FSkyAtmosphereRayleighMieState
{
    FFloatParameter RayleighScatteringScale;                                          // 0x0000 (size: 0x60)
    FLinearColorParameter RayleighScattering;                                         // 0x0060 (size: 0x60)
    FFloatParameter RayleighExponentialDistribution;                                  // 0x00C0 (size: 0x60)
    FFloatParameter MieScatteringScale;                                               // 0x0120 (size: 0x60)
    FLinearColorParameter MieScattering;                                              // 0x0180 (size: 0x60)
    FFloatParameter MieScatteringAbsorption;                                          // 0x01E0 (size: 0x60)
    FLinearColorParameter MieAbsorption;                                              // 0x0240 (size: 0x60)
    FFloatParameter MieAnisotropy;                                                    // 0x02A0 (size: 0x60)
    FFloatParameter MieExponentialDistribution;                                       // 0x0300 (size: 0x60)

}; // Size: 0x360

struct FSkyAtmosphereState
{
    FSkyAtmosphereBaseState Base;                                                     // 0x0000 (size: 0x2A0)
    FSkyAtmosphereRayleighMieState RayleighMie;                                       // 0x02A0 (size: 0x360)

}; // Size: 0x600

struct FSkyLightState
{
    FFloatParameter Intensity;                                                        // 0x0000 (size: 0x60)
    FLinearColorParameter SkyLightColor;                                              // 0x0060 (size: 0x60)

}; // Size: 0xC0

struct FSkySphereState
{
    FFloatParameter AtmosphereBrightness;                                             // 0x0000 (size: 0x60)
    FFloatParameter EmissiveBrightness;                                               // 0x0060 (size: 0x60)
    FLinearColorParameter ZenithColor;                                                // 0x00C0 (size: 0x60)
    FLinearColorParameter HorizonColor;                                               // 0x0120 (size: 0x60)

}; // Size: 0x180

struct FSlotFilterSettings
{
    FName FilterIconStyleIdEnable;                                                    // 0x0000 (size: 0x8)
    FName FilterIconStyleIdDisable;                                                   // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSlotScaleSettings
{
    FMargin Padding;                                                                  // 0x0000 (size: 0x10)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0010 (size: 0x1)
    TEnumAsByte<EVerticalAlignment> VerticalAlignment;                                // 0x0011 (size: 0x1)

}; // Size: 0x14

struct FSmartCoverActionSide
{
    EAvailableCoverActionsSide Side;                                                  // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FSmartCoverActionWithSide
{
    EAvailableCoverActionsSide Side;                                                  // 0x0000 (size: 0x1)
    class UAnimMontage* Montage;                                                      // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSmartCoverAnimCollectionData
{
    TMap<class EWeaponType, class FSmartCoverWeaponTypeData> WeaponTypeAnimationsData; // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSmartCoverAnimationMainLoopData
{
    ESmartCoverActionType ActionType;                                                 // 0x0000 (size: 0x1)
    ELookAtOwnerState LookAtOwnerState;                                               // 0x0001 (size: 0x1)
    EAvailableCoverActionsSide TargetActionSide;                                      // 0x0002 (size: 0x1)
    TArray<FSmartCoverActionWithSide> LookFromCoverMontages;                          // 0x0008 (size: 0x10)
    TArray<FSmartCoverActionWithSide> HideBehindCoverMontages;                        // 0x0018 (size: 0x10)
    class UAnimMontage* IdleMontage;                                                  // 0x0028 (size: 0x8)
    class UAnimMontage* ThrowGrenadeMontage;                                          // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FSmartCoverEnterTypes
{
    EAvailableCoverActionsSide Side;                                                  // 0x0000 (size: 0x1)
    EAvailableCoverEnterTypes EnterType;                                              // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSmartCoverExitTypes
{
    EAvailableCoverActionsSide Side;                                                  // 0x0000 (size: 0x1)
    EAvailableCoverExitTypes ExitType;                                                // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSmartCoverPerCoverTypeData
{
    TArray<FSmartCoverEnterTypes> EnterData;                                          // 0x0000 (size: 0x10)
    TArray<FSmartCoverExitTypes> ExitData;                                            // 0x0010 (size: 0x10)
    TArray<FSmartCoverActionSide> IdlesData;                                          // 0x0020 (size: 0x10)
    TArray<FSmartCoverTransitionSides> TransitionsData;                               // 0x0030 (size: 0x10)
    class UAnimMontage* TransitionMontage;                                            // 0x0040 (size: 0x8)
    TArray<FSmartCoverAnimationMainLoopData> ActionAnimationsData;                    // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FSmartCoverTransitionSides
{
    EAvailableCoverActionsSide Side;                                                  // 0x0000 (size: 0x1)
    EAvailableCoverActionsSide ResultSide;                                            // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FSmartCoverWeaponTypeData
{
    TMap<class ESmartCoverType, class FSmartCoverPerCoverTypeData> AnimationsData;    // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FSnapshotMapping
{
    FName SourceNodeTag;                                                              // 0x0000 (size: 0x8)
    FName TargetNodeTag;                                                              // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FSoftAnimWeighted
{
    float ChanceToPlay;                                                               // 0x0000 (size: 0x4)
    TSoftObjectPtr<UAnimSequenceBase> Animation;                                      // 0x0008 (size: 0x30)

}; // Size: 0x38

struct FSpawnNiagaraSystemAtLocation
{
    FName AttachmentName;                                                             // 0x0000 (size: 0x8)
    ESpawnNiagaraAtLocation SpawnNiagaraAtLocation;                                   // 0x0008 (size: 0x4)
    class UNiagaraSystem* NiagaraAsset;                                               // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FSpawnPhantomParams
{
}; // Size: 0x58

struct FSpawnSettingsPerArchetype
{
    FPrototypeSID PrototypeSID;                                                       // 0x0000 (size: 0x40)
    int32 MinQuantity;                                                                // 0x0040 (size: 0x4)
    float SpawnWeight;                                                                // 0x0044 (size: 0x4)

}; // Size: 0x48

struct FSpawnSettingsPerPlayerRank
{
    ERank PlayerRank;                                                                 // 0x0000 (size: 0x1)
    int32 MaxSpawnQuantity;                                                           // 0x0004 (size: 0x4)
    float InitialSpawnQuantityPercent;                                                // 0x0008 (size: 0x4)
    float InitialSpawnQuantityRespawnTimeSeconds;                                     // 0x000C (size: 0x4)
    float MaxSpawnQuantityRespawnTimeSeconds;                                         // 0x0010 (size: 0x4)
    float WipeRespawnTimeoutSeconds;                                                  // 0x0014 (size: 0x4)
    TArray<FSpawnSettingsPerArchetype> SpawnSettingsPerArchetypes;                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FSpawnedItem
{
    FString PrototypeSID;                                                             // 0x0000 (size: 0x10)
    float Weight;                                                                     // 0x0010 (size: 0x4)
    float MinDurability;                                                              // 0x0014 (size: 0x4)
    float MaxDurability;                                                              // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FSplinePointMeshData
{
    class UStaticMesh* StrandStaticMesh;                                              // 0x0000 (size: 0x8)
    class UStaticMesh* SeparatorStaticMesh;                                           // 0x0008 (size: 0x8)
    class UPrefabAsset* PrefabStrandMesh;                                             // 0x0010 (size: 0x8)
    class UPrefabAsset* PrefabSeparatorMesh;                                          // 0x0018 (size: 0x8)

}; // Size: 0x68

struct FStashPrototypeSID : public FPrototypeSID
{
}; // Size: 0x40

struct FStatStates
{
    float Weak;                                                                       // 0x0000 (size: 0x4)
    float Medium;                                                                     // 0x0004 (size: 0x4)
    float Strong;                                                                     // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FStaticEnvironmentParticleDataRow : public FTableRowBase
{
    EStaticParticleType ParticleType;                                                 // 0x0008 (size: 0x1)
    TSet<TSubclassOf<UNiagaraParameterProvider>> Providers;                           // 0x0010 (size: 0x50)
    FParticleIndoorSpawnPrototype IndoorSpawnPrototype;                               // 0x0060 (size: 0x30)
    FParticleWeatherPrototype WeatherTypePrototype;                                   // 0x0090 (size: 0x18)
    FParticleLairPrototype LairPrototype;                                             // 0x00A8 (size: 0x20)
    FParticleDistancePrototype PlayerDistancePrototype;                               // 0x00C8 (size: 0x10)
    FParticleDaytimePrototype DaytimePrototype;                                       // 0x00D8 (size: 0x10)
    FParticleRainIntensityPrototype RainIntensityPrototype;                           // 0x00E8 (size: 0x10)
    FParticleWindIntensityPrototype WindIntensityPrototype;                           // 0x00F8 (size: 0x10)
    TArray<TSoftObjectPtr<UNiagaraSystem>> NiagaraSystems;                            // 0x0108 (size: 0x10)

}; // Size: 0x118

struct FStealthParams
{
    float FlashLightCoef;                                                             // 0x0000 (size: 0x4)
    float VisibilitySizeFactor;                                                       // 0x0004 (size: 0x4)
    float VisibilityCrouchCoef;                                                       // 0x0008 (size: 0x4)
    float VisibilityJumpCoef;                                                         // 0x000C (size: 0x4)
    float VisibilityObstacleHeadCoef;                                                 // 0x0010 (size: 0x4)
    float VisibilityObstacleBodyCoef;                                                 // 0x0014 (size: 0x4)
    float NoiseObstacleCoef;                                                          // 0x0018 (size: 0x4)
    float NoiseCrouchCoef;                                                            // 0x001C (size: 0x4)
    float NoiseJumpCoef;                                                              // 0x0020 (size: 0x4)

}; // Size: 0x24

struct FStrandFinalData
{
    TArray<FStrandSplineComponent> SplineComponentsData;                              // 0x0000 (size: 0x10)
    TArray<FStrandStaticMeshComponent> StaticMeshComponentsData;                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FStrandSplineComponent
{
    FVector WorldPos;                                                                 // 0x0000 (size: 0x18)
    class UStaticMesh* StaticMesh;                                                    // 0x0018 (size: 0x8)
    FVector StartPos;                                                                 // 0x0020 (size: 0x18)
    FVector StartTangent;                                                             // 0x0038 (size: 0x18)
    FVector EndPos;                                                                   // 0x0050 (size: 0x18)
    FVector EndTangent;                                                               // 0x0068 (size: 0x18)
    FRotator Rotation;                                                                // 0x0080 (size: 0x18)
    FVector RelativeScale;                                                            // 0x0098 (size: 0x18)

}; // Size: 0xB0

struct FStrandStaticMeshComponent
{
    FVector WorldPos;                                                                 // 0x0000 (size: 0x18)
    class UStaticMesh* StaticMesh;                                                    // 0x0018 (size: 0x8)
    FRotator RelativeRotation;                                                        // 0x0020 (size: 0x18)
    FRotator WorldRotation;                                                           // 0x0038 (size: 0x18)
    FVector RelativeScale;                                                            // 0x0050 (size: 0x18)

}; // Size: 0x68

struct FStreamingDistanceOverrideTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FStreamingDistanceOverrideVolumeState
{
    class AStreamingDistanceOverridingVolume* Volume;                                 // 0x0000 (size: 0x8)

}; // Size: 0x50

struct FStringOverridableProperty : public FOverridableProperty
{
    FString DefaultValue;                                                             // 0x0018 (size: 0x10)
    FString CurrentValue;                                                             // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FStructConditionalGeneration
{
    double RefreshGameTime;                                                           // 0x0000 (size: 0x8)
    TArray<ERank> PlayerRanks;                                                        // 0x0008 (size: 0x10)
    TArray<EGameDifficulty> Difficulties;                                             // 0x0018 (size: 0x10)
    int32 ReputationThreshold;                                                        // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FStructItemGenerationCategory
{
    EItemGenerationCategory Category;                                                 // 0x0000 (size: 0x4)
    TArray<FStructItemGeneratorSingleElement> PossibleItems;                          // 0x0008 (size: 0x10)
    bool bAllowSameCategoryGeneration;                                                // 0x0018 (size: 0x1)

}; // Size: 0x58

struct FStructItemGeneratorElementCountedPart
{
    int32 MinCount;                                                                   // 0x0000 (size: 0x4)
    int32 MaxCount;                                                                   // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FStructItemGeneratorSingleElement : public FStructItemGeneratorElementCountedPart
{
    float Chance;                                                                     // 0x000C (size: 0x4)
    float Weight;                                                                     // 0x0010 (size: 0x4)
    float MinDurability;                                                              // 0x0014 (size: 0x4)
    float MaxDurability;                                                              // 0x0018 (size: 0x4)
    EWeaponGenerationFlags WeaponGenerationFlags;                                     // 0x001C (size: 0x1)

}; // Size: 0x70

struct FSwarmDamageHandleImpact
{
    bool bSpawnCorpseOnDestroy;                                                       // 0x0000 (size: 0x1)
    bool bApplyImpulseToCorpse;                                                       // 0x0001 (size: 0x1)
    bool bAttachImpactEffectToCorpse;                                                 // 0x0002 (size: 0x1)
    bool bSetMaterialParametersToCorpse;                                              // 0x0003 (size: 0x1)
    float ImpulseScale;                                                               // 0x0004 (size: 0x4)
    float AngularImpulseScale;                                                        // 0x0008 (size: 0x4)
    TSubclassOf<class AActor> SpawnCorpseTemplate;                                    // 0x0010 (size: 0x8)
    class UNiagaraSystem* ImpactEffect;                                               // 0x0018 (size: 0x8)
    class UNiagaraSystem* EnvironmentEffect;                                          // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FSwarmInstanceSimulationConfig
{
    float AvoidenceRadius;                                                            // 0x0000 (size: 0x4)
    float AlignmentRadius;                                                            // 0x0004 (size: 0x4)
    float CohesionRadius;                                                             // 0x0008 (size: 0x4)
    float MaxForce;                                                                   // 0x000C (size: 0x4)
    float SeparationWeight;                                                           // 0x0010 (size: 0x4)
    float AlignmentWeight;                                                            // 0x0014 (size: 0x4)
    float CohesionWeight;                                                             // 0x0018 (size: 0x4)
    float AttractionPointWeight;                                                      // 0x001C (size: 0x4)
    float FlowWeight;                                                                 // 0x0020 (size: 0x4)
    float MaxSpeed;                                                                   // 0x0024 (size: 0x4)
    float LinearDrag;                                                                 // 0x0028 (size: 0x4)
    float HeightDisplacementRadius;                                                   // 0x002C (size: 0x4)
    float HeightDisplacementAmmount;                                                  // 0x0030 (size: 0x4)
    float MaxHeightDisplacement;                                                      // 0x0034 (size: 0x4)
    float ImpulseFriction;                                                            // 0x0038 (size: 0x4)
    FName VATAnimation;                                                               // 0x003C (size: 0x8)

}; // Size: 0x60

struct FSwarmVATAnimation
{
    FName StateName;                                                                  // 0x0000 (size: 0x8)
    float FrameStart;                                                                 // 0x0008 (size: 0x4)
    float FrameEnd;                                                                   // 0x000C (size: 0x4)
    float FrameRate;                                                                  // 0x0010 (size: 0x4)
    float PlaybackRate;                                                               // 0x0014 (size: 0x4)
    float BlendOutDuration;                                                           // 0x0018 (size: 0x4)
    bool bIsLooped;                                                                   // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FTaskStatusSettings
{
    FLinearColor Collor;                                                              // 0x0000 (size: 0x10)
    class UTexture2D* Icon;                                                           // 0x0010 (size: 0x8)

}; // Size: 0x20

struct FTeleportData
{
}; // Size: 0x80

struct FTeleportParams
{
}; // Size: 0x3

struct FTextProperties
{
    TEnumAsByte<EHorizontalAlignment> TextAlignment;                                  // 0x0000 (size: 0x1)
    FMargin TextMargin;                                                               // 0x0004 (size: 0x10)

}; // Size: 0x14

struct FTextSettings
{
    FName FontStyleId;                                                                // 0x0000 (size: 0x8)
    bool bUseFontColor;                                                               // 0x0008 (size: 0x1)
    FTextBlockStyle FontStyle;                                                        // 0x0010 (size: 0x3A0)
    TEnumAsByte<ETextJustify::Type> Justification;                                    // 0x03B0 (size: 0x1)
    bool bAutoWrap;                                                                   // 0x03B1 (size: 0x1)
    float WrappingTextAt;                                                             // 0x03B4 (size: 0x4)
    ETextTransformPolicy TextTransformPolicy;                                         // 0x03B8 (size: 0x1)
    float LineHeightPercentage;                                                       // 0x03BC (size: 0x4)

}; // Size: 0x3C0

struct FThreatPointerSettings
{
    float ThreatIndicatorMoveRadius;                                                  // 0x0000 (size: 0x4)
    float OpacityChangingSpeed;                                                       // 0x0004 (size: 0x4)
    float ThreatLevelChangingSpeed;                                                   // 0x0008 (size: 0x4)
    float ThreatIndicatorLevelMin;                                                    // 0x000C (size: 0x4)
    float ThreatIndicatorLevelMax;                                                    // 0x0010 (size: 0x4)
    float ThreatThreatPointerRotationSpeed;                                           // 0x0014 (size: 0x4)
    float AlertAnimationSpeed;                                                        // 0x0018 (size: 0x4)
    int32 AlertAnimationNumberLoops;                                                  // 0x001C (size: 0x4)

}; // Size: 0x20

struct FTimeBudget
{
    int32 AgentView;                                                                  // 0x0000 (size: 0x4)
    int32 AgentModel;                                                                 // 0x0004 (size: 0x4)
    int32 AnomalyView;                                                                // 0x0008 (size: 0x4)
    int32 AnomalyModel;                                                               // 0x000C (size: 0x4)
    int32 ArtifactView;                                                               // 0x0010 (size: 0x4)
    int32 ItemContainer;                                                              // 0x0014 (size: 0x4)
    int32 DestructibleView;                                                           // 0x0018 (size: 0x4)
    int32 DestructibleModel;                                                          // 0x001C (size: 0x4)
    int32 WetnessComponent;                                                           // 0x0020 (size: 0x4)
    int32 FlashlightComponent;                                                        // 0x0024 (size: 0x4)
    int32 ContextualActionModel;                                                      // 0x0028 (size: 0x4)
    int32 QuestNode;                                                                  // 0x002C (size: 0x4)

}; // Size: 0x30

struct FTipPositionArgs
{
    int32 Row;                                                                        // 0x0000 (size: 0x4)
    int32 Column;                                                                     // 0x0004 (size: 0x4)
    double size;                                                                      // 0x0008 (size: 0x8)
    ESlotDirection Direction;                                                         // 0x0010 (size: 0x1)
    TEnumAsByte<EHorizontalAlignment> HorizontalAlignment;                            // 0x0011 (size: 0x1)
    TEnumAsByte<EVerticalAlignment> VerticalAlignment;                                // 0x0012 (size: 0x1)
    FVector2D Translation;                                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FTopazScannerVFX
{
    class UNiagaraSystem* NiagaraSystem;                                              // 0x0000 (size: 0x8)
    FTransform SpawnTransform;                                                        // 0x0010 (size: 0x60)
    float EnableTime;                                                                 // 0x0070 (size: 0x4)
    float DisableTime;                                                                // 0x0074 (size: 0x4)
    TWeakObjectPtr<class UNiagaraComponent> NiagaraComponent;                         // 0x0078 (size: 0x8)
    TWeakObjectPtr<class ATopazScanner> OwnerScanner;                                 // 0x0080 (size: 0x8)

}; // Size: 0xA0

struct FTransitionAnimations
{
    class UAnimSequence* To;                                                          // 0x0000 (size: 0x8)
    class UAnimSequence* From;                                                        // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FTutorialFilterSettings
{
    bool bIsEnableFilter;                                                             // 0x0000 (size: 0x1)
    EPDATutorialCategory Filter;                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FTwoBlendedAnimationData
{
    class UAnimSequence* FirstAnimation;                                              // 0x0000 (size: 0x8)
    class UAnimSequence* SecondAnimation;                                             // 0x0008 (size: 0x8)
    float FirstBlendIn;                                                               // 0x0010 (size: 0x4)
    float SecondBlendIn;                                                              // 0x0014 (size: 0x4)
    bool bUseFirstAnimation;                                                          // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FTwoLegIKData : public FBaseLegIKData
{
    FLegIKData LeftFootIKData;                                                        // 0x0008 (size: 0x10)
    FLegIKData RightFootIKData;                                                       // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FUID
{
    int32 UID;                                                                        // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FUIWarningSettings : public FTableRowBase
{
    bool IsGlobalEnable;                                                              // 0x0008 (size: 0x1)
    UIWorningType WorningType;                                                        // 0x0009 (size: 0x1)
    int32 PerfectTextSize;                                                            // 0x000C (size: 0x4)
    bool bShouldIgnoreTag;                                                            // 0x0010 (size: 0x1)
    float RowSize;                                                                    // 0x0014 (size: 0x4)
    int32 PerfectRow;                                                                 // 0x0018 (size: 0x4)
    FWarningSettings DefoultRengeSettings;                                            // 0x0020 (size: 0x20)
    TArray<FWarningSettings> RengeSettings;                                           // 0x0040 (size: 0x10)

}; // Size: 0x50

struct FUpgrade
{
}; // Size: 0x58

struct FUpgradeFilterSettings
{
    bool bEnableFilter;                                                               // 0x0000 (size: 0x1)
    EInventoryEquipmentSlot Filter;                                                   // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FUpgradeSlotData
{
}; // Size: 0x58

struct FUserAchievements
{
    TMap<class FString, class FAchievementData> Achievements;                         // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FVATAnimation
{
    FName StateName;                                                                  // 0x0000 (size: 0x8)
    float FrameStart;                                                                 // 0x0008 (size: 0x4)
    float FrameEnd;                                                                   // 0x000C (size: 0x4)
    float FrameRate;                                                                  // 0x0010 (size: 0x4)
    float PlaybackRate;                                                               // 0x0014 (size: 0x4)
    float BlendOutDuration;                                                           // 0x0018 (size: 0x4)
    bool bIsLooped;                                                                   // 0x001C (size: 0x1)

}; // Size: 0x20

struct FValueLocalisationPair
{
    int32 Value;                                                                      // 0x0000 (size: 0x4)
    FText Loc10N;                                                                     // 0x0008 (size: 0x18)

}; // Size: 0x20

struct FVelocityDebug
{
    double LinearVelocity;                                                            // 0x0000 (size: 0x8)
    double AngularVelocity;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FVictoryInput
{
    FString ActionName;                                                               // 0x0000 (size: 0x10)
    FKey Key;                                                                         // 0x0010 (size: 0x18)
    FString KeyAsString;                                                              // 0x0028 (size: 0x10)
    bool bShift;                                                                      // 0x0038 (size: 0x1)
    bool bCtrl;                                                                       // 0x0039 (size: 0x1)
    bool bAlt;                                                                        // 0x003A (size: 0x1)
    bool bCmd;                                                                        // 0x003B (size: 0x1)
    bool bGamepad;                                                                    // 0x003C (size: 0x1)
    EKeyCategory Category;                                                            // 0x003D (size: 0x1)

}; // Size: 0x40

struct FVictoryInputAxis
{
    FString AxisName;                                                                 // 0x0000 (size: 0x10)
    FString KeyAsString;                                                              // 0x0010 (size: 0x10)
    FKey Key;                                                                         // 0x0020 (size: 0x18)
    float Scale;                                                                      // 0x0038 (size: 0x4)
    EKeyCategory Category;                                                            // 0x003C (size: 0x1)

}; // Size: 0x40

struct FViewOpenSettings
{
    bool bShouldEffectCursorOnShow;                                                   // 0x0000 (size: 0x1)
    bool bShoudShowMouseCursor;                                                       // 0x0001 (size: 0x1)
    bool bShoudIdleAnimation;                                                         // 0x0002 (size: 0x1)
    bool bShoudIgnoreInputOnPause;                                                    // 0x0003 (size: 0x1)
    bool bShoudClearInputOnClose;                                                     // 0x0004 (size: 0x1)
    bool bShoudSendOpenUpdateEvent;                                                   // 0x0005 (size: 0x1)
    bool bShoudCheckOpenView;                                                         // 0x0006 (size: 0x1)
    bool bShoudIgnoreCheckOpenView;                                                   // 0x0007 (size: 0x1)
    bool bShoudIgnoreLowPriority;                                                     // 0x0008 (size: 0x1)
    bool bNewerCloseOtherViews;                                                       // 0x0009 (size: 0x1)
    ECloseType CloseType;                                                             // 0x000A (size: 0x1)
    TArray<EWidgetNameEx> WidgetsToHideThisWhenOpen;                                  // 0x0010 (size: 0x10)
    TArray<EWidgetNameEx> CloseWidgetNames;                                           // 0x0020 (size: 0x10)
    int32 PriorityZOrder;                                                             // 0x0030 (size: 0x4)
    bool bCanBeRestoredAfterPause;                                                    // 0x0034 (size: 0x1)

}; // Size: 0x38

struct FVolumetricCloudState
{
    FFloatParameter CloudMapBias;                                                     // 0x0000 (size: 0x60)
    FFloatParameter CloudMapDensity;                                                  // 0x0060 (size: 0x60)
    FFloatParameter NoiseFlowMapAMultiplier;                                          // 0x00C0 (size: 0x60)
    FFloatParameter NoiseFlowMapABias;                                                // 0x0120 (size: 0x60)
    FFloatParameter NoiseFlowMapADetail;                                              // 0x0180 (size: 0x60)
    FFloatParameter NoiseFlowMapABottomNoise;                                         // 0x01E0 (size: 0x60)
    FFloatParameter NoiseFlowMapBBias;                                                // 0x0240 (size: 0x60)
    FFloatParameter NoiseFlowMapBDetail;                                              // 0x02A0 (size: 0x60)
    FFloatParameter NoiseFlowMapBScale;                                               // 0x0300 (size: 0x60)
    FFloatParameter BillowyStormyCloudsHeight;                                        // 0x0360 (size: 0x60)
    FFloatParameter DensityVariationScale;                                            // 0x03C0 (size: 0x60)
    FFloatParameter DensityVariationPower;                                            // 0x0420 (size: 0x60)
    FFloatParameter DensityVariationOutFirst;                                         // 0x0480 (size: 0x60)
    FFloatParameter DensityVariationOutSecond;                                        // 0x04E0 (size: 0x60)
    FFloatParameter DensityVariationDarkMinDensity;                                   // 0x0540 (size: 0x60)
    FFloatParameter CloudBaseCapMaskRadius;                                           // 0x05A0 (size: 0x60)
    FFloatParameter CloudBaseSpeedMultiplier;                                         // 0x0600 (size: 0x60)
    FLinearColorParameter CloudBaseECX;                                               // 0x0660 (size: 0x60)
    FFloatParameter CloudBasePreExponentialDensity;                                   // 0x06C0 (size: 0x60)
    FLinearColorParameter CloudBaseAlbedo;                                            // 0x0720 (size: 0x60)
    FLinearColorParameter CloudBaseSecondAlbedo;                                      // 0x0780 (size: 0x60)
    FLinearColorParameter EmissionParamPositionIntensity;                             // 0x07E0 (size: 0x60)
    FLinearColorParameter EmissionParamColor;                                         // 0x0840 (size: 0x60)
    FFloatParameter PhaseBlend;                                                       // 0x08A0 (size: 0x60)
    FFloatParameter PhaseG;                                                           // 0x0900 (size: 0x60)
    FFloatParameter PhaseGSecond;                                                     // 0x0960 (size: 0x60)
    FFloatParameter MultiScatteringContribution;                                      // 0x09C0 (size: 0x60)
    FFloatParameter MultiScatteringOcclusion;                                         // 0x0A20 (size: 0x60)
    FFloatParameter MultiScatteringOcclusionPower;                                    // 0x0A80 (size: 0x60)
    FFloatParameter MultiScatteringEccentricity;                                      // 0x0AE0 (size: 0x60)
    FFloatParameter LayerHeight;                                                      // 0x0B40 (size: 0x60)
    FFloatParameter LayerBottomAltitude;                                              // 0x0BA0 (size: 0x60)

}; // Size: 0xC00

struct FVortexSplineDataPoint
{
    float TargetSpeed;                                                                // 0x0000 (size: 0x4)
    float DistanceFromStart;                                                          // 0x0004 (size: 0x4)
    int32 PointIndex;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWLCylinderShapeParams
{
    FVector Location;                                                                 // 0x0000 (size: 0x18)
    float Radius;                                                                     // 0x0018 (size: 0x4)
    float ZMin;                                                                       // 0x001C (size: 0x4)
    float ZMax;                                                                       // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FWLParticlesPropertyState
{
    FName PropertyName;                                                               // 0x0000 (size: 0x8)
    float TargetValue;                                                                // 0x0008 (size: 0x4)
    float InterpolationSpeed;                                                         // 0x000C (size: 0x4)

}; // Size: 0x10

struct FWLSplinePointTiming
{
}; // Size: 0x1

struct FWanderingLightInstanceData
{
    FVector BaseLocation;                                                             // 0x0000 (size: 0x18)
    FInterpCurveVector HorizontalMovementCurve;                                       // 0x0018 (size: 0x18)
    float HorizontalMovementDuration;                                                 // 0x0030 (size: 0x4)
    float HorizontalMovementDenom;                                                    // 0x0034 (size: 0x4)
    float BaseVerticalOffset;                                                         // 0x0038 (size: 0x4)
    bool bCircularMovement;                                                           // 0x003C (size: 0x1)

}; // Size: 0x40

struct FWarningSettings
{
    TArray<ELocalizationLanguage> Localization;                                       // 0x0000 (size: 0x10)
    TArray<FRengeSettings> RengeSettings;                                             // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWaterHitArgs
{
}; // Size: 0x1

struct FWaterSurfaceObstructionResult
{
    bool bObstructed;                                                                 // 0x0000 (size: 0x1)
    double DistanceToWater;                                                           // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FWeapon
{
}; // Size: 0x8

struct FWeaponAttachMeshesData
{
    TMap<class EAttachType, class FAttachMeshesData> AttachMeshesMap;                 // 0x0000 (size: 0x50)
    TArray<class UMeshComponent*> BulletMeshes;                                       // 0x0050 (size: 0x10)
    TArray<FAttachedMagazineStruct> MagazineMeshes;                                   // 0x0060 (size: 0x10)
    TArray<class UMeshComponent*> WeaponStaticMeshParts;                              // 0x0070 (size: 0x10)

}; // Size: 0x80

struct FWeaponFireEvents
{
    class UAkAudioEvent* FireEventOneShot;                                            // 0x0000 (size: 0x8)
    class UAkAudioEvent* FireEventLoop;                                               // 0x0008 (size: 0x8)
    class UAkAudioEvent* FireEventBreak;                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FWeaponInertiaContainer
{
    class UCurveVector* InertiaRotationCurve;                                         // 0x0000 (size: 0x8)
    class UCurveVector* InertiaTranslationCurve;                                      // 0x0008 (size: 0x8)
    class UCurveFloat* InertiaTimeScaleCurve;                                         // 0x0010 (size: 0x8)
    class UCurveFloat* AmplitudeScaleCurve;                                           // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FWeaponPushbackContainer
{
    float DelayBeforeBlendStarting;                                                   // 0x0000 (size: 0x4)
    FAlphaBlendArgs BlendInArgs;                                                      // 0x0008 (size: 0x10)
    FAlphaBlendArgs BlendOutArgs;                                                     // 0x0018 (size: 0x10)
    class UCurveVector* PushbackRotationCurve;                                        // 0x0028 (size: 0x8)
    class UCurveVector* PushbackTranslationCurve;                                     // 0x0030 (size: 0x8)

}; // Size: 0x38

struct FWeatherHistoryData
{
    EWeather WeatherType;                                                             // 0x0000 (size: 0x1)
    float BlendWeight;                                                                // 0x0004 (size: 0x4)
    float BlendWeightIncrease;                                                        // 0x0008 (size: 0x4)
    int32 Cooldown;                                                                   // 0x000C (size: 0x4)
    int32 MaxRepeatAmount;                                                            // 0x0010 (size: 0x4)
    int32 RepeatAmount;                                                               // 0x0014 (size: 0x4)
    bool bPaused;                                                                     // 0x0018 (size: 0x1)
    bool bAllowInDialogueTransition;                                                  // 0x0019 (size: 0x1)

}; // Size: 0x24

struct FWeatherState
{
    FSkySphereState SkySphere;                                                        // 0x0000 (size: 0x180)
    FDirectionalLightState DirLight;                                                  // 0x0180 (size: 0x360)
    FSkyLightState SkyLight;                                                          // 0x04E0 (size: 0xC0)
    FSkyAtmosphereState SkyAtmosphere;                                                // 0x05A0 (size: 0x600)
    FVolumetricCloudState VolumetricCloud;                                            // 0x0BA0 (size: 0xC00)
    FExponentialHeightFogState ExponentialHeightFog;                                  // 0x17A0 (size: 0x480)
    FFloatParameter GlobalVolumetricValue;                                            // 0x1C20 (size: 0x60)
    FFloatParameter LocalVolumetricValue;                                             // 0x1C80 (size: 0x60)
    FRainState Rain;                                                                  // 0x1CE0 (size: 0x240)
    FPostProcessState PostProcess;                                                    // 0x1F20 (size: 0xC0)
    FFloatParameter WindIntensity;                                                    // 0x1FE0 (size: 0x60)
    FFloatParameter WaterWindNormalMultiplier;                                        // 0x2040 (size: 0x60)
    FFloatParameter WaterWindBaseSpeedMultiplier;                                     // 0x20A0 (size: 0x60)
    FFloatParameter FoliageAnimationSpeed;                                            // 0x2100 (size: 0x60)
    FFloatParameter FoliageWindIntensityAmplitude;                                    // 0x2160 (size: 0x60)
    FFloatParameter FoliageRotationAmount;                                            // 0x21C0 (size: 0x60)
    FFloatParameter FoliageRotationSpeedFraction;                                     // 0x2220 (size: 0x60)
    FFloatParameter FoliageVariationSpeedFraction;                                    // 0x2280 (size: 0x60)
    FFloatParameter FoliageVariationAmount;                                           // 0x22E0 (size: 0x60)
    TMap<EWeather, float> TransitionDurations;                                        // 0x2340 (size: 0x50)

}; // Size: 0x2390

struct FWeightedFacialAnimation
{
    float Weight;                                                                     // 0x0000 (size: 0x4)
    class UAnimSequenceBase* FaceAnimation;                                           // 0x0008 (size: 0x8)
    float StartTime;                                                                  // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FWetnessComponentCollection : public FBaseTickAggregationCollection
{
}; // Size: 0x98

struct FWind
{
    FVector2D FoliageWindDirection;                                                   // 0x0000 (size: 0x10)
    float FoliageWindIntensity;                                                       // 0x0010 (size: 0x4)
    FVector2D PreviousFoliageWindDirection;                                           // 0x0018 (size: 0x10)
    float PreviousFoliageWindIntensity;                                               // 0x0028 (size: 0x4)
    float Intensity;                                                                  // 0x002C (size: 0x4)
    float WindDirectionChangeIntensity;                                               // 0x0030 (size: 0x4)
    bool bLockedDirection;                                                            // 0x0034 (size: 0x1)
    FVector2D Direction;                                                              // 0x0038 (size: 0x10)
    FVector2D TargetDirection;                                                        // 0x0048 (size: 0x10)
    FVector2D PreviousDirection;                                                      // 0x0058 (size: 0x10)

}; // Size: 0x70

struct FZoomInterval
{
    int32 MinZoomLevel;                                                               // 0x0000 (size: 0x4)
    int32 MaxZoomLevel;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FZoomLevelSettings
{
    float MapZoom;                                                                    // 0x0000 (size: 0x4)
    FMoveSettings MoveSettings;                                                       // 0x0004 (size: 0x8)

}; // Size: 0xC

struct FZoomMarkerSettings
{
    int32 MaxZoomLevelToShow;                                                         // 0x0000 (size: 0x4)
    int32 MinZoomLevelToShow;                                                         // 0x0004 (size: 0x4)
    int32 MaxZoomLevelToShowHab;                                                      // 0x0008 (size: 0x4)
    int32 MinZoomLevelToShowHub;                                                      // 0x000C (size: 0x4)

}; // Size: 0x10

class AAchievementTrigger : public AActor
{
    class UBoxComponent* TriggerArea;                                                 // 0x0298 (size: 0x8)
    FString AchievementSID;                                                           // 0x02A0 (size: 0x10)

    void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x2B0

class AActorEyesCameraActor : public ACameraActor
{
}; // Size: 0xA00

class AAgent : public AObj
{
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x0938 (size: 0x8)
    class UNPCComponent* NPCComponent;                                                // 0x0980 (size: 0x8)
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x0988 (size: 0x8)
    class UWoundedHoldComponent* WoundedHoldComponent;                                // 0x0990 (size: 0x8)
    class UTouchComponent* TouchComponent;                                            // 0x0998 (size: 0x8)
    class UMotionWarpingComponent* MotionWarpingComponent;                            // 0x09A0 (size: 0x8)
    class UAITickComponent* AITickComponent;                                          // 0x09A8 (size: 0x8)
    class UPhysicsControlComponent* PhysicsControlComponent;                          // 0x09B0 (size: 0x8)
    class ULODSyncComponent* LODSyncComponent;                                        // 0x09B8 (size: 0x8)
    class UDataLayerPhysicsComponent* DataLayerPhysicsComponent;                      // 0x09C0 (size: 0x8)
    class UDeadBody* DeadBodyComponent;                                               // 0x09C8 (size: 0x8)
    FDamageInteractVFXData DamageInteractVFXData;                                     // 0x09D0 (size: 0x10)
    FName AttachDamageInteractVFXBoneName;                                            // 0x09E0 (size: 0x8)
    class AActor* CutsceneLookAtActor;                                                // 0x09E8 (size: 0x8)
    float CutsceneEyesLookAtWeight;                                                   // 0x09F0 (size: 0x4)
    float CutsceneHeadLookAtWeight;                                                   // 0x09F4 (size: 0x4)
    ECutsceneBlinkProfile CutsceneBlinkProfile;                                       // 0x09F8 (size: 0x1)
    ECutsceneEyesIdleProfile CutsceneEyesIdleProfile;                                 // 0x09F9 (size: 0x1)
    float CutsceneProceduralEyesWeight;                                               // 0x09FC (size: 0x4)
    float CutsceneProceduralEyesAmplitude;                                            // 0x0A00 (size: 0x4)
    float CutsceneProceduralEyesIntensity;                                            // 0x0A04 (size: 0x4)
    float GuaranteedRelevancyUpdateTime;                                              // 0x0A08 (size: 0x4)
    FName RagdollProfileName;                                                         // 0x0A0C (size: 0x8)
    TArray<FName> RagdollBonesToOverlap;                                              // 0x0A18 (size: 0x10)

    void SetCutsceneProceduralEyesWeight(float Value);
    void SetCutsceneProceduralEyesIntensity(float Value);
    void SetCutsceneProceduralEyesAmplitude(float Value);
    void SetCutsceneLookAtActor(const class AActor* Value);
    void SetCutsceneHeadLookAtWeight(float Weight);
    void SetCutsceneEyesLookAtWeight(float Weight);
    void SetCutsceneEyesIdleProfile(ECutsceneEyesIdleProfile NewCutsceneEyesIdleProfile);
    void SetCutsceneBlinkProfile(ECutsceneBlinkProfile NewCutsceneBlinkProfile);
    void PsyNPCInteractionStarted(class AObj* InteractActor);
    ESpawnSource GetSpawnSource();
    void DestroyDamageInteractParticle(class UNiagaraComponent* ParticleSystem);
    void Blink();
}; // Size: 0xAB0

class AAnomaly : public AUIDActor_Anomaly
{
    class UAkComponent* AnomalyAkComponent;                                           // 0x0308 (size: 0x8)
    class UAkAudioEvent* SoundEvent;                                                  // 0x0310 (size: 0x8)
    class UAkAudioEvent* DieSound;                                                    // 0x0318 (size: 0x8)
    class UAkSwitchValue* IdleSwitch;                                                 // 0x0320 (size: 0x8)
    class UAkSwitchValue* FadeSwitch;                                                 // 0x0328 (size: 0x8)
    class UAkSwitchValue* ActiveSwitch;                                               // 0x0330 (size: 0x8)
    class UAkSwitchValue* TriggerSwitch;                                              // 0x0338 (size: 0x8)
    class UAkSwitchValue* FirstPersonSwitch;                                          // 0x0340 (size: 0x8)
    class UAkSwitchValue* ThirdPersonSwitch;                                          // 0x0348 (size: 0x8)
    class UGSCNavModifierComponent* SpaceRestrictorComponent;                         // 0x0350 (size: 0x8)
    class UBoxComponent* SpaceRestrictorShape;                                        // 0x0358 (size: 0x8)
    class UWaterContactController* WaterContactController;                            // 0x0360 (size: 0x8)

    void OnRechargeStateStarted();
    void OnNiagaraFinished(class UNiagaraComponent* FinishedNiagara);
    void OnIdleStateStarted();
    void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex);
    void OnDieSoundFinished(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
    void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
    void OnActiveStateStarted();
    void OnActivationStateStarted();
    void ForceDeactivate();
    void ForceActivateOnce();
    void ForceActivateEndless();
}; // Size: 0x398

class AAnomalyModelSpawner : public AActor
{
    class USceneComponent* SceneComponent;                                            // 0x02A0 (size: 0x8)
    FPrototypeSID PrototypeSID;                                                       // 0x02C0 (size: 0x40)
    bool bSpawnOnBeginPlay;                                                           // 0x0300 (size: 0x1)

}; // Size: 0x308

class AArtifact : public AUIDActor_ItemContainer
{
    class USphereComponent* SphereComponent;                                          // 0x02C0 (size: 0x8)
    class UNiagaraComponent* StrafeParticle;                                          // 0x02C8 (size: 0x8)
    class UArtifactInteractableComponent* ArtifactInteractableComponent;              // 0x02D0 (size: 0x8)
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x02D8 (size: 0x8)
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02E0 (size: 0x8)
    bool bDetectorRequired;                                                           // 0x02E8 (size: 0x1)
    class UAkAudioEvent* ChargingEvent;                                               // 0x0300 (size: 0x8)
    class UAkAudioEvent* JumpEvent;                                                   // 0x0308 (size: 0x8)
    class UAkAudioEvent* Sound;                                                       // 0x0310 (size: 0x8)
    class UAkAudioEvent* SoundStop;                                                   // 0x0318 (size: 0x8)
    class UAkAudioEvent* SoundStateTransitionOnHide;                                  // 0x0320 (size: 0x8)
    class UAkAudioEvent* SoundStateTransitionOnShow;                                  // 0x0328 (size: 0x8)
    class UAkSwitchValue* ArtifactTypeSwitchValue;                                    // 0x0330 (size: 0x8)
    class UFXSystemAsset* ParticleOnShow;                                             // 0x0338 (size: 0x8)
    class UAkAudioEvent* FakeArtifactDistortionSound;                                 // 0x0340 (size: 0x8)
    class UFXSystemAsset* FakeArtifactDistortionVFX;                                  // 0x0348 (size: 0x8)
    class UFXSystemAsset* FakeArtifactDissolveVFX;                                    // 0x0350 (size: 0x8)
    class UNiagaraSystem* ParticleStateTransitionFadeIn;                              // 0x0358 (size: 0x8)
    class UNiagaraSystem* ParticleStateTransitionFadeOut;                             // 0x0360 (size: 0x8)
    class UNiagaraSystem* ParticleOnImpact;                                           // 0x0368 (size: 0x8)
    class UFXSystemComponent* ActiveParticleOnShow;                                   // 0x03B8 (size: 0x8)

}; // Size: 0x3D8

class ABedView : public AUIDActor_Bed
{
    FGuid Guid;                                                                       // 0x02B0 (size: 0x10)
    class UBedHoldComponent* SleepComponent;                                          // 0x02C0 (size: 0x8)
    FPrototypeSID HappyHoursSID;                                                      // 0x02C8 (size: 0x40)
    class UStaticMeshComponent* BedMeshComponent;                                     // 0x0308 (size: 0x8)
    bool bIgnoreSleepinessValue;                                                      // 0x0320 (size: 0x1)
    bool bIgnoreEmission;                                                             // 0x0321 (size: 0x1)

    void OnSleepStarted();
    void OnSleepEnded();
    void Interact();
}; // Size: 0x330

class ABloodsucker : public AAgent
{
    class UNiagaraComponent* InvisibilityTransferParticles;                           // 0x0AA8 (size: 0x8)

}; // Size: 0xAB0

class ABolt : public AActor
{
    class UHittableComponent* HittableComponent;                                      // 0x0298 (size: 0x8)
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x02A0 (size: 0x8)
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* BoltComponent;                                        // 0x02B0 (size: 0x8)
    FString PrototypeID;                                                              // 0x02E0 (size: 0x10)

    void OnComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
}; // Size: 0x2F8

class ABulbAnomaly : public AActor
{
    class UAkAudioEvent* PullSound;                                                   // 0x02A0 (size: 0x8)
    class UAkAudioEvent* ReleaseSound;                                                // 0x02A8 (size: 0x8)
    class UAkAudioEvent* IdleSound;                                                   // 0x02B0 (size: 0x8)
    class USphereComponent* SphereComponent;                                          // 0x02B8 (size: 0x8)
    TArray<class UVehicleSoundPlacement*> VehicleSoundLocations;                      // 0x02C0 (size: 0x10)
    class UCurveFloat* DamageCurve;                                                   // 0x02D0 (size: 0x8)
    class UCurveFloat* GravityCurve;                                                  // 0x02D8 (size: 0x8)
    class ULevelSequence* AnomalySequence;                                            // 0x02E0 (size: 0x8)
    FMovieSceneSequencePlaybackSettings SequencePlaybackSettings;                     // 0x02E8 (size: 0x20)
    class ALevelSequenceActor* LevelSequenceActor;                                    // 0x0308 (size: 0x8)
    class UMaterialParameterCollection* EnvironmentMPC;                               // 0x0310 (size: 0x8)
    FName FoliageParameterName;                                                       // 0x0318 (size: 0x8)
    TArray<FString> InteractionEffectsSIDs;                                           // 0x0320 (size: 0x10)
    float EnduranceDamagePerSecond;                                                   // 0x0330 (size: 0x4)
    float GravityPower;                                                               // 0x0334 (size: 0x4)
    float GravityFree;                                                                // 0x0338 (size: 0x4)
    float CoveredMultiplier;                                                          // 0x033C (size: 0x4)
    float UncoveredMultiplier;                                                        // 0x0340 (size: 0x4)
    float CoverTraceDistance;                                                         // 0x0344 (size: 0x4)
    FName CarsTag;                                                                    // 0x0348 (size: 0x8)
    float Duration;                                                                   // 0x0354 (size: 0x4)
    float Cooldown;                                                                   // 0x0358 (size: 0x4)

    void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex);
    void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x3C0

class ACarouselAnomaly : public AAnomaly
{
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x0398 (size: 0x8)
    class UNiagaraComponent* IdleParticle;                                            // 0x03A0 (size: 0x8)
    class UNiagaraComponent* ActivateParticle;                                        // 0x03A8 (size: 0x8)
    class UFXSystemAsset* InteractionParticle;                                        // 0x03B0 (size: 0x8)
    class UFXSystemAsset* ActionDamagePlayerParticle;                                 // 0x03B8 (size: 0x8)
    class UFXSystemAsset* ActionDamageNPCParticle;                                    // 0x03C0 (size: 0x8)
    class UFXSystemAsset* WaterContactParticle;                                       // 0x03C8 (size: 0x8)
    TSoftObjectPtr<UNiagaraSystem> BodyExplodeParticle;                               // 0x03D0 (size: 0x30)
    FPrototypeSID BodyExplodeStashSID;                                                // 0x0400 (size: 0x40)
    TSoftObjectPtr<UAkAudioEvent> InteractionSoundEvent;                              // 0x0440 (size: 0x30)

}; // Size: 0x490

class AChemicalAnomaly : public AAnomaly
{
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x03A0 (size: 0x8)
    class UFXSystemAsset* SplashImpact;                                               // 0x03A8 (size: 0x8)
    class UFXSystemAsset* GrenadeExplosion;                                           // 0x03B0 (size: 0x8)

    void OnDecalSpawn();
}; // Size: 0x3B8

class AClassicFireAnomaly : public AAnomaly
{
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x0398 (size: 0x8)
    class UCapsuleComponent* FlamePillarCapsule;                                      // 0x03A0 (size: 0x8)
    class UNiagaraComponent* IdleVFX;                                                 // 0x03A8 (size: 0x8)
    class UDecalComponent* DecalComponent;                                            // 0x03B0 (size: 0x8)

    void OnStateChanged();
}; // Size: 0x3B8

class AClickerAnomaly : public AAnomaly
{
    class UStaticMeshComponent* RootComponentPtr;                                     // 0x0398 (size: 0x8)
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x03A0 (size: 0x8)
    class UNiagaraSystem* ChargeParticle;                                             // 0x03A8 (size: 0x8)
    class UNiagaraSystem* ExplosionParticle;                                          // 0x03B0 (size: 0x8)
    class UAkAudioEvent* ChargeSoundEvent;                                            // 0x03B8 (size: 0x8)
    class UAkAudioEvent* ExplosionSoundEvent;                                         // 0x03C0 (size: 0x8)
    class UCurveFloat* DamageCurve;                                                   // 0x03C8 (size: 0x8)

    void OnBeginParticleOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x420

class ACodelock : public AInteractableObject
{
    class USkeletalMeshComponent* Mesh;                                               // 0x02E8 (size: 0x8)
    class UCodelockSingleClickComponent* InteractComponent;                           // 0x02F0 (size: 0x8)
    class UCodeComponent* CodeComponent;                                              // 0x02F8 (size: 0x8)
    float CodeLockDistance;                                                           // 0x0300 (size: 0x4)
    float CodeLockZoomInTime;                                                         // 0x0304 (size: 0x4)
    float CodeLockZoomOutTime;                                                        // 0x0308 (size: 0x4)
    float CodeLockForceZoomOutTime;                                                   // 0x030C (size: 0x4)
    float FailDisplayTimerRate;                                                       // 0x0310 (size: 0x4)
    bool bOverrideKeyMap;                                                             // 0x0314 (size: 0x1)
    TMap<class FName, class ECodelockKeyType> KeyMap;                                 // 0x0318 (size: 0x50)

    void OnKeyPressed();
    void OnInputCodePassed();
    void OnInputCodeFailed();
}; // Size: 0x500

class ACollar : public AActor
{
    FString CollarSID;                                                                // 0x0298 (size: 0x10)
    class UAkComponent* HissingComp;                                                  // 0x02A8 (size: 0x8)
    class USkeletalMeshComponent* CollarSK;                                           // 0x02B0 (size: 0x8)

}; // Size: 0x2B8

class ACombatMusicOverrideVolume : public AVolume
{
    TArray<TSoftObjectPtr<UAkSwitchValue>> CombatTracks;                              // 0x02D8 (size: 0x10)

}; // Size: 0x2E8

class AContextualAction : public AUIDActor_ContextualAction
{
}; // Size: 0x2D8

class AContextualNavLinkProxy : public ANavLinkProxy
{

    void OnStartUsingCustomLink(class AActor* MovingActor, const FVector& DestinationPoint);
}; // Size: 0x2E8

class ACooldownZone : public AGSCNavModifierVolume
{
    TSubclassOf<class UNavArea> RestrictionArea;                                      // 0x0308 (size: 0x8)
    float CooldownTime;                                                               // 0x0310 (size: 0x4)

}; // Size: 0x320

class ACooldownZonesController : public AActor
{
    class UBoxComponent* ControllerVolume;                                            // 0x0298 (size: 0x8)
    TArray<TSoftObjectPtr<ACooldownZone>> CooldownZones;                              // 0x02A0 (size: 0x10)

}; // Size: 0x2B8

class ACoverGenerator : public AActor
{
    class USmartCoverRenderingComponent* DebugRenderingComp;                          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class ADestructibleObject : public AUIDActor_DestructibleObject
{
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x02F0 (size: 0x8)
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02F8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent;                                  // 0x0300 (size: 0x8)
    class UExplosionComponent* ExplosionComponent;                                    // 0x0308 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x0310 (size: 0x8)
    class UDataLayerPhysicsComponent* DataLayerPhysicsComponent;                      // 0x0318 (size: 0x8)
    TMap<class FName, class EDataLayerRuntimeState> NeededLayers;                     // 0x0360 (size: 0x50)

    void TryAdjustPosition();
    void StartDestructActions();
    void OnHit(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    void OnDataLayersUpdated(const class UDataLayerInstance* DataLayer, EDataLayerRuntimeState State);
    void GSCFramework_OnPreTransition(const FHitResult& HitResult);
    void GSCFramework_OnPostTransition();
    TArray<FObjectPhaseSettings> GSCFramework_GetObjectPhases();
    FObjectPhaseSettings GSCFramework_GetCurrentPhase();
    int32 GetCurrentPhaseIndex();
}; // Size: 0x3B0

class ADestructibleWindow : public AActor
{
    FGuid Guid;                                                                       // 0x02A8 (size: 0x10)
    class UStaticMeshComponent* WindowMesh;                                           // 0x02B8 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x02C0 (size: 0x8)
    TSoftObjectPtr<UNiagaraSystem> DestructionFX;                                     // 0x02C8 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> DestructSound;                                      // 0x02F8 (size: 0x30)

}; // Size: 0x330

class ADeveloperSpectator : public ACharacter
{
    float BaseTurnRate;                                                               // 0x0628 (size: 0x4)
    float BaseLookUpRate;                                                             // 0x062C (size: 0x4)
    float SpeedMultiplier;                                                            // 0x0630 (size: 0x4)
    class UCameraComponent* CameraComponent;                                          // 0x0638 (size: 0x8)

}; // Size: 0x660

class ADialogProtector : public AActor
{
    class UGSCNavModifierComponent* SpaceRestrictor;                                  // 0x0298 (size: 0x8)
    class UBoxComponent* SpaceRestrictorShape;                                        // 0x02A0 (size: 0x8)

}; // Size: 0x2A8

class ADiamondAnomaly : public AAnomaly
{
    class UStaticMeshComponent* CollisionMesh;                                        // 0x0398 (size: 0x8)

}; // Size: 0x3A0

class ADoorView : public AUIDActor_Door
{
    FGuid Guid;                                                                       // 0x02D0 (size: 0x10)
    class USingleClickComponent* OpenDoorSingleClick;                                 // 0x02E0 (size: 0x8)
    class USingleClickComponent* CloseDoorSingleClick;                                // 0x02E8 (size: 0x8)
    class USingleClickComponent* LockedSingleClick;                                   // 0x02F0 (size: 0x8)
    class UHoldComponent* PeekDoorHold;                                               // 0x02F8 (size: 0x8)
    class UHoldComponent* ClosePeekDoorHold;                                          // 0x0300 (size: 0x8)
    TArray<class UAkComponent*> DoorAkComponents;                                     // 0x0440 (size: 0x10)
    TArray<FRebuildData> ViewRebuildMap;                                              // 0x0450 (size: 0x10)
    FVector OverrideInteractHintLocation;                                             // 0x0460 (size: 0x18)
    bool bIsHubDoor;                                                                  // 0x0478 (size: 0x1)
    bool bIsLocked;                                                                   // 0x0479 (size: 0x1)
    bool bIsDoubleDoor;                                                               // 0x047A (size: 0x1)
    float OpenAngleThreshold;                                                         // 0x047C (size: 0x4)
    float OpenAngle;                                                                  // 0x0480 (size: 0x4)
    float DecreaseImpulseAfterOpenTime;                                               // 0x0484 (size: 0x4)
    float OpenAngularSpeed;                                                           // 0x0488 (size: 0x4)
    float CloseAngularSpeed;                                                          // 0x048C (size: 0x4)
    float AngularSpeedNormalizer;                                                     // 0x0490 (size: 0x4)
    float DoorCloseTime;                                                              // 0x0494 (size: 0x4)
    float SilentOpenAngle;                                                            // 0x0498 (size: 0x4)
    float SilentOpenAngularSpeed;                                                     // 0x049C (size: 0x4)
    float FirstLeafAngleOnStart;                                                      // 0x04A0 (size: 0x4)
    float SecondLeafAngleOnStart;                                                     // 0x04A4 (size: 0x4)
    float KnockOutAngularSpeed;                                                       // 0x04A8 (size: 0x4)
    float AutomaticDoorCloseTimeout;                                                  // 0x04AC (size: 0x4)
    float CloseDoorSpeedMultiplier;                                                   // 0x04B0 (size: 0x4)
    float DoorConstraintSFXCooldown;                                                  // 0x04B4 (size: 0x4)
    class USceneComponent* DefaultRoot;                                               // 0x04B8 (size: 0x8)
    class UStaticMeshComponent* FrameMeshComponent;                                   // 0x04C0 (size: 0x8)
    class UStaticMeshComponent* FirstLeafMeshComponent;                               // 0x04C8 (size: 0x8)
    class UStaticMeshComponent* SecondLeafMeshComponent;                              // 0x04D0 (size: 0x8)
    class UPhysicsConstraintComponent* FirstLeafPhysicsConstraintComponent;           // 0x04D8 (size: 0x8)
    class UPhysicsConstraintComponent* SecondLeafPhysicsConstraintComponent;          // 0x04E0 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x04E8 (size: 0x8)
    class UGSCNavModifierComponent* SpaceRestrictorComponent;                         // 0x04F0 (size: 0x8)
    class UBoxComponent* BlockVolume;                                                 // 0x04F8 (size: 0x8)
    class USignalReceiverComponent* InvertDoorStateReceiver;                          // 0x0500 (size: 0x8)
    class USignalReceiverComponent* InvertDoorLockReceiver;                           // 0x0508 (size: 0x8)
    class USignalReceiverComponent* OpenDoorReceiver;                                 // 0x0510 (size: 0x8)
    class USignalReceiverComponent* CloseDoorReceiver;                                // 0x0518 (size: 0x8)
    class USignalReceiverComponent* LockDoorReceiver;                                 // 0x0520 (size: 0x8)
    class USignalReceiverComponent* UnlockDoorReceiver;                               // 0x0528 (size: 0x8)
    class USignalReceiverComponent* PeekDoorReceiver;                                 // 0x0530 (size: 0x8)
    class USignalReceiverComponent* ForceOpenDoorReceiver;                            // 0x0538 (size: 0x8)
    class USignalReceiverComponent* ForceCloseDoorReceiver;                           // 0x0540 (size: 0x8)
    class USignalSenderComponent* OpenDoorSender;                                     // 0x0548 (size: 0x8)
    class USignalSenderComponent* CloseDoorSender;                                    // 0x0550 (size: 0x8)
    class USignalSenderComponent* LockDoorSender;                                     // 0x0558 (size: 0x8)
    class USignalSenderComponent* UnlockDoorSender;                                   // 0x0560 (size: 0x8)
    class USignalSenderComponent* ForceOpenDoorSender;                                // 0x0568 (size: 0x8)
    class USignalSenderComponent* ForceCloseDoorSender;                               // 0x0570 (size: 0x8)
    class USignalSenderComponent* PeekDoorSender;                                     // 0x0578 (size: 0x8)
    class UItemUsageComponent* ItemUsageComponent;                                    // 0x0580 (size: 0x8)
    TSoftObjectPtr<UAkAudioEvent> DoorMovementSFX;                                    // 0x0588 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> DoorConstraintSFX;                                  // 0x05B8 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> DoorOpenSFX;                                        // 0x05E8 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> DoorCloseSFX;                                       // 0x0618 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> UnlockDoorSFX;                                      // 0x0648 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> LockedDoorSFX;                                      // 0x0678 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> SilentDoorOpenSFX;                                  // 0x06A8 (size: 0x30)
    TSoftObjectPtr<UAkAudioEvent> KnockDoorOpenSFX;                                   // 0x06D8 (size: 0x30)
    TSoftObjectPtr<UAkRtpc> DoorMovementRTPC;                                         // 0x0708 (size: 0x30)

    void UnlockDoor();
    void RebuildDoorView();
    void PlayLockedDoorSound();
    void PeekDoor();
    void PeekCloseDoor();
    void OpenDoor();
    void OnDoorClosedCompletely();
    void OnComponentHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
    void LockDoor();
    void InvertDoorState();
    void InvertDoorLock();
    void ForceOpenDoor();
    void ForceCloseDoor();
    void CloseDoor(const bool bCloseFast);
    void ActualizeNavigationProperties();
}; // Size: 0x770

class ADynamicEnvironmentParticleActor : public AActor
{
    class UDynamicEnvironmentNiagaraComponent* EnvironmentParticleComponent;          // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class AEditorItemContainer : public AActor
{
    FString ConfigSID;                                                                // 0x0298 (size: 0x10)
    FString BaseItemContainerPrototypeSID;                                            // 0x02A8 (size: 0x10)
    FString MeshPath;                                                                 // 0x02B8 (size: 0x10)
    TArray<FSpawnedItem> SimpleItems;                                                 // 0x02C8 (size: 0x10)
    EMeshSubType ItemContainerType;                                                   // 0x02D8 (size: 0x4)

}; // Size: 0x2E0

class AEditorTools : public AActor
{
    bool bEmptyGroupsOutputToMessageLog;                                              // 0x02A0 (size: 0x1)
    bool bEmptyGroupsOutputToConsole;                                                 // 0x02A1 (size: 0x1)
    bool bRemoveEmptyGroupActors;                                                     // 0x02A2 (size: 0x1)
    EZeroBoundsFilter ZeroBoundsFilter;                                               // 0x02A3 (size: 0x1)
    bool bZeroBoundsOutputToConsole;                                                  // 0x02A4 (size: 0x1)
    bool bZeroBoundsOutputToMessageLog;                                               // 0x02A5 (size: 0x1)
    bool bBigClustersOutputToConsole;                                                 // 0x02A6 (size: 0x1)
    bool bBigClustersOutputToMessageLog;                                              // 0x02A7 (size: 0x1)
    bool bBigClustersExcludeEmptyGroupActors;                                         // 0x02A8 (size: 0x1)
    FName GridNameForDebug;                                                           // 0x02AC (size: 0x8)

    void XVerifyAllActorsForBrokenReference();
    void XRemoveRestoredLabelFromActors();
    void UpdateVoiceSounds();
    void RemoveEditorContainers();
    bool IsGameWorld(class UWorld* GameWorld);
    bool IsActorInGameWorld(class AActor* ActorToCheck);
    float GetSkyLightUpdateDeltaTime();
    void FixAttachMeshes();
    void CheckAllPrototypes();
    void ChangeNotesToTeleportPoints();
}; // Size: 0x2B8

class AEjectedMagazine : public AActor
{
    class UStaticMeshComponent* MeshComponent;                                        // 0x0298 (size: 0x8)
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02A0 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x02A8 (size: 0x8)
    TWeakObjectPtr<class AActor> OwnerActor;                                          // 0x02B0 (size: 0x8)

    void OnHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
}; // Size: 0x2B8

class AElectroAnomaly : public AAnomaly
{
    class UStaticMeshComponent* RootComponentPtr;                                     // 0x0398 (size: 0x8)
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x03A0 (size: 0x8)

    float GetRadius();
    FVector GetParticleSpawnLocation();
    FElectroAnomalyBakedDataFloat GetElectroBakedData();
    void BPSetActiveIdleVFX(const bool bNewActive);
    void BPDoLightningStrikeAfterPauseTime();
}; // Size: 0x3A8

class AEmptyObject : public AActor
{
    class USceneComponent* SceneComponent;                                            // 0x0298 (size: 0x8)
    class UBoxComponent* BoxCollision;                                                // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x02A8 (size: 0x8)

}; // Size: 0x2B0

class AEncounterNPCSpawner : public AActor
{
    class USignalSenderComponent* AllNPCKilledSender;                                 // 0x02F0 (size: 0x8)
    TArray<FEncounterSpawnPointData> SpawnPoints;                                     // 0x02F8 (size: 0x10)
    float PlayerFieldOfViewAngle;                                                     // 0x0308 (size: 0x4)
    FFloatInterval SpawnDelay;                                                        // 0x030C (size: 0x8)
    int32 NPCTotalCount;                                                              // 0x0314 (size: 0x4)
    int32 NPCMaxCount;                                                                // 0x0318 (size: 0x4)
    int32 NPCMinCount;                                                                // 0x031C (size: 0x4)
    ESpawnSource SpawnSource;                                                         // 0x0320 (size: 0x1)

    void OnAllNPCKilled();
    void Enable();
    void Disable();
    void Despawn();
}; // Size: 0x3B0

class AExpulsionAnomaly : public AAnomaly
{
    class USphereComponent* ActivationSphere;                                         // 0x0398 (size: 0x8)
    class UGeometryCacheComponent* ShapeGeometryCache;                                // 0x03A0 (size: 0x8)
    class UMaterialInterface* ShapeGeometryMaterial;                                  // 0x03A8 (size: 0x8)
    FSoftObjectPath GeometryCachePath;                                                // 0x03B0 (size: 0x20)
    class UCurveFloat* PushDistanceDelayCurve;                                        // 0x03D0 (size: 0x8)

    void OnBoltCollided(const FVector& LocalPoint);
}; // Size: 0x3E8

class AFaustBossfightController : public AActor
{
    class USphereComponent* ControllerVolume;                                         // 0x02F0 (size: 0x8)
    class UNiagaraSystem* CloneSpawnEffect;                                           // 0x02F8 (size: 0x8)
    class USignalSenderComponent* CloneKilledSender;                                  // 0x0300 (size: 0x8)
    TArray<FTransform> CloneSpawnPoints;                                              // 0x0308 (size: 0x10)
    TArray<FObjPrototypeSID> ClonePrototypes;                                         // 0x0318 (size: 0x10)
    FObjPrototypeSID BossPrototype;                                                   // 0x0328 (size: 0x40)
    float PlayerFieldOfViewAngle;                                                     // 0x0368 (size: 0x4)
    float MinSpawnDistance;                                                           // 0x036C (size: 0x4)

    void TryTeleportBossToHiddenLocation();
    void SetCloneSpawnEnabled(const bool bEnabled);
    void OnCloneSwitch(const class AActor* CloneActor);
    void OnCloneSpawned(const class AActor* CloneActor);
    void OnCloneKilled(const class AActor* CloneActor);
}; // Size: 0x3F0

class AFaustInductor : public AActor
{
    float DamageThreshold;                                                            // 0x02F8 (size: 0x4)
    int32 NumberOfInductorPhases;                                                     // 0x02FC (size: 0x4)
    float InductorCooldownTime;                                                       // 0x0300 (size: 0x4)

    void OnInvulnerableHit();
    void OnInductorEnabled();
    void OnInductorDisabled();
    void OnInductorCooldown();
}; // Size: 0x328

class AFireBreathArchiAnomaly : public AUIDActor_FireBreathAnomaly
{
    class UStaticMeshComponent* ScalableRoot;                                         // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* CollisionMesh;                                        // 0x02B0 (size: 0x8)
    float MinRadius;                                                                  // 0x02B8 (size: 0x4)
    float MaxRadius;                                                                  // 0x02BC (size: 0x4)
    float MinHeight;                                                                  // 0x02C0 (size: 0x4)
    float MaxHeight;                                                                  // 0x02C4 (size: 0x4)
    FPrototypeSID EffectPrototypeSID;                                                 // 0x02C8 (size: 0x40)
    FGuid Guid;                                                                       // 0x0320 (size: 0x10)

    void SetTimeAlpha(const float InTimeAlpha);
    void SetScaleAlpha(const float InScaleAlpha);
    void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex);
    void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
    float GetTimeAlpha();
    float GetScaleAlpha();
}; // Size: 0x340

class AFlycatcherAnomaly : public AAnomaly
{
    class USphereComponent* OverlapSphereComponent;                                   // 0x0398 (size: 0x8)
    class UStaticMeshComponent* VFXEffectSphere;                                      // 0x03A0 (size: 0x8)
    class UAkAuxBus* FlycatcherAuxBus;                                                // 0x03A8 (size: 0x8)
    class UAkLateReverbComponent* FlycatcherAuxComponent;                             // 0x03B0 (size: 0x8)
    class UAkRtpc* InfluenceLevelRTPC;                                                // 0x03B8 (size: 0x8)
    class UAkStateValue* DefaultStateValue;                                           // 0x03C0 (size: 0x8)
    class UAkStateValue* FlycatcherStateValue;                                        // 0x03C8 (size: 0x8)

}; // Size: 0x3E0

class AFogActor : public AActor
{
    class UStaticMeshComponent* FogMesh;                                              // 0x02A0 (size: 0x8)
    TArray<FFogParams> FogPresets;                                                    // 0x02A8 (size: 0x10)
    FName DensityParamName;                                                           // 0x02B8 (size: 0x8)
    FName HeightMinParamName;                                                         // 0x02C0 (size: 0x8)
    FName HeightMaxParamName;                                                         // 0x02C8 (size: 0x8)
    class UMaterialInstanceDynamic* DynamicMaterial;                                  // 0x02D0 (size: 0x8)

    FFogParams GetFogParamsForCurrentWeather();
}; // Size: 0x2E0

class AGSCAIController : public AAIController
{
}; // Size: 0x3C0

class AGSCAudioVolume : public AAkSpatialAudioVolume
{
    class UAudioRoomBakedReflectionComponent* BakedReflection;                        // 0x02F0 (size: 0x8)
    class UAudioRoomBandwidthComponent* Bandwidth;                                    // 0x02F8 (size: 0x8)
    int32 FadeTransitionDuration;                                                     // 0x0300 (size: 0x4)
    EAkCurveInterpolation FadeCurveType;                                              // 0x0304 (size: 0x1)
    bool bEnableCrowdedAmbient;                                                       // 0x0305 (size: 0x1)
    class UAkAudioEvent* CrowdedAmbientAudioEvent;                                    // 0x0308 (size: 0x8)
    EAudioRoomPresetBase AudioRoomPresetBase;                                         // 0x0310 (size: 0x1)
    EAudioRoomPresetBandwidth AudioRoomPresetBandwidth;                               // 0x0311 (size: 0x1)
    TEnumAsByte<ECollisionChannel> AudioVolumeCollisionChannel;                       // 0x0312 (size: 0x1)
    class UTextRenderComponent* InfoTextRenderComponent;                              // 0x0318 (size: 0x8)
    float BlendRadius;                                                                // 0x0320 (size: 0x4)
    float BlendWeight;                                                                // 0x0324 (size: 0x4)
    float Priority;                                                                   // 0x0328 (size: 0x4)
    bool bOverride_LumenSkylightLeaking;                                              // 0x032C (size: 0x1)
    float SkyLightLeakingAmount;                                                      // 0x0330 (size: 0x4)

}; // Size: 0xA80

class AGSCDebugDrawer : public AActor
{
    class UDrawGSCDebug* DrawComponent;                                               // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class AGSCNavData : public ARecastNavMesh
{
}; // Size: 0x628

class AGSCNavModifierVolume : public ANavModifierVolume
{
    class UGuidActorComponent* GuidComponent;                                         // 0x02F8 (size: 0x8)
    bool bIsActive;                                                                   // 0x0300 (size: 0x1)

}; // Size: 0x308

class AGameGraphData : public AActor
{
    TMap<uint32, FGameGraphContextualActions> VertexContextualActions;                // 0x02B8 (size: 0x50)
    TMap<class FGuid, class FContextualActionsGameGraphInfo> ContextualActionsVerticesInfo; // 0x0308 (size: 0x50)
    class UGameGraphRenderingComponent* DebugRenderingComp;                           // 0x0360 (size: 0x8)

}; // Size: 0x368

class AGaussDisplay : public AActor
{
    float DischargeAnimationTime;                                                     // 0x02A0 (size: 0x4)
    float ChargeAnimationTime;                                                        // 0x02A4 (size: 0x4)
    class UNiagaraSystem* ReloadVFX;                                                  // 0x02A8 (size: 0x8)
    class UNiagaraComponent* ReloadVFXComponent;                                      // 0x02B0 (size: 0x8)
    TWeakObjectPtr<class UPlayerOpticScopeComponent> OpticScopeComponent;             // 0x02B8 (size: 0x8)

}; // Size: 0x2E8

class AGrenade : public AUIDActor_Grenade
{
    class UGrenadeExplosionComponent* ExplosionComponent;                             // 0x02B0 (size: 0x8)
    class UAkComponent* ExplosionAudioComponent;                                      // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent;                                  // 0x02C0 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x02C8 (size: 0x8)
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x02D0 (size: 0x8)
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02D8 (size: 0x8)
    class UWaterContactController* WaterContactController;                            // 0x02E0 (size: 0x8)
    FString SID;                                                                      // 0x02F8 (size: 0x10)
    float TimeToExplosion;                                                            // 0x0314 (size: 0x4)
    class UMaterialInterface* ExplosionDecalMaterial;                                 // 0x0368 (size: 0x8)

    void OnHit(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    void Explode();
}; // Size: 0x3B0

class AInitLevelGameMode : public AStalker2BaseGameMode
{
}; // Size: 0x340

class AInteractableItemContainer : public AUIDActor_ItemContainer
{
    class UPhysicsSoundsComponent* PhysicsSoundsComponent;                            // 0x02C8 (size: 0x8)
    class UPhysicsInteractionComponent* PhysicsInteractionComponent;                  // 0x02D0 (size: 0x8)
    class UHittableComponent* HittableComponent;                                      // 0x02D8 (size: 0x8)
    class ULaserSightComponent* LaserSightComponent;                                  // 0x02E0 (size: 0x8)
    class UDataLayerPhysicsComponent* DataLayerPhysicsComponent;                      // 0x02E8 (size: 0x8)
    class UItemContainerInteractionComponent* InteractionComponent;                   // 0x02F0 (size: 0x8)
    FWeaponAttachMeshesData WeaponAttachesData;                                       // 0x02F8 (size: 0x80)

    void OnHit(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
}; // Size: 0x3E0

class AInteractableMonitorSection : public AInteractableObject
{
    class UStaticMeshComponent* MonitorMesh;                                          // 0x02E8 (size: 0x8)
    class USignalReceiverComponent* ActivationSignalReceiver;                         // 0x02F0 (size: 0x8)
    class USignalReceiverComponent* DeactivationSignalReceiver;                       // 0x02F8 (size: 0x8)
    class USignalReceiverComponent* DestructionSignalReceiver;                        // 0x0300 (size: 0x8)
    class UNiagaraSystem* DestructionVFX;                                             // 0x0308 (size: 0x8)

    void OnDestructionSignalReceived(class UObject* InObject);
    void OnDeactivationSignalReceived(class UObject* InObject);
    void OnActivationSignalReceived(class UObject* InObject);
}; // Size: 0x310

class AInteractableObject : public AUIDActor_InteractableObject
{
    bool bEnabled;                                                                    // 0x02B0 (size: 0x1)
    bool bUnbreakable;                                                                // 0x02B1 (size: 0x1)
    bool bBroken;                                                                     // 0x02B2 (size: 0x1)
    bool bSelfSufficient;                                                             // 0x02B3 (size: 0x1)
    bool bPrerequisiteRequired;                                                       // 0x02B4 (size: 0x1)
    bool bInteractionActive;                                                          // 0x02B5 (size: 0x1)
    bool bFirstPlay;                                                                  // 0x02B6 (size: 0x1)
    FGuid Guid;                                                                       // 0x02B8 (size: 0x10)

    bool Toggle();
    void SetUnbreakable(const bool bInUnbreakable);
    void SetSelfSufficient(const bool bInSelfSufficient);
    void SetPrerequisiteRequired(const bool bInPrerequisiteRequired);
    void SetInteractionActive(const bool bInInteractionActive);
    void SetEnabled(const bool bInEnabled);
    void SetBroken(const bool bInBroken);
    void PauseSkeletalComponent(const bool bPause);
    void OnNightStart();
    void OnFirstPlay();
    void OnEmissionStart();
    void OnEmissionFinish();
    void OnDayStart();
    void OnAnimationEventTriggered();
    bool IsUnbreakable();
    bool IsSelfSufficient();
    bool IsPrerequisiteRequired();
    bool IsInteractionActive();
    bool IsEnabled();
    bool IsBroken();
}; // Size: 0x2E8

class AInteractableStunVolume : public AInteractableObject
{
    class UStaticMeshComponent* RootMesh;                                             // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* CollisionMesh;                                        // 0x02F0 (size: 0x8)
    class UGSCNavModifierComponent* SpaceRestrictorComponent;                         // 0x02F8 (size: 0x8)
    class USignalSenderComponent* MonitorActivationSignalSender;                      // 0x0300 (size: 0x8)
    class USignalSenderComponent* ObjectActivationSignalSender;                       // 0x0308 (size: 0x8)
    class USignalSenderComponent* MonitorDeactivationSignalSender;                    // 0x0310 (size: 0x8)
    class USignalSenderComponent* ObjectDeactivationSignalSender;                     // 0x0318 (size: 0x8)
    class USignalSenderComponent* MonitorDestructionSignalSender;                     // 0x0320 (size: 0x8)
    class USignalReceiverComponent* VolumeActivationSignalReceiver;                   // 0x0328 (size: 0x8)
    TArray<FVector> TargetPoints;                                                     // 0x0330 (size: 0x10)
    float CollisionRadius;                                                            // 0x0340 (size: 0x4)
    float CollisionHeight;                                                            // 0x0344 (size: 0x4)
    float StunDuration;                                                               // 0x0348 (size: 0x4)
    float CooldownDuration;                                                           // 0x034C (size: 0x4)

    void OnVolumeForceDeactivated(class UObject* InObject);
    void OnVolumeDeactivated(class UObject* InObject);
    void OnVolumeActivated(class UObject* InObject);
    void OnCooldownEnded(class UObject* InObject);
    void ActivateVolume(class UObject* InObject);
}; // Size: 0x360

class AKorshunovFightVolumeForEffects : public AVolumeForEffects
{
    float ActiveTime;                                                                 // 0x0360 (size: 0x4)
    TSoftObjectPtr<UAkAudioEvent> VolumeSFX;                                          // 0x0368 (size: 0x30)
    class UNiagaraComponent* VolumeVFX;                                               // 0x0398 (size: 0x8)

}; // Size: 0x3A8

class ALairNavModifierVolume : public ASystemicNavModifierVolume
{
}; // Size: 0x308

class ALavaLampAnomaly : public AAnomaly
{
    class UAkAudioEvent* CollisionPlayEvent;                                          // 0x0398 (size: 0x8)
    class UAkAudioEvent* CollisionStopEvent;                                          // 0x03A0 (size: 0x8)
    class UAkAudioEvent* ClotEvent;                                                   // 0x03A8 (size: 0x8)
    float ParticleLifetimeAfterCollision;                                             // 0x03B0 (size: 0x4)
    float ClotEventDelay;                                                             // 0x03B4 (size: 0x4)
    class USphereComponent* OverlapSphereComponent;                                   // 0x03B8 (size: 0x8)
    class UNiagaraComponent* ActivationParticle;                                      // 0x03C0 (size: 0x8)
    class UMaterialInterface* ClotDecalMaterial;                                      // 0x03C8 (size: 0x8)

    void OnLavaStaticObjectCollision(FVector Location, FVector NormalDirection, float Radius);
    void OnLavaCollision(const FBasicParticleData& BasicParticleData);
    void OnFollowPositionChanged(FVector FollowPosition);
}; // Size: 0x688

class ALightningBallAnomaly : public AAnomaly
{
    class USphereComponent* OverlapDamageComponent;                                   // 0x0398 (size: 0x8)
    class UNiagaraComponent* IdleParticle;                                            // 0x03A0 (size: 0x8)
    class UFXSystemAsset* ExplosionParticle;                                          // 0x03A8 (size: 0x8)
    class UNiagaraSystem* AnomalyEatingParticle;                                      // 0x03B0 (size: 0x8)
    class UAkAudioEvent* FeastAudioEvent;                                             // 0x03B8 (size: 0x8)
    class UAkSwitchValue* FeastIdleSwitch;                                            // 0x03C0 (size: 0x8)
    class UAkSwitchValue* FeastEndSwitch;                                             // 0x03C8 (size: 0x8)
    class UAkAudioEvent* AnomalyExplosionAudioEvent;                                  // 0x03D0 (size: 0x8)
    class ULightningBallNavigationComponent* AnomalyNavigationComponent;              // 0x03D8 (size: 0x8)

}; // Size: 0x458

class AMainMenuGameMode : public AStalker2BaseGameMode
{
}; // Size: 0x340

class AMapCapture : public ASceneCapture2D
{
    FIntVector2 StartCaptureLocation;                                                 // 0x02B0 (size: 0x8)
    FIntVector2 EyeAdaptationTile;                                                    // 0x02B8 (size: 0x8)
    FIntVector2 DebugCaptureLocation;                                                 // 0x02C0 (size: 0x8)
    FCaptureConfig CaptureConfig;                                                     // 0x02C8 (size: 0x48)
    class UTextureRenderTarget2D* RenderTarget;                                       // 0x0310 (size: 0x8)

}; // Size: 0x340

class AMapSetupParams : public AActor
{
    bool bDisableLightingManager;                                                     // 0x0298 (size: 0x1)
    bool bDisableReflectionManager;                                                   // 0x0299 (size: 0x1)

}; // Size: 0x2A0

class AMistAnomaly : public AUIDActor_MistAnomaly
{
    TArray<FEffectPrototypeSID> PlayerEffectSIDs;                                     // 0x02A8 (size: 0x10)
    float WeatherSpeedFactor;                                                         // 0x02B8 (size: 0x4)
    FGuid Guid;                                                                       // 0x02BC (size: 0x10)
    class UCapsuleComponent* CapsuleComponent;                                        // 0x02D0 (size: 0x8)
    class UCapsuleComponent* SaveCapsuleComponent;                                    // 0x02D8 (size: 0x8)

    void SetTeleportationEnabled(const bool InbTeleportationEnabled);
    void OnSaveBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
    void OnPlayerTeleport();
    void OnPlayerExit();
    void OnPlayerEnter();
    void OnAnomalyEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex);
    void OnAnomalyBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x2F8

class AModelCharacter : public ACharacter
{
}; // Size: 0x640

class AMovementPathBuilderTestingActor : public ANavigationTestingActor
{
    EPathBuilderPathType PathType;                                                    // 0x03B8 (size: 0x4)
    float MaxPathLength;                                                              // 0x03BC (size: 0x4)
    TArray<FVelocityDebug> Velocities;                                                // 0x03C0 (size: 0x10)
    uint64 DesirableVelocitiesMask;                                                   // 0x03D0 (size: 0x8)
    bool bDetailedDrawing;                                                            // 0x03D8 (size: 0x1)
    bool bShowCircles;                                                                // 0x03D9 (size: 0x1)
    bool bShowKeyPoints;                                                              // 0x03DA (size: 0x1)
    bool bShowPathSectors;                                                            // 0x03DB (size: 0x1)
    bool bShowPathFilteredSectors;                                                    // 0x03DC (size: 0x1)
    float CircleRadius;                                                               // 0x03E0 (size: 0x4)
    float RotationAngle;                                                              // 0x03E4 (size: 0x4)
    bool bClockwise;                                                                  // 0x03E8 (size: 0x1)
    bool bSmoothPath;                                                                 // 0x03E9 (size: 0x1)
    bool bCorridor;                                                                   // 0x03EA (size: 0x1)
    bool bShowNavmeshSegmentTest;                                                     // 0x03EB (size: 0x1)
    FDebugRestrictionSettings RestrictionSettings;                                    // 0x03F0 (size: 0x20)
    class AActor* ExpensiveActor;                                                     // 0x0410 (size: 0x8)
    uint32 DrawPathIndex;                                                             // 0x0418 (size: 0x4)
    bool bShowSampled;                                                                // 0x041C (size: 0x1)
    float AdvancedPathfindingTime;                                                    // 0x0500 (size: 0x4)

}; // Size: 0x508

class AMusicVolume : public AVolume
{
    EMusicState MusicState;                                                           // 0x02D8 (size: 0x1)
    FName RegionSIDGlobalVariable;                                                    // 0x02DC (size: 0x8)
    TSoftObjectPtr<UAkSwitchValue> AmbientStateMusicSwitch;                           // 0x02E8 (size: 0x30)

}; // Size: 0x318

class ANavRebuildVolume : public AVolume
{
}; // Size: 0x2D8

class AObj : public AModelCharacter
{
    class UItemAppearanceComponent* ItemAppearanceComponent;                          // 0x0798 (size: 0x8)
    TArray<class UPhysicalAnimationComponent*> PhysicalAnimationComponents;           // 0x07A0 (size: 0x10)
    class UWetnessComponent* WetnessComponent;                                        // 0x07B0 (size: 0x8)
    class US2TargetMeleeSectorComponent* MeleeSectorComponent;                        // 0x07B8 (size: 0x8)
    TArray<FHitBlocker> HitBlockers;                                                  // 0x07C8 (size: 0x10)
    class UMovementComponentExt* MovementComponentExt;                                // 0x07D8 (size: 0x8)
    class UPhysicalAnimationComponent* PhysicalAnimationComponent;                    // 0x07E0 (size: 0x8)
    class UObjWaterContactController* WaterContactController;                         // 0x07E8 (size: 0x8)
    class ULaserSightComponent* LaserSightComponent;                                  // 0x07F0 (size: 0x8)
    class UCurveVector* FallingDamageCurve;                                           // 0x07F8 (size: 0x8)
    class UAkAudioEvent* FallingDamageSound;                                          // 0x0800 (size: 0x8)
    class UAkSwitchValue* FallingDamageEasySoundSwitch;                               // 0x0808 (size: 0x8)
    class UAkSwitchValue* FallingDamageMediumSoundSwitch;                             // 0x0810 (size: 0x8)
    class UAkSwitchValue* FallingDamageHighSoundSwitch;                               // 0x0818 (size: 0x8)
    FCollisionProfileName CutsceneCollisionProfile;                                   // 0x0820 (size: 0x8)
    class UDataTable* AkComponentRetargetTable;                                       // 0x0840 (size: 0x8)
    class UAttackComponent* AttackComponent;                                          // 0x0898 (size: 0x8)
    class UHeadFlashlightComponent* FlashlightComponent;                              // 0x08A0 (size: 0x8)
    class UAkComponent* AkAudioRootComponent;                                         // 0x08A8 (size: 0x8)
    class UAkComponent* AkAudioHeadComponent;                                         // 0x08B0 (size: 0x8)
    class UAkComponent* AkAudioPelvisComponent;                                       // 0x08B8 (size: 0x8)
    class UAkComponent* AkAudioLeftHandComponent;                                     // 0x08C0 (size: 0x8)
    class UAkComponent* AkAudioRightHandComponent;                                    // 0x08C8 (size: 0x8)
    class UAkComponent* AkAudioComponent;                                             // 0x08D0 (size: 0x8)
    class UNiagaraComponent* ShootingParticle;                                        // 0x08D8 (size: 0x8)
    class UNiagaraComponent* PostShootingParticle;                                    // 0x08E0 (size: 0x8)

    void StartCutsceneSequence(const class AActor* SynchronizationPoint, const FRotator OverrideRotation);
    void OnObjTurnedToTarget__DelegateSignature(bool bSuccess);
    void OnHit(class AActor* SelfActor, class AActor* OtherActor, FVector NormalImpulse, const FHitResult& Hit);
    void EndCutsceneSequence();
}; // Size: 0x920

class AOldSchoolTrigger : public AActor
{
    class UBoxComponent* Trigger;                                                     // 0x0298 (size: 0x8)
    float DistanceToHinge;                                                            // 0x02A0 (size: 0x4)
    float HalfAngleToHinge;                                                           // 0x02A4 (size: 0x4)
    class ADoorView* Door;                                                            // 0x02A8 (size: 0x8)

    void OnTriggerEndOverlap(const class UPrimitiveComponent* OverlappedComponent, const class AActor* OtherActor, const class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex);
    void OnTriggerBeginOverlap(const class UPrimitiveComponent* Comp, const class AActor* OtherActor, const class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x2B0

class APC : public AObj
{
    TSoftObjectPtr<UPlayerItemsSounds> PlayerItemSounds;                              // 0x0938 (size: 0x30)
    class UMouthComponent* Mouth;                                                     // 0x0980 (size: 0x8)
    class UDamageVoiceoverComponent* DamageVoiceover;                                 // 0x0988 (size: 0x8)
    class UAimAssistComponent* AimAssistComponent;                                    // 0x0990 (size: 0x8)
    class UAimProcessorComponent* AimProcessor;                                       // 0x0998 (size: 0x8)
    class USkeletalMeshComponent* ShadowMeshComponent;                                // 0x09A0 (size: 0x8)
    class UGeigerCounterComponent* GeigerCounterComponent;                            // 0x09A8 (size: 0x8)
    class UPsyNoiseSFXComponent* PsyNoiseSFXComponent;                                // 0x09B0 (size: 0x8)
    class UAnomalyDetectorComponent* AnomalyDetectorComponent;                        // 0x09B8 (size: 0x8)
    class UPlayerOpticScopeComponent* PlayerOpticScopeComponent;                      // 0x09C0 (size: 0x8)
    class UPlayerInteractionComponent* PlayerInteractionComponent;                    // 0x09C8 (size: 0x8)
    class UStealthKillComponent* StealthKillComponent;                                // 0x09D0 (size: 0x8)
    class AActor* StealthKillTarget;                                                  // 0x09D8 (size: 0x8)
    class USearchpointDetectorComponent* SearchpointDetectorComponent;                // 0x09E0 (size: 0x8)
    class UGAPlayerComponent* GAComponent;                                            // 0x09E8 (size: 0x8)
    bool InteractionFromBluerint;                                                     // 0x0F20 (size: 0x1)
    double MinObjectInteractImpulse;                                                  // 0x0F28 (size: 0x8)
    double MaxObjectInteractImpulse;                                                  // 0x0F30 (size: 0x8)
    double ObjectInteractDelay;                                                       // 0x0F38 (size: 0x8)
    double MinSpeedToObjectResponse;                                                  // 0x0F40 (size: 0x8)
    float NormalReapeatFPS;                                                           // 0x0F48 (size: 0x4)
    float VelocityMultimplier;                                                        // 0x0F4C (size: 0x4)
    class UCurveFloat* ObjectPenetrationToImpulseCurve;                               // 0x0F50 (size: 0x8)
    class UCurveFloat* ObjectMassToImpulseCurve;                                      // 0x0F58 (size: 0x8)
    class UCurveFloat* ObjectMassToMaxImpulseCurve;                                   // 0x0F60 (size: 0x8)
    class UCurveFloat* ReduceDamageFromNPCCurve;                                      // 0x0F68 (size: 0x8)
    EPlayerMovementType AllowedMovementActions;                                       // 0x0F78 (size: 0x1)
    class UAkRtpc* PoppyFieldSleepinessParameter;                                     // 0x1038 (size: 0x8)

    void SetLegsIKEnabled(const bool bEnabled);
    void SetInteractionTarget(const class UInteractionComponent* Target);
    void PlayInteractionOutAnimation();
    void PlayInteractionInAnimation();
    class UInteractionComponent* GetInteractionTarget();
}; // Size: 0x10F0

class APSYAnomaly : public AAnomaly
{
    class USphereComponent* CollisionComponent;                                       // 0x0398 (size: 0x8)
    class UNiagaraComponent* PSYParticle;                                             // 0x03A0 (size: 0x8)

}; // Size: 0x3B0

class APSYControllerAnomaly : public APSYAnomaly
{
}; // Size: 0x3B0

class APSYEmitterAnomaly : public APSYAnomaly
{
}; // Size: 0x3B0

class APillowAnomaly : public AAnomaly
{
    class UStaticMeshComponent* CollisionMesh;                                        // 0x0398 (size: 0x8)
    class UNiagaraComponent* IdleParticle;                                            // 0x03A0 (size: 0x8)
    class UNiagaraSystem* InteractParticle;                                           // 0x03A8 (size: 0x8)
    TMap<class EPillowAnomalyBiomeType, class TSoftObjectPtr<UNiagaraSystem>> BiomeParticles; // 0x03B0 (size: 0x50)

}; // Size: 0x410

class APlayerContextualAction : public AActor
{
    class USingleClickComponent* SingleClickComponent;                                // 0x0298 (size: 0x8)
    float CameraPitchMin;                                                             // 0x02A0 (size: 0x4)
    float CameraPitchMax;                                                             // 0x02A4 (size: 0x4)
    float CameraYawMin;                                                               // 0x02A8 (size: 0x4)
    float CameraYawMax;                                                               // 0x02AC (size: 0x4)

    void ActionStart();
    void ActionEnd();
}; // Size: 0x2B8

class APlayerStash : public AInteractableObject
{
    class USkeletalMeshComponent* SkeletalMeshComponent;                              // 0x02E8 (size: 0x8)
    class UAnimatedItemContainerInteractionComponent* InteractionComponent;           // 0x02F0 (size: 0x8)

}; // Size: 0x2F8

class APoltergeist : public AAgent
{
    class UNiagaraComponent* BodyParticles;                                           // 0x0AA8 (size: 0x8)
    class USphereComponent* BodyCollision;                                            // 0x0AB0 (size: 0x8)
    class UNiagaraComponent* DeathParticles;                                          // 0x0AB8 (size: 0x8)
    FVector MeshSpawnOffset;                                                          // 0x0AC0 (size: 0x18)
    TMap<EDamageType, float> DeathImpulseScaleMap;                                    // 0x0AD8 (size: 0x50)
    float DeathBodyVisibilityDelay;                                                   // 0x0B28 (size: 0x4)

}; // Size: 0xB50

class APoppyField : public AUIDActor_PoppyFieldAnomaly
{
}; // Size: 0x2A8

class AProjectile : public AActor
{
    class USphereComponent* CollisionComp;                                            // 0x02A0 (size: 0x8)
    class UAkAudioEvent* FlybySound;                                                  // 0x0478 (size: 0x8)

    void OnOverlap(const FHitResult& Hit);
}; // Size: 0x4A0

class APsyBeaconView : public AInteractableObject
{
}; // Size: 0x2F0

class AQuestVFXActor : public AActor
{
    FGuid Guid;                                                                       // 0x02A0 (size: 0x10)

}; // Size: 0x2B0

class ARadiationNavModifierVolume : public ASystemicNavModifierVolume
{
    ERadiationPreset RadiationPreset;                                                 // 0x0308 (size: 0x1)

}; // Size: 0x310

class ARatSwarm : public AAgent
{
    class UAkRtpc* RatUnitsAmount;                                                    // 0x0AA8 (size: 0x8)
    class UAkRtpc* LocomotionUnitsAmount;                                             // 0x0AB0 (size: 0x8)
    class UAkRtpc* DiedUnitsAmount;                                                   // 0x0AB8 (size: 0x8)
    class UAkAudioEvent* RatVoice;                                                    // 0x0AC0 (size: 0x8)
    class UAkAudioEvent* RatLocomotionVoice;                                          // 0x0AC8 (size: 0x8)
    class UAkSwitchValue* AlertState;                                                 // 0x0AD0 (size: 0x8)
    class UAkSwitchValue* AttackState;                                                // 0x0AD8 (size: 0x8)
    class UAkSwitchValue* EatingState;                                                // 0x0AE0 (size: 0x8)
    class UAkSwitchValue* IdleState;                                                  // 0x0AE8 (size: 0x8)
    class UAISwarmComponent* RatsMeshComponent;                                       // 0x0AF0 (size: 0x8)

}; // Size: 0xB00

class ARazorAnomaly : public AAnomaly
{
    class UStaticMeshComponent* RootComponentPtr;                                     // 0x0398 (size: 0x8)
    TSoftObjectPtr<UAkRtpc> RazorIntensityRTPCPtr;                                    // 0x03A0 (size: 0x30)
    class UStaticMeshComponent* CollisionMeshPtr;                                     // 0x03D0 (size: 0x8)
    class UFXSystemAsset* DamageVFX;                                                  // 0x03D8 (size: 0x8)
    class UFXSystemAsset* AIDamageVFX;                                                // 0x03E0 (size: 0x8)
    class UFXSystemAsset* ProjectileDestructionVFX;                                   // 0x03E8 (size: 0x8)
    class UFXSystemAsset* ThrowableDestructionVFX;                                    // 0x03F0 (size: 0x8)
    class UNiagaraComponent* RazorActiveVFX;                                          // 0x03F8 (size: 0x8)
    class UAkRtpc* RazorIntensityRTPC;                                                // 0x0400 (size: 0x8)

}; // Size: 0x420

class AReferenceHolderBase : public AActor
{
    TMap<class FSoftObjectPath, class UClass*> ObjectsReferences;                     // 0x0298 (size: 0x50)
    FSoftObjectPath AssetPath;                                                        // 0x02E8 (size: 0x20)

    void ValidateGatheredReferences();
    void UpdateObjectReferences();
    void CheckAssetReferences();
}; // Size: 0x310

class ASafeZoneNavModifierVolume : public ASystemicNavModifierVolume
{
}; // Size: 0x308

class AScriptedNavModifierVolume : public AGSCNavModifierVolume
{
    TSubclassOf<class UNavArea_Scripted> TargetNavArea;                               // 0x0308 (size: 0x8)

    void Deactivate();
    void Activate();
}; // Size: 0x310

class ASelectionVolumeBase : public AActor
{
    class UShapeComponent* CollisionComponent;                                        // 0x0298 (size: 0x8)

}; // Size: 0x2A0

class ASelectionVolumeBox : public ASelectionVolumeBase
{
}; // Size: 0x2A0

class ASelectionVolumeSphere : public ASelectionVolumeBase
{
}; // Size: 0x2A0

class AShelterNavModifierVolume : public ASystemicNavModifierVolume
{
}; // Size: 0x308

class ASimpleVolumeForEffects : public AVolume
{
    class UApplyEffectComponent* EffectComponent;                                     // 0x02D8 (size: 0x8)
    bool bRemoveEffectOnEndOverlap;                                                   // 0x02E0 (size: 0x1)

}; // Size: 0x2E8

class ASoapBubbleAnomaly : public AAnomaly
{
    class UAkAudioEvent* SoapBubbleDamage;                                            // 0x03A0 (size: 0x8)
    class UAkAudioEvent* SoapBubbleDestroy;                                           // 0x03A8 (size: 0x8)
    class UAkAudioEvent* SoapBubbleParticleDestroy;                                   // 0x03B0 (size: 0x8)
    class UFXSystemAsset* SoapBubbleParticleExplosion;                                // 0x03B8 (size: 0x8)
    class UMaterialInterface* SoapBubbleParticleMaterial;                             // 0x03C0 (size: 0x8)
    class UStaticMesh* SoapBubbleParticleMesh;                                        // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* SoapBubble;                                           // 0x03D0 (size: 0x8)
    class USphereComponent* SoapBubbleBoundSphere;                                    // 0x03D8 (size: 0x8)
    class UNiagaraComponent* SoapBubbleExplosionParticle;                             // 0x03E0 (size: 0x8)
    class UCurveFloat* InterpolationCurve;                                            // 0x03E8 (size: 0x8)

    void OnActorCollided(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const int32 OtherBodyIndex, const bool bFromSweep, const FHitResult& SweepResult);
}; // Size: 0x400

