#ifndef UE4SS_SDK_WBP_JiraBookmarksFlag_HPP
#define UE4SS_SDK_WBP_JiraBookmarksFlag_HPP

class UWBP_JiraBookmarksFlag_C : public UJiraBookmarksFlagWidget
{
    class UTextBlock* DescriptionText;                                                // 0x02F8 (size: 0x8)
    class UTextBlock* NoteHeader;                                                     // 0x0300 (size: 0x8)
    class UTextBlock* NoteHeader_1;                                                   // 0x0308 (size: 0x8)
    class UTextBlock* PriopityText;                                                   // 0x0310 (size: 0x8)
    class UScrollBox* ScrollBox_main;                                                 // 0x0318 (size: 0x8)
    class UTextBlock* Separator;                                                      // 0x0320 (size: 0x8)
    class UTextBlock* VersionText;                                                    // 0x0328 (size: 0x8)
    class UVerticalBox* VerticalBox_Sub;                                              // 0x0330 (size: 0x8)

}; // Size: 0x338

#endif
