#ifndef UE4SS_SDK_AnimBP_Human_HPP
#define UE4SS_SDK_AnimBP_Human_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_2505;                                                        // 0x0004 (size: 0x8)
    FName __NameProperty_2506;                                                        // 0x000C (size: 0x8)
    FName __NameProperty_2507;                                                        // 0x0014 (size: 0x8)
    FName __NameProperty_2508;                                                        // 0x001C (size: 0x8)
    FName __NameProperty_2509;                                                        // 0x0024 (size: 0x8)
    int32 __IntProperty_2510;                                                         // 0x002C (size: 0x4)
    FName __NameProperty_2511;                                                        // 0x0030 (size: 0x8)
    int32 __IntProperty_2512;                                                         // 0x0038 (size: 0x4)
    FName __NameProperty_2513;                                                        // 0x003C (size: 0x8)
    FName __NameProperty_2514;                                                        // 0x0044 (size: 0x8)
    FName __NameProperty_2515;                                                        // 0x004C (size: 0x8)
    FName __NameProperty_2516;                                                        // 0x0054 (size: 0x8)
    EAlphaBlendOption __EnumProperty_2517;                                            // 0x005C (size: 0x1)
    TArray<float> __ArrayProperty_2518;                                               // 0x0060 (size: 0x10)
    FName __NameProperty_2519;                                                        // 0x0070 (size: 0x8)
    FName __NameProperty_2520;                                                        // 0x0078 (size: 0x8)
    TArray<float> __ArrayProperty_2521;                                               // 0x0080 (size: 0x10)
    TArray<int32> __ArrayProperty_2522;                                               // 0x0090 (size: 0x10)
    TArray<float> __ArrayProperty_2523;                                               // 0x00A0 (size: 0x10)
    EAnimSyncMethod __EnumProperty_2524;                                              // 0x00B0 (size: 0x1)
    FName __NameProperty_2525;                                                        // 0x00B4 (size: 0x8)
    TArray<float> __ArrayProperty_2526;                                               // 0x00C0 (size: 0x10)
    TArray<float> __ArrayProperty_2527;                                               // 0x00D0 (size: 0x10)
    TArray<int32> __ArrayProperty_2528;                                               // 0x00E0 (size: 0x10)
    TArray<float> __ArrayProperty_2529;                                               // 0x00F0 (size: 0x10)
    FName __NameProperty_2530;                                                        // 0x0100 (size: 0x8)
    FName __NameProperty_2531;                                                        // 0x0108 (size: 0x8)
    int32 __IntProperty_2532;                                                         // 0x0110 (size: 0x4)
    TArray<float> __ArrayProperty_2533;                                               // 0x0118 (size: 0x10)
    TArray<float> __ArrayProperty_2534;                                               // 0x0128 (size: 0x10)
    FName __NameProperty_2535;                                                        // 0x0138 (size: 0x8)
    FName __NameProperty_2536;                                                        // 0x0140 (size: 0x8)
    int32 __IntProperty_2537;                                                         // 0x0148 (size: 0x4)
    TArray<float> __ArrayProperty_2538;                                               // 0x0150 (size: 0x10)
    TArray<int32> __ArrayProperty_2539;                                               // 0x0160 (size: 0x10)
    TArray<int32> __ArrayProperty_2540;                                               // 0x0170 (size: 0x10)
    TArray<float> __ArrayProperty_2541;                                               // 0x0180 (size: 0x10)
    TArray<float> __ArrayProperty_2542;                                               // 0x0190 (size: 0x10)
    TArray<int32> __ArrayProperty_2543;                                               // 0x01A0 (size: 0x10)
    FName __NameProperty_2544;                                                        // 0x01B0 (size: 0x8)
    FName __NameProperty_2545;                                                        // 0x01B8 (size: 0x8)
    FName __NameProperty_2546;                                                        // 0x01C0 (size: 0x8)
    int32 __IntProperty_2547;                                                         // 0x01C8 (size: 0x4)
    FName __NameProperty_2548;                                                        // 0x01CC (size: 0x8)
    int32 __IntProperty_2549;                                                         // 0x01D4 (size: 0x4)
    FName __NameProperty_2550;                                                        // 0x01D8 (size: 0x8)
    int32 __IntProperty_2551;                                                         // 0x01E0 (size: 0x4)
    FName __NameProperty_2552;                                                        // 0x01E4 (size: 0x8)
    int32 __IntProperty_2553;                                                         // 0x01EC (size: 0x4)
    FName __NameProperty_2554;                                                        // 0x01F0 (size: 0x8)
    FName __NameProperty_2555;                                                        // 0x01F8 (size: 0x8)
    int32 __IntProperty_2556;                                                         // 0x0200 (size: 0x4)
    TArray<float> __ArrayProperty_2557;                                               // 0x0208 (size: 0x10)
    TArray<int32> __ArrayProperty_2558;                                               // 0x0218 (size: 0x10)
    float __FloatProperty_2559;                                                       // 0x0228 (size: 0x4)
    TArray<float> __ArrayProperty_2560;                                               // 0x0230 (size: 0x10)
    TArray<int32> __ArrayProperty_2561;                                               // 0x0240 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_2562;                                    // 0x0250 (size: 0x1)
    TArray<float> __ArrayProperty_2563;                                               // 0x0258 (size: 0x10)
    FInputScaleBiasClampConstants __StructProperty_2564;                              // 0x0268 (size: 0x2C)
    float __FloatProperty_2565;                                                       // 0x0294 (size: 0x4)
    TArray<float> __ArrayProperty_2566;                                               // 0x0298 (size: 0x10)
    TArray<int32> __ArrayProperty_2567;                                               // 0x02A8 (size: 0x10)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_2568;                       // 0x02B8 (size: 0x1)
    bool __BoolProperty_2569;                                                         // 0x02B9 (size: 0x1)
    float __FloatProperty_2570;                                                       // 0x02BC (size: 0x4)
    EAnimSyncMethod __EnumProperty_2571;                                              // 0x02C0 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_2572;                            // 0x02C1 (size: 0x1)
    FName __NameProperty_2573;                                                        // 0x02C4 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_2574;                                       // 0x02D0 (size: 0x20)
    class UBlendProfile* __BlendProfile_2575;                                         // 0x02F0 (size: 0x8)
    class UCurveFloat* __CurveFloat_2576;                                             // 0x02F8 (size: 0x8)
    bool __BoolProperty_2577;                                                         // 0x0300 (size: 0x1)
    EAlphaBlendOption __EnumProperty_2578;                                            // 0x0301 (size: 0x1)
    EBlendListTransitionType __EnumProperty_2579;                                     // 0x0302 (size: 0x1)
    TArray<float> __ArrayProperty_2580;                                               // 0x0308 (size: 0x10)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x0318 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0378 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x03F8 (size: 0x18)

}; // Size: 0x410

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    bool __BoolProperty_2;                                                            // 0x000C (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x000D (size: 0x1)
    float __FloatProperty_4;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_5;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_7;                                                          // 0x001C (size: 0x4)
    bool __BoolProperty_8;                                                            // 0x0020 (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x0021 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_10;                                   // 0x0028 (size: 0x8)
    class UObject* __Object_11;                                                       // 0x0030 (size: 0x8)
    bool __BoolProperty_12;                                                           // 0x0038 (size: 0x1)
    class UObject* __Object_13;                                                       // 0x0040 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_14;                                   // 0x0048 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_15;                                   // 0x0050 (size: 0x8)
    bool __BoolProperty_16;                                                           // 0x0058 (size: 0x1)
    bool __BoolProperty_17;                                                           // 0x0059 (size: 0x1)
    float __FloatProperty_18;                                                         // 0x005C (size: 0x4)
    bool __BoolProperty_19;                                                           // 0x0060 (size: 0x1)
    float __FloatProperty_20;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_22;                                                         // 0x006C (size: 0x4)
    uint8 __ByteProperty_23;                                                          // 0x0070 (size: 0x1)
    bool __BoolProperty_24;                                                           // 0x0071 (size: 0x1)
    float __FloatProperty_25;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x007C (size: 0x4)
    bool __BoolProperty_28;                                                           // 0x0080 (size: 0x1)
    float __FloatProperty_29;                                                         // 0x0084 (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0088 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x008C (size: 0x4)
    float __FloatProperty_32;                                                         // 0x0090 (size: 0x4)
    float __FloatProperty_33;                                                         // 0x0094 (size: 0x4)
    float __FloatProperty_34;                                                         // 0x0098 (size: 0x4)
    float __FloatProperty_35;                                                         // 0x009C (size: 0x4)
    float __FloatProperty_36;                                                         // 0x00A0 (size: 0x4)
    uint8 __ByteProperty_37;                                                          // 0x00A4 (size: 0x1)
    float __FloatProperty_38;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_39;                                                         // 0x00AC (size: 0x4)
    float __FloatProperty_40;                                                         // 0x00B0 (size: 0x4)
    float __FloatProperty_41;                                                         // 0x00B4 (size: 0x4)
    float __FloatProperty_42;                                                         // 0x00B8 (size: 0x4)
    float __FloatProperty_43;                                                         // 0x00BC (size: 0x4)
    float __FloatProperty_44;                                                         // 0x00C0 (size: 0x4)
    float __FloatProperty_45;                                                         // 0x00C4 (size: 0x4)
    float __FloatProperty_46;                                                         // 0x00C8 (size: 0x4)
    float __FloatProperty_47;                                                         // 0x00CC (size: 0x4)
    float __FloatProperty_48;                                                         // 0x00D0 (size: 0x4)
    float __FloatProperty_49;                                                         // 0x00D4 (size: 0x4)
    bool __BoolProperty_50;                                                           // 0x00D8 (size: 0x1)
    bool __BoolProperty_51;                                                           // 0x00D9 (size: 0x1)
    float __FloatProperty_52;                                                         // 0x00DC (size: 0x4)
    float __FloatProperty_53;                                                         // 0x00E0 (size: 0x4)
    bool __BoolProperty_54;                                                           // 0x00E4 (size: 0x1)
    bool __BoolProperty_55;                                                           // 0x00E5 (size: 0x1)
    TArray<float> __ArrayProperty_56;                                                 // 0x00E8 (size: 0x10)
    bool __BoolProperty_57;                                                           // 0x00F8 (size: 0x1)
    uint8 __ByteProperty_58;                                                          // 0x00F9 (size: 0x1)
    bool __BoolProperty_59;                                                           // 0x00FA (size: 0x1)
    uint8 __ByteProperty_60;                                                          // 0x00FB (size: 0x1)
    bool __BoolProperty_61;                                                           // 0x00FC (size: 0x1)
    bool __BoolProperty_62;                                                           // 0x00FD (size: 0x1)
    bool __BoolProperty_63;                                                           // 0x00FE (size: 0x1)
    float __FloatProperty_64;                                                         // 0x0100 (size: 0x4)
    bool __BoolProperty_65;                                                           // 0x0104 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_66;                                   // 0x0108 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_67;                                   // 0x0110 (size: 0x8)
    uint8 __ByteProperty_68;                                                          // 0x0118 (size: 0x1)
    uint8 __ByteProperty_69;                                                          // 0x0119 (size: 0x1)
    bool __BoolProperty_70;                                                           // 0x011A (size: 0x1)
    bool __BoolProperty_71;                                                           // 0x011B (size: 0x1)
    uint8 __ByteProperty_72;                                                          // 0x011C (size: 0x1)
    uint8 __ByteProperty_73;                                                          // 0x011D (size: 0x1)
    uint8 __ByteProperty_74;                                                          // 0x011E (size: 0x1)
    uint8 __ByteProperty_75;                                                          // 0x011F (size: 0x1)
    bool __BoolProperty_76;                                                           // 0x0120 (size: 0x1)
    bool __BoolProperty_77;                                                           // 0x0121 (size: 0x1)
    bool __BoolProperty_78;                                                           // 0x0122 (size: 0x1)
    uint8 __ByteProperty_79;                                                          // 0x0123 (size: 0x1)
    bool __BoolProperty_80;                                                           // 0x0124 (size: 0x1)
    bool __BoolProperty_81;                                                           // 0x0125 (size: 0x1)
    uint8 __ByteProperty_82;                                                          // 0x0126 (size: 0x1)
    uint8 __ByteProperty_83;                                                          // 0x0127 (size: 0x1)
    class UObject* __Object_84;                                                       // 0x0128 (size: 0x8)
    class UObject* __Object_85;                                                       // 0x0130 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_86;                                   // 0x0138 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_87;                                   // 0x0140 (size: 0x8)
    bool __BoolProperty_88;                                                           // 0x0148 (size: 0x1)
    bool __BoolProperty_89;                                                           // 0x0149 (size: 0x1)
    uint8 __ByteProperty_90;                                                          // 0x014A (size: 0x1)
    class UObject* __Object_91;                                                       // 0x0150 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_92;                                   // 0x0158 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_93;                                   // 0x0160 (size: 0x8)
    class UObject* __Object_94;                                                       // 0x0168 (size: 0x8)

}; // Size: 0x170

class UAnimBP_Human_C : public UAnimInstanceHuman
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x11F0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x11F8 (size: 0x170)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x1368 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x1370 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x1378 (size: 0x8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_6;          // 0x1380 (size: 0xD0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29;                       // 0x1450 (size: 0x48)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x1498 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x1550 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x1658 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x1780 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18;                     // 0x17C8 (size: 0x70)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_5;          // 0x1838 (size: 0xD0)
    FAnimNode_CacheBlend_GSC AnimGraphNode_CacheBlend_GSC;                            // 0x1908 (size: 0x68)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot_1;                              // 0x1970 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x1A00 (size: 0x48)
    FAnimNode_PoseSearchHistoryCollector AnimGraphNode_PoseSearchHistoryCollector;    // 0x1A48 (size: 0x50)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35;                           // 0x1A98 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x1AC0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x1B08 (size: 0x108)
    FAnimNode_EvaluateInputs_GSC AnimGraphNode_EvaluateInputs_GSC_1;                  // 0x1C10 (size: 0x38)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x1C48 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x1D70 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x1E78 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x1E98 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34;                           // 0x1EE0 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x1F08 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x1F28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x1F50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x1F78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x1FA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x1FC8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17;                     // 0x1FF0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x2060 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16;                     // 0x2080 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x20F0 (size: 0x20)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_5;                                   // 0x2110 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x2120 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x2140 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33;                           // 0x2208 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x2230 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x2338 (size: 0x108)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC_1;                            // 0x2440 (size: 0x178)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC;                              // 0x25B8 (size: 0x178)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x2730 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32;                           // 0x2820 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x2848 (size: 0xE0)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_4;                                   // 0x2928 (size: 0x10)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x2938 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x2A00 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x2B08 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x2B30 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x2C38 (size: 0x28)
    FAnimNode_PoseSnapshot AnimGraphNode_PoseSnapshot;                                // 0x2C60 (size: 0x90)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x2CF0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x2D38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x2D60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x2D88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x2DB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x2DD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x2E00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x2E28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x2E50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x2E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x2EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x2EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x2EF0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x2F18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x2F38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x2F80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x2FA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x2FE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x3008 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x3050 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x3070 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x30B8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x30D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x3120 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x3140 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_27;                             // 0x3188 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x3200 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x3248 (size: 0x40)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4;          // 0x3288 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x3358 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_5;          // 0x33A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x33E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x3408 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x3450 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x3470 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x34B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x34D8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x35A0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x35E8 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x36F0 (size: 0x48)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive;                  // 0x3738 (size: 0x38)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x3770 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x37B8 (size: 0xE0)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_4;          // 0x3898 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_3;                                   // 0x38E0 (size: 0x10)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x38F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x3918 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x3940 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x3980 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x39A0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x39E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x3A00 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x3AC8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x3BD0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x3BF8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x3C20 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x3C48 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x3D38 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x3D60 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x3E68 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x3E90 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x3F98 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x3FC0 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0x4008 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x40D8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x4100 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x4148 (size: 0x70)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x41B8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x42C0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x42E8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x4330 (size: 0x70)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x43A0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x43C8 (size: 0xD0)
    FAnimNode_MotionMatching AnimGraphNode_MotionMatching;                            // 0x44A0 (size: 0x2E0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x4780 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x47A8 (size: 0xE0)
    FAnimNode_AimOffsetLookAt AnimGraphNode_AimOffsetLookAt_1;                        // 0x4890 (size: 0x1E0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x4A70 (size: 0x70)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_13;                       // 0x4AE0 (size: 0x48)
    FAnimNode_EvaluateInputs_GSC AnimGraphNode_EvaluateInputs_GSC;                    // 0x4B28 (size: 0x38)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x4B60 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x4B88 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x4C68 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x4CB0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x4D20 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x4D90 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x4DD8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x4E48 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x4EB8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x4F28 (size: 0x70)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_12;                       // 0x4F98 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x4FE0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x5050 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x50C0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x5130 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x51A0 (size: 0x70)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x5210 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x5238 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x5340 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5368 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x53D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x5420 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x5468 (size: 0x28)
    FAnimNode_AimOffsetLookAt AnimGraphNode_AimOffsetLookAt;                          // 0x5490 (size: 0x1E0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x5670 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x5740 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x5768 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x57D8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x5820 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x5868 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x5890 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x58D8 (size: 0x48)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x5920 (size: 0x20)
    FAnimNode_StrideWarping AnimGraphNode_StrideWarping;                              // 0x5940 (size: 0x238)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x5B78 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x5B98 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x5BE0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x5C28 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x5C70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x5C98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x5CC0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x5D08 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x5D50 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x5D98 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x5DE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x5E28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x5E70 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x5EB8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x5F00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x5F48 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_11;                       // 0x5F90 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x5FD8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x6020 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x6040 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x6088 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x60D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x6118 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x6160 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x61A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x61F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x6238 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x6280 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10;                       // 0x62C8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x6310 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x6330 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x63F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x6440 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x6488 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x64A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x64D0 (size: 0x28)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x64F8 (size: 0x100)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x65F8 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x66D8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x6720 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x6748 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x6770 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x6798 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x67C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x67E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x6810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x6838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x6860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x6888 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x68B0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x68F8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x6918 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x6960 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x69A8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x69F0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x6A10 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x6A50 (size: 0x40)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x6A90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x6AD8 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_26;                             // 0x6B20 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x6B98 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9;                        // 0x6BE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x6C28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x6C70 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8;                        // 0x6CB8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x6D00 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x6D48 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x6D90 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x6DD8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x6E00 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x6E28 (size: 0x108)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_25;                             // 0x6F30 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x6FA8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x6FF0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x7038 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_24;                             // 0x7080 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_23;                             // 0x70F8 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_22;                             // 0x7170 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_21;                             // 0x71E8 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_20;                             // 0x7260 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_19;                             // 0x72D8 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_18;                             // 0x7350 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_17;                             // 0x73C8 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_16;                             // 0x7440 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7;                        // 0x74B8 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_15;                             // 0x7500 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_14;                             // 0x7578 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_13;                             // 0x75F0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_12;                             // 0x7668 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_11;                             // 0x76E0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_10;                             // 0x7758 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_9;                              // 0x77D0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_8;                              // 0x7848 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_7;                              // 0x78C0 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x7938 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x7980 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x79C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x7A10 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x7A58 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x7AA0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x7AE8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x7B30 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x7B78 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x7BC0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x7C08 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_6;                              // 0x7C50 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x7CC8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x7D10 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x7D58 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_5;                              // 0x7DA0 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;                              // 0x7E18 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;                              // 0x7E90 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;                              // 0x7F08 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_1;                              // 0x7F80 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x7FF8 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x8070 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x80B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x8100 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x8148 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x8190 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x81D8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x8220 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x8240 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x8268 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x8288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x82B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x82D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x8300 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x8328 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x8350 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x8378 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x83A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x83C8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x83F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x8438 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x8480 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x84C8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x84E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x8510 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x8538 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x8580 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x85A0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x85E8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x8608 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x8650 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x8670 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x8698 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x86B8 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x8780 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x87A0 (size: 0xC8)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x8868 (size: 0x10)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x8878 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x88C0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x88E8 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x89B8 (size: 0x28)
    FAnimNode_FootPlacement AnimGraphNode_FootPlacement;                              // 0x89E0 (size: 0x4E0)
    FAnimNode_LegIK AnimGraphNode_LegIK;                                              // 0x8EC0 (size: 0xF8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x8FB8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x8FD8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x8FF8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x9020 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x9048 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x9090 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x91B8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x91D8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x91F8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x9220 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x9268 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x92B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x92F8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x9340 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x9388 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x93D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x9418 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x9460 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x94A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x94F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x9538 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x9580 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x95C8 (size: 0x108)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x96D0 (size: 0x10)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_3;          // 0x96E0 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x9728 (size: 0x10)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_2;          // 0x9738 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x9780 (size: 0x108)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x9888 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x98C8 (size: 0x40)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x9908 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x9950 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x9998 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x99E0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x9A28 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_1;          // 0x9A70 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x9AB8 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x9AF8 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC;            // 0x9B38 (size: 0x48)
    FAnimAbilityData __CustomProperty_AbilityData_7348F9C447D9B3398892389AE094E363;   // 0x9B80 (size: 0x18)
    FAnimCutsceneData __CustomProperty_CutsceneData_7348F9C447D9B3398892389AE094E363; // 0x9B98 (size: 0x8)
    FTwoLegIKData __CustomProperty_LegsData_7348F9C447D9B3398892389AE094E363;         // 0x9BA0 (size: 0x28)
    FAnimPhysicalData __CustomProperty_PhysicalData_7348F9C447D9B3398892389AE094E363; // 0x9BC8 (size: 0x3D8)
    FAnimPoseSearchLocomotionData __CustomProperty_PoseSearchLocomotionData_7348F9C447D9B3398892389AE094E363; // 0x9FA0 (size: 0x1D0)
    FAnimHumanDialogData __CustomProperty_DialogData_7348F9C447D9B3398892389AE094E363; // 0xA170 (size: 0x78)
    FAnimHumanLookAtData __CustomProperty_LookAtData_7348F9C447D9B3398892389AE094E363; // 0xA1E8 (size: 0x1B0)
    FAnimTwoHandsIKData __CustomProperty_HandsIKData_7348F9C447D9B3398892389AE094E363; // 0xA398 (size: 0x78)
    FAnimHumanStateData __CustomProperty_StateData_7348F9C447D9B3398892389AE094E363;  // 0xA410 (size: 0x3C)
    FAnimKnockDownData __CustomProperty_KnockDownData_7348F9C447D9B3398892389AE094E363; // 0xA44C (size: 0x2)
    FAnimHumanWeaponData __CustomProperty_WeaponData_7348F9C447D9B3398892389AE094E363; // 0xA450 (size: 0x38)

    void AnimGraph(FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Human(int32 EntryPoint);
}; // Size: 0xA488

#endif
