#ifndef UE4SS_SDK_AnimBP_Player_WeaponAutoCover_HPP
#define UE4SS_SDK_AnimBP_Player_WeaponAutoCover_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_562;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_563;                                                // 0x0010 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_564;                                  // 0x0020 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_565;                                  // 0x0028 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_566;                                  // 0x0030 (size: 0x8)
    EAlphaBlendOption __EnumProperty_567;                                             // 0x0038 (size: 0x1)
    TArray<float> __ArrayProperty_568;                                                // 0x0040 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_569;                                  // 0x0050 (size: 0x8)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_570;                        // 0x0058 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_571;                                  // 0x0060 (size: 0x8)
    TEnumAsByte<ERefPoseType> __ByteProperty_572;                                     // 0x0068 (size: 0x1)
    float __FloatProperty_573;                                                        // 0x006C (size: 0x4)
    float __FloatProperty_574;                                                        // 0x0070 (size: 0x4)
    TArray<int32> __ArrayProperty_575;                                                // 0x0078 (size: 0x10)
    FName __NameProperty_576;                                                         // 0x0088 (size: 0x8)
    int32 __IntProperty_577;                                                          // 0x0090 (size: 0x4)
    EAlphaBlendOption __EnumProperty_578;                                             // 0x0094 (size: 0x1)
    TArray<float> __ArrayProperty_579;                                                // 0x0098 (size: 0x10)
    float __FloatProperty_580;                                                        // 0x00A8 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_581;                               // 0x00AC (size: 0x2C)
    float __FloatProperty_582;                                                        // 0x00D8 (size: 0x4)
    bool __BoolProperty_583;                                                          // 0x00DC (size: 0x1)
    EAnimSyncMethod __EnumProperty_584;                                               // 0x00DD (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_585;                             // 0x00DE (size: 0x1)
    FName __NameProperty_586;                                                         // 0x00E0 (size: 0x8)
    FAnimNodeFunctionRef __StructProperty_587;                                        // 0x00E8 (size: 0x20)
    class UBlendProfile* __BlendProfile_588;                                          // 0x0108 (size: 0x8)
    class UCurveFloat* __CurveFloat_589;                                              // 0x0110 (size: 0x8)
    bool __BoolProperty_590;                                                          // 0x0118 (size: 0x1)
    EAlphaBlendOption __EnumProperty_591;                                             // 0x0119 (size: 0x1)
    EBlendListTransitionType __EnumProperty_592;                                      // 0x011A (size: 0x1)
    TArray<float> __ArrayProperty_593;                                                // 0x0120 (size: 0x10)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0130 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x01B0 (size: 0x18)

}; // Size: 0x1C8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_2;                                                          // 0x000C (size: 0x4)
    class UObject* __Object_3;                                                        // 0x0010 (size: 0x8)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    class UObject* __Object_5;                                                        // 0x0020 (size: 0x8)
    float __FloatProperty_6;                                                          // 0x0028 (size: 0x4)
    float __FloatProperty_7;                                                          // 0x002C (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_8;                                    // 0x0030 (size: 0x8)
    class UObject* __Object_9;                                                        // 0x0038 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_10;                                   // 0x0040 (size: 0x8)
    class UObject* __Object_11;                                                       // 0x0048 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_12;                                   // 0x0050 (size: 0x8)
    class UObject* __Object_13;                                                       // 0x0058 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_14;                                   // 0x0060 (size: 0x8)
    class UObject* __Object_15;                                                       // 0x0068 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_16;                                   // 0x0070 (size: 0x8)
    class UObject* __Object_17;                                                       // 0x0078 (size: 0x8)
    float __FloatProperty_18;                                                         // 0x0080 (size: 0x4)
    class UObject* __Object_19;                                                       // 0x0088 (size: 0x8)
    float __FloatProperty_20;                                                         // 0x0090 (size: 0x4)
    class UObject* __Object_21;                                                       // 0x0098 (size: 0x8)
    float __FloatProperty_22;                                                         // 0x00A0 (size: 0x4)
    class UObject* __Object_23;                                                       // 0x00A8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_24;                                   // 0x00B0 (size: 0x8)
    class UObject* __Object_25;                                                       // 0x00B8 (size: 0x8)
    float __FloatProperty_26;                                                         // 0x00C0 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x00C4 (size: 0x4)
    TArray<float> __ArrayProperty_28;                                                 // 0x00C8 (size: 0x10)
    uint8 __ByteProperty_29;                                                          // 0x00D8 (size: 0x1)
    float __FloatProperty_30;                                                         // 0x00DC (size: 0x4)
    bool __BoolProperty_31;                                                           // 0x00E0 (size: 0x1)
    bool __BoolProperty_32;                                                           // 0x00E1 (size: 0x1)

}; // Size: 0xE2

class UAnimBP_Player_WeaponAutoCover_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0xE8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x1570 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x1578 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x1580 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x15A0 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1668 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x16B0 (size: 0x10)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x16C0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x1708 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x17E8 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1830 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x1910 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x1980 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x19F0 (size: 0x70)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_10;         // 0x1A60 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x1AA8 (size: 0x70)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_9;          // 0x1B18 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x1B60 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x1BD0 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1C40 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10;                   // 0x1C88 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_8;          // 0x1CC8 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x1D10 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_7;          // 0x1D50 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x1D98 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_6;          // 0x1DD8 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x1E20 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x1E60 (size: 0x40)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x1EA0 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x1F68 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2030 (size: 0x28)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive_1;                // 0x2058 (size: 0x38)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x2090 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_5;          // 0x20D0 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x2118 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_4;          // 0x2158 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x21A0 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_3;          // 0x21E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x2230 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_2;          // 0x2278 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x22C0 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_1;          // 0x2308 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x2350 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x2390 (size: 0x40)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC;            // 0x23D0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2418 (size: 0x28)
    FAnimNode_MakeDynamicAdditive AnimGraphNode_MakeDynamicAdditive;                  // 0x2440 (size: 0x38)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x2478 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x24C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x2508 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x2550 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x2590 (size: 0x40)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x25D0 (size: 0x10)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x25E0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x2628 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x2670 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x26B8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x26D8 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x27A0 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2868 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2970 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x2998 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x29E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2A28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2A70 (size: 0x48)

    void AnimGraph(FPoseLink Idle, FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Player_WeaponAutoCover(int32 EntryPoint);
}; // Size: 0x2AB8

#endif
