#ifndef UE4SS_SDK_AnimBP_Player_HPP
#define UE4SS_SDK_AnimBP_Player_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TArray<int32> __ArrayProperty_3235;                                               // 0x0008 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_3236;                                 // 0x0018 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3237;                                 // 0x0020 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_3238;                                 // 0x0028 (size: 0x8)
    EAlphaBlendOption __EnumProperty_3239;                                            // 0x0030 (size: 0x1)
    TArray<float> __ArrayProperty_3240;                                               // 0x0038 (size: 0x10)
    TArray<float> __ArrayProperty_3241;                                               // 0x0048 (size: 0x10)
    TArray<int32> __ArrayProperty_3242;                                               // 0x0058 (size: 0x10)
    TArray<float> __ArrayProperty_3243;                                               // 0x0068 (size: 0x10)
    TArray<int32> __ArrayProperty_3244;                                               // 0x0078 (size: 0x10)
    TArray<float> __ArrayProperty_3245;                                               // 0x0088 (size: 0x10)
    TArray<float> __ArrayProperty_3246;                                               // 0x0098 (size: 0x10)
    TArray<int32> __ArrayProperty_3247;                                               // 0x00A8 (size: 0x10)
    FName __NameProperty_3248;                                                        // 0x00B8 (size: 0x8)
    TArray<float> __ArrayProperty_3249;                                               // 0x00C0 (size: 0x10)
    FName __NameProperty_3250;                                                        // 0x00D0 (size: 0x8)
    FName __NameProperty_3251;                                                        // 0x00D8 (size: 0x8)
    FName __NameProperty_3252;                                                        // 0x00E0 (size: 0x8)
    FName __NameProperty_3253;                                                        // 0x00E8 (size: 0x8)
    FName __NameProperty_3254;                                                        // 0x00F0 (size: 0x8)
    FName __NameProperty_3255;                                                        // 0x00F8 (size: 0x8)
    FName __NameProperty_3256;                                                        // 0x0100 (size: 0x8)
    TArray<float> __ArrayProperty_3257;                                               // 0x0108 (size: 0x10)
    TArray<int32> __ArrayProperty_3258;                                               // 0x0118 (size: 0x10)
    FName __NameProperty_3259;                                                        // 0x0128 (size: 0x8)
    TArray<float> __ArrayProperty_3260;                                               // 0x0130 (size: 0x10)
    TArray<float> __ArrayProperty_3261;                                               // 0x0140 (size: 0x10)
    FName __NameProperty_3262;                                                        // 0x0150 (size: 0x8)
    int32 __IntProperty_3263;                                                         // 0x0158 (size: 0x4)
    FName __NameProperty_3264;                                                        // 0x015C (size: 0x8)
    int32 __IntProperty_3265;                                                         // 0x0164 (size: 0x4)
    FName __NameProperty_3266;                                                        // 0x0168 (size: 0x8)
    FName __NameProperty_3267;                                                        // 0x0170 (size: 0x8)
    FName __NameProperty_3268;                                                        // 0x0178 (size: 0x8)
    FName __NameProperty_3269;                                                        // 0x0180 (size: 0x8)
    FName __NameProperty_3270;                                                        // 0x0188 (size: 0x8)
    FName __NameProperty_3271;                                                        // 0x0190 (size: 0x8)
    TArray<float> __ArrayProperty_3272;                                               // 0x0198 (size: 0x10)
    TArray<float> __ArrayProperty_3273;                                               // 0x01A8 (size: 0x10)
    FName __NameProperty_3274;                                                        // 0x01B8 (size: 0x8)
    TArray<float> __ArrayProperty_3275;                                               // 0x01C0 (size: 0x10)
    EAnimSyncMethod __EnumProperty_3276;                                              // 0x01D0 (size: 0x1)
    FName __NameProperty_3277;                                                        // 0x01D4 (size: 0x8)
    FName __NameProperty_3278;                                                        // 0x01DC (size: 0x8)
    TEnumAsByte<ERefPoseType> __ByteProperty_3279;                                    // 0x01E4 (size: 0x1)
    FName __NameProperty_3280;                                                        // 0x01E8 (size: 0x8)
    FName __NameProperty_3281;                                                        // 0x01F0 (size: 0x8)
    FName __NameProperty_3282;                                                        // 0x01F8 (size: 0x8)
    FName __NameProperty_3283;                                                        // 0x0200 (size: 0x8)
    FName __NameProperty_3284;                                                        // 0x0208 (size: 0x8)
    FName __NameProperty_3285;                                                        // 0x0210 (size: 0x8)
    FName __NameProperty_3286;                                                        // 0x0218 (size: 0x8)
    FName __NameProperty_3287;                                                        // 0x0220 (size: 0x8)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_3288;                       // 0x0228 (size: 0x1)
    FName __NameProperty_3289;                                                        // 0x022C (size: 0x8)
    FName __NameProperty_3290;                                                        // 0x0234 (size: 0x8)
    int32 __IntProperty_3291;                                                         // 0x023C (size: 0x4)
    FName __NameProperty_3292;                                                        // 0x0240 (size: 0x8)
    int32 __IntProperty_3293;                                                         // 0x0248 (size: 0x4)
    FName __NameProperty_3294;                                                        // 0x024C (size: 0x8)
    int32 __IntProperty_3295;                                                         // 0x0254 (size: 0x4)
    FName __NameProperty_3296;                                                        // 0x0258 (size: 0x8)
    int32 __IntProperty_3297;                                                         // 0x0260 (size: 0x4)
    FName __NameProperty_3298;                                                        // 0x0264 (size: 0x8)
    int32 __IntProperty_3299;                                                         // 0x026C (size: 0x4)
    FName __NameProperty_3300;                                                        // 0x0270 (size: 0x8)
    int32 __IntProperty_3301;                                                         // 0x0278 (size: 0x4)
    FName __NameProperty_3302;                                                        // 0x027C (size: 0x8)
    int32 __IntProperty_3303;                                                         // 0x0284 (size: 0x4)
    FName __NameProperty_3304;                                                        // 0x0288 (size: 0x8)
    int32 __IntProperty_3305;                                                         // 0x0290 (size: 0x4)
    FName __NameProperty_3306;                                                        // 0x0294 (size: 0x8)
    FName __NameProperty_3307;                                                        // 0x029C (size: 0x8)
    TArray<float> __ArrayProperty_3308;                                               // 0x02A8 (size: 0x10)
    float __FloatProperty_3309;                                                       // 0x02B8 (size: 0x4)
    FName __NameProperty_3310;                                                        // 0x02BC (size: 0x8)
    int32 __IntProperty_3311;                                                         // 0x02C4 (size: 0x4)
    TArray<float> __ArrayProperty_3312;                                               // 0x02C8 (size: 0x10)
    FName __NameProperty_3313;                                                        // 0x02D8 (size: 0x8)
    int32 __IntProperty_3314;                                                         // 0x02E0 (size: 0x4)
    EAlphaBlendOption __EnumProperty_3315;                                            // 0x02E4 (size: 0x1)
    TArray<float> __ArrayProperty_3316;                                               // 0x02E8 (size: 0x10)
    TArray<int32> __ArrayProperty_3317;                                               // 0x02F8 (size: 0x10)
    TArray<float> __ArrayProperty_3318;                                               // 0x0308 (size: 0x10)
    TArray<int32> __ArrayProperty_3319;                                               // 0x0318 (size: 0x10)
    FName __NameProperty_3320;                                                        // 0x0328 (size: 0x8)
    int32 __IntProperty_3321;                                                         // 0x0330 (size: 0x4)
    class UBlendProfile* __BlendProfile_3322;                                         // 0x0338 (size: 0x8)
    class UCurveFloat* __CurveFloat_3323;                                             // 0x0340 (size: 0x8)
    EAlphaBlendOption __EnumProperty_3324;                                            // 0x0348 (size: 0x1)
    EBlendListTransitionType __EnumProperty_3325;                                     // 0x0349 (size: 0x1)
    TArray<float> __ArrayProperty_3326;                                               // 0x0350 (size: 0x10)
    bool __BoolProperty_3327;                                                         // 0x0360 (size: 0x1)
    float __FloatProperty_3328;                                                       // 0x0364 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_3329;                              // 0x0368 (size: 0x2C)
    float __FloatProperty_3330;                                                       // 0x0394 (size: 0x4)
    bool __BoolProperty_3331;                                                         // 0x0398 (size: 0x1)
    EAnimSyncMethod __EnumProperty_3332;                                              // 0x0399 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_3333;                            // 0x039A (size: 0x1)
    FName __NameProperty_3334;                                                        // 0x039C (size: 0x8)
    FName __NameProperty_3335;                                                        // 0x03A4 (size: 0x8)
    int32 __IntProperty_3336;                                                         // 0x03AC (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_3337;                                       // 0x03B0 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x03D0 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0430 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x04B0 (size: 0x18)

}; // Size: 0x4C8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    uint8 __ByteProperty_0;                                                           // 0x0002 (size: 0x1)
    uint8 __ByteProperty_1;                                                           // 0x0003 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0004 (size: 0x1)
    uint8 __ByteProperty_3;                                                           // 0x0005 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0006 (size: 0x1)
    uint8 __ByteProperty_5;                                                           // 0x0007 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0008 (size: 0x1)
    float __FloatProperty_7;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0018 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x001C (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0020 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x0024 (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0028 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x002C (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_18;                                                         // 0x0038 (size: 0x4)
    uint8 __ByteProperty_19;                                                          // 0x003C (size: 0x1)
    bool __BoolProperty_20;                                                           // 0x003D (size: 0x1)
    bool __BoolProperty_21;                                                           // 0x003E (size: 0x1)
    bool __BoolProperty_22;                                                           // 0x003F (size: 0x1)
    bool __BoolProperty_23;                                                           // 0x0040 (size: 0x1)
    bool __BoolProperty_24;                                                           // 0x0041 (size: 0x1)
    bool __BoolProperty_25;                                                           // 0x0042 (size: 0x1)
    uint8 __ByteProperty_26;                                                          // 0x0043 (size: 0x1)
    uint8 __ByteProperty_27;                                                          // 0x0044 (size: 0x1)
    uint8 __ByteProperty_28;                                                          // 0x0045 (size: 0x1)
    bool __BoolProperty_29;                                                           // 0x0046 (size: 0x1)
    bool __BoolProperty_30;                                                           // 0x0047 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_31;                                   // 0x0048 (size: 0x8)
    float __FloatProperty_32;                                                         // 0x0050 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_33;                                   // 0x0058 (size: 0x8)
    float __FloatProperty_34;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_35;                                                         // 0x0064 (size: 0x4)
    bool __BoolProperty_36;                                                           // 0x0068 (size: 0x1)
    float __FloatProperty_37;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_38;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_39;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_40;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_41;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_42;                                                         // 0x0080 (size: 0x4)
    float __FloatProperty_43;                                                         // 0x0084 (size: 0x4)
    float __FloatProperty_44;                                                         // 0x0088 (size: 0x4)
    float __FloatProperty_45;                                                         // 0x008C (size: 0x4)
    bool __BoolProperty_46;                                                           // 0x0090 (size: 0x1)
    float __FloatProperty_47;                                                         // 0x0094 (size: 0x4)
    float __FloatProperty_48;                                                         // 0x0098 (size: 0x4)
    float __FloatProperty_49;                                                         // 0x009C (size: 0x4)
    bool __BoolProperty_50;                                                           // 0x00A0 (size: 0x1)
    float __FloatProperty_51;                                                         // 0x00A4 (size: 0x4)
    float __FloatProperty_52;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_53;                                                         // 0x00AC (size: 0x4)
    float __FloatProperty_54;                                                         // 0x00B0 (size: 0x4)
    float __FloatProperty_55;                                                         // 0x00B4 (size: 0x4)
    float __FloatProperty_56;                                                         // 0x00B8 (size: 0x4)
    float __FloatProperty_57;                                                         // 0x00BC (size: 0x4)
    float __FloatProperty_58;                                                         // 0x00C0 (size: 0x4)
    float __FloatProperty_59;                                                         // 0x00C4 (size: 0x4)
    float __FloatProperty_60;                                                         // 0x00C8 (size: 0x4)
    float __FloatProperty_61;                                                         // 0x00CC (size: 0x4)
    float __FloatProperty_62;                                                         // 0x00D0 (size: 0x4)
    float __FloatProperty_63;                                                         // 0x00D4 (size: 0x4)
    float __FloatProperty_64;                                                         // 0x00D8 (size: 0x4)
    float __FloatProperty_65;                                                         // 0x00DC (size: 0x4)
    float __FloatProperty_66;                                                         // 0x00E0 (size: 0x4)
    float __FloatProperty_67;                                                         // 0x00E4 (size: 0x4)
    float __FloatProperty_68;                                                         // 0x00E8 (size: 0x4)
    float __FloatProperty_69;                                                         // 0x00EC (size: 0x4)
    float __FloatProperty_70;                                                         // 0x00F0 (size: 0x4)
    float __FloatProperty_71;                                                         // 0x00F4 (size: 0x4)
    float __FloatProperty_72;                                                         // 0x00F8 (size: 0x4)
    bool __BoolProperty_73;                                                           // 0x00FC (size: 0x1)
    float __FloatProperty_74;                                                         // 0x0100 (size: 0x4)
    float __FloatProperty_75;                                                         // 0x0104 (size: 0x4)
    float __FloatProperty_76;                                                         // 0x0108 (size: 0x4)
    float __FloatProperty_77;                                                         // 0x010C (size: 0x4)
    class UObject* __Object_78;                                                       // 0x0110 (size: 0x8)
    float __FloatProperty_79;                                                         // 0x0118 (size: 0x4)
    float __FloatProperty_80;                                                         // 0x011C (size: 0x4)
    float __FloatProperty_81;                                                         // 0x0120 (size: 0x4)
    float __FloatProperty_82;                                                         // 0x0124 (size: 0x4)
    float __FloatProperty_83;                                                         // 0x0128 (size: 0x4)
    float __FloatProperty_84;                                                         // 0x012C (size: 0x4)
    float __FloatProperty_85;                                                         // 0x0130 (size: 0x4)
    float __FloatProperty_86;                                                         // 0x0134 (size: 0x4)
    float __FloatProperty_87;                                                         // 0x0138 (size: 0x4)
    float __FloatProperty_88;                                                         // 0x013C (size: 0x4)
    float __FloatProperty_89;                                                         // 0x0140 (size: 0x4)
    bool __BoolProperty_90;                                                           // 0x0144 (size: 0x1)
    class UObject* __Object_91;                                                       // 0x0148 (size: 0x8)
    bool __BoolProperty_92;                                                           // 0x0150 (size: 0x1)
    float __FloatProperty_93;                                                         // 0x0154 (size: 0x4)
    float __FloatProperty_94;                                                         // 0x0158 (size: 0x4)
    float __FloatProperty_95;                                                         // 0x015C (size: 0x4)
    bool __BoolProperty_96;                                                           // 0x0160 (size: 0x1)
    float __FloatProperty_97;                                                         // 0x0164 (size: 0x4)
    float __FloatProperty_98;                                                         // 0x0168 (size: 0x4)
    float __FloatProperty_99;                                                         // 0x016C (size: 0x4)
    float __FloatProperty_100;                                                        // 0x0170 (size: 0x4)
    float __FloatProperty_101;                                                        // 0x0174 (size: 0x4)
    float __FloatProperty_102;                                                        // 0x0178 (size: 0x4)
    float __FloatProperty_103;                                                        // 0x017C (size: 0x4)
    float __FloatProperty_104;                                                        // 0x0180 (size: 0x4)
    float __FloatProperty_105;                                                        // 0x0184 (size: 0x4)
    bool __BoolProperty_106;                                                          // 0x0188 (size: 0x1)
    float __FloatProperty_107;                                                        // 0x018C (size: 0x4)
    float __FloatProperty_108;                                                        // 0x0190 (size: 0x4)
    float __FloatProperty_109;                                                        // 0x0194 (size: 0x4)
    float __FloatProperty_110;                                                        // 0x0198 (size: 0x4)
    float __FloatProperty_111;                                                        // 0x019C (size: 0x4)
    float __FloatProperty_112;                                                        // 0x01A0 (size: 0x4)
    bool __BoolProperty_113;                                                          // 0x01A4 (size: 0x1)
    bool __BoolProperty_114;                                                          // 0x01A5 (size: 0x1)
    float __FloatProperty_115;                                                        // 0x01A8 (size: 0x4)
    float __FloatProperty_116;                                                        // 0x01AC (size: 0x4)
    float __FloatProperty_117;                                                        // 0x01B0 (size: 0x4)
    float __FloatProperty_118;                                                        // 0x01B4 (size: 0x4)
    float __FloatProperty_119;                                                        // 0x01B8 (size: 0x4)
    float __FloatProperty_120;                                                        // 0x01BC (size: 0x4)
    bool __BoolProperty_121;                                                          // 0x01C0 (size: 0x1)
    float __FloatProperty_122;                                                        // 0x01C4 (size: 0x4)
    float __FloatProperty_123;                                                        // 0x01C8 (size: 0x4)
    float __FloatProperty_124;                                                        // 0x01CC (size: 0x4)
    float __FloatProperty_125;                                                        // 0x01D0 (size: 0x4)
    float __FloatProperty_126;                                                        // 0x01D4 (size: 0x4)
    float __FloatProperty_127;                                                        // 0x01D8 (size: 0x4)
    bool __BoolProperty_128;                                                          // 0x01DC (size: 0x1)
    float __FloatProperty_129;                                                        // 0x01E0 (size: 0x4)
    float __FloatProperty_130;                                                        // 0x01E4 (size: 0x4)
    float __FloatProperty_131;                                                        // 0x01E8 (size: 0x4)
    float __FloatProperty_132;                                                        // 0x01EC (size: 0x4)
    float __FloatProperty_133;                                                        // 0x01F0 (size: 0x4)
    float __FloatProperty_134;                                                        // 0x01F4 (size: 0x4)
    float __FloatProperty_135;                                                        // 0x01F8 (size: 0x4)
    float __FloatProperty_136;                                                        // 0x01FC (size: 0x4)
    float __FloatProperty_137;                                                        // 0x0200 (size: 0x4)
    float __FloatProperty_138;                                                        // 0x0204 (size: 0x4)
    float __FloatProperty_139;                                                        // 0x0208 (size: 0x4)
    float __FloatProperty_140;                                                        // 0x020C (size: 0x4)
    float __FloatProperty_141;                                                        // 0x0210 (size: 0x4)
    float __FloatProperty_142;                                                        // 0x0214 (size: 0x4)
    float __FloatProperty_143;                                                        // 0x0218 (size: 0x4)
    class UObject* __Object_144;                                                      // 0x0220 (size: 0x8)
    bool __BoolProperty_145;                                                          // 0x0228 (size: 0x1)
    class UObject* __Object_146;                                                      // 0x0230 (size: 0x8)
    bool __BoolProperty_147;                                                          // 0x0238 (size: 0x1)
    float __FloatProperty_148;                                                        // 0x023C (size: 0x4)
    float __FloatProperty_149;                                                        // 0x0240 (size: 0x4)
    float __FloatProperty_150;                                                        // 0x0244 (size: 0x4)
    bool __BoolProperty_151;                                                          // 0x0248 (size: 0x1)
    float __FloatProperty_152;                                                        // 0x024C (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_153;                                  // 0x0250 (size: 0x8)
    float __FloatProperty_154;                                                        // 0x0258 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_155;                                  // 0x0260 (size: 0x8)
    float __FloatProperty_156;                                                        // 0x0268 (size: 0x4)
    float __FloatProperty_157;                                                        // 0x026C (size: 0x4)
    float __FloatProperty_158;                                                        // 0x0270 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_159;                                  // 0x0278 (size: 0x8)
    float __FloatProperty_160;                                                        // 0x0280 (size: 0x4)
    float __FloatProperty_161;                                                        // 0x0284 (size: 0x4)
    float __FloatProperty_162;                                                        // 0x0288 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_163;                                  // 0x0290 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_164;                                  // 0x0298 (size: 0x8)
    bool __BoolProperty_165;                                                          // 0x02A0 (size: 0x1)
    bool __BoolProperty_166;                                                          // 0x02A1 (size: 0x1)
    bool __BoolProperty_167;                                                          // 0x02A2 (size: 0x1)
    bool __BoolProperty_168;                                                          // 0x02A3 (size: 0x1)
    bool __BoolProperty_169;                                                          // 0x02A4 (size: 0x1)
    bool __BoolProperty_170;                                                          // 0x02A5 (size: 0x1)
    uint8 __ByteProperty_171;                                                         // 0x02A6 (size: 0x1)
    uint8 __ByteProperty_172;                                                         // 0x02A7 (size: 0x1)
    bool __BoolProperty_173;                                                          // 0x02A8 (size: 0x1)

}; // Size: 0x2A9

class UAnimBP_Player_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x2B0)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x1738 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x1740 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x1748 (size: 0x8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_108;                        // 0x1750 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_107;                        // 0x1798 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_106;                        // 0x17E0 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_7;                                   // 0x1828 (size: 0x10)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_10;                       // 0x1838 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_6;                                   // 0x1880 (size: 0x10)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13;                   // 0x1890 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12;                   // 0x18D0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11;                   // 0x1910 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10;                   // 0x1950 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x1990 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x19D0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x1A10 (size: 0x40)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_9;                        // 0x1A50 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15;                     // 0x1A98 (size: 0xE0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4;          // 0x1B78 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_105;                        // 0x1C48 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_104;                        // 0x1C90 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_103;                        // 0x1CD8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_102;                        // 0x1D20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_101;                        // 0x1D68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_100;                        // 0x1DB0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_99;                         // 0x1DF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_98;                         // 0x1E40 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_8;                        // 0x1E88 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_32;                       // 0x1ED0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_97;                         // 0x1F18 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_96;                         // 0x1F60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_95;                         // 0x1FA8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_94;                         // 0x1FF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_93;                         // 0x2038 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_92;                         // 0x2080 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_91;                         // 0x20C8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_7;                        // 0x2110 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_5;                                   // 0x2158 (size: 0x10)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0x2168 (size: 0xD0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_31;                       // 0x2238 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_90;                         // 0x2280 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_89;                         // 0x22C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_88;                         // 0x2310 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_87;                         // 0x2358 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_86;                         // 0x23A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_85;                         // 0x23E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_84;                         // 0x2430 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_6;                        // 0x2478 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_4;                                   // 0x24C0 (size: 0x10)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_30;                       // 0x24D0 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x2518 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_83;                         // 0x25E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_82;                         // 0x2630 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_81;                         // 0x2678 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_80;                         // 0x26C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_79;                         // 0x2708 (size: 0x48)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x2750 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x2770 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x2790 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_78;                         // 0x28B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_77;                         // 0x2900 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_76;                         // 0x2948 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_75;                         // 0x2990 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_74;                         // 0x29D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_73;                         // 0x2A20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_72;                         // 0x2A68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_71;                         // 0x2AB0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_70;                         // 0x2AF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_69;                         // 0x2B40 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_68;                         // 0x2B88 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_67;                         // 0x2BD0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_66;                         // 0x2C18 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x2C60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x2CA8 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x2CC8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_29;                       // 0x2D90 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x2DD8 (size: 0x108)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x2EE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x2F08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x2F30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x2F58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x2F80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x2FA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x2FD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x2FF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x3020 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x3048 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x3070 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_65;                         // 0x3098 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_28;                       // 0x30E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_64;                         // 0x3128 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x3170 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x3190 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x31B8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x31E0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_63;                         // 0x3200 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_27;                       // 0x3248 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_62;                         // 0x3290 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x32D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_61;                         // 0x32F8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_26;                       // 0x3340 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_60;                         // 0x3388 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x33D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_59;                         // 0x33F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_25;                       // 0x3438 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_58;                         // 0x3480 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x34C8 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x34E8 (size: 0x28)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x3510 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x35D8 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x36E0 (size: 0x108)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_1;                        // 0x37E8 (size: 0xB8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_24;                       // 0x38A0 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_3;                                   // 0x38E8 (size: 0x10)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x38F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x3920 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x3948 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x3970 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x3980 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_57;                         // 0x39A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_56;                         // 0x39E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_55;                         // 0x3A30 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x3A78 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x3AC0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_54;                         // 0x3AE0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_53;                         // 0x3B28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_52;                         // 0x3B70 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x3BB8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x3C00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_51;                         // 0x3C20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_50;                         // 0x3C68 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_49;                         // 0x3CB0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x3CF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x3D40 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x3D60 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23;                       // 0x3E28 (size: 0x48)
    FAnimNode_CacheBlend_GSC AnimGraphNode_CacheBlend_GSC_1;                          // 0x3E70 (size: 0x68)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x3ED8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x3F20 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14;                     // 0x4028 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22;                       // 0x4108 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x4150 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x4178 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x41A0 (size: 0x40)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x41E0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x4208 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x4230 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x4278 (size: 0x40)
    FAnimNode_CachePoseExternal_GSC AnimGraphNode_CachePoseExternal_GSC;              // 0x42B8 (size: 0xA8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x4360 (size: 0x20)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC;                              // 0x4380 (size: 0x178)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x44F8 (size: 0x20)
    FAnimNode_LegIK AnimGraphNode_LegIK;                                              // 0x4518 (size: 0xF8)
    FAnimNode_FootPlacement AnimGraphNode_FootPlacement;                              // 0x4610 (size: 0x4E0)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x4AF0 (size: 0x470)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x4F60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x4F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x4FB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x4FD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x5000 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x5028 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x5050 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x5078 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x50A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x50C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x50F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x5118 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x5140 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x5168 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x5190 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x51B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x51E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x5208 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x5230 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x5258 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x5280 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x52A8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_37;                     // 0x52D0 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x5340 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21;                       // 0x5360 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x53A8 (size: 0x10)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_36;                     // 0x53B8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x5428 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_35;                     // 0x5448 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_34;                     // 0x54B8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20;                       // 0x5528 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_33;                     // 0x5570 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19;                       // 0x55E0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_32;                     // 0x5628 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13;                     // 0x5698 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x5778 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12;                     // 0x5798 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_31;                     // 0x5878 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x58E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x5930 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_30;                     // 0x5950 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_29;                     // 0x59C0 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;                     // 0x5A30 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x5B10 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_28;                     // 0x5B30 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_27;                     // 0x5BA0 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;                     // 0x5C10 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x5CF0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_26;                     // 0x5D10 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x5D80 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x5DA0 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_25;                     // 0x5DC8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18;                       // 0x5E38 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_24;                     // 0x5E80 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_23;                     // 0x5EF0 (size: 0x70)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_3;          // 0x5F60 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_22;                     // 0x5FA8 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x6018 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x60F8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_21;                     // 0x6118 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_20;                     // 0x6188 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_19;                     // 0x61F8 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17;                       // 0x6268 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_2;          // 0x62B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16;                       // 0x62F8 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_18;                     // 0x6340 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15;                       // 0x63B0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_17;                     // 0x63F8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_16;                     // 0x6468 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x64D8 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x6548 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14;                       // 0x6628 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x6670 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x6690 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x6700 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x6770 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x67E0 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13;                       // 0x68C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x6908 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12;                       // 0x6928 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x6970 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x69E0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x6A50 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x6AC0 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11;                       // 0x6BA0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x6BE8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x6C58 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x6CC8 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x6D38 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10;                       // 0x6E18 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x6E60 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x6E80 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x6EF0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x6F60 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x6FD0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x7040 (size: 0x70)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_1;          // 0x70B0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x70F8 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC;            // 0x7140 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x7188 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x71D0 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x7240 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x7320 (size: 0x20)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x7340 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x7408 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x7450 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x7490 (size: 0x40)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x74D0 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x74E0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x7500 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x75C8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x76D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x76F8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x7720 (size: 0xE0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x7800 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x7828 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x7850 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x7878 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x78A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x78C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x78F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x7918 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x7940 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x7968 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x7990 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x79D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x79F8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x7A40 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x7A60 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x7AA8 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x7AC8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x7B08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x7B28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x7B70 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x7B90 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x7BD8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x7BF8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x7C40 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x7C60 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x7CA0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x7CC0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x7D00 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x7D20 (size: 0xC8)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x7DE8 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x7EA0 (size: 0x108)
    FAnimNode_CacheBlend_GSC AnimGraphNode_CacheBlend_GSC;                            // 0x7FA8 (size: 0x68)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x8010 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x80F0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x8118 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x8160 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x81A8 (size: 0x48)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x81F0 (size: 0x128)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x8318 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x8338 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x8358 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x83A0 (size: 0x48)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x83E8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x8408 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x8430 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x8458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x8480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x84A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x84D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x84F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x8520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x8548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x8570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x8598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x85C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x85E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x8610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x8638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x8660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x8688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x86B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x86D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x8700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x8728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x8750 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x8778 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x87A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x87C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x87F0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x8818 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x8860 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x8880 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x88C8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x88E8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x8930 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x8950 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x8998 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x89B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x8A00 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x8A20 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x8A68 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x8A88 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x8AD0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x8AF0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x8B38 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x8B58 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x8BA0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x8BC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x8C08 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x8C28 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x8C70 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x8C90 (size: 0x28)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x8CB8 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x8D80 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x8DC8 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x8E10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x8E38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x8E60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x8E88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x8EB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x8ED8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x8F20 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x8F68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x8FB0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x8FD0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x9018 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x9060 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x90A8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x90C8 (size: 0x128)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x91F0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x9238 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x9280 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x92C8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x9310 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x9358 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x93A0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x93E8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x9430 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x9478 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x94C0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x9508 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x9550 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x9598 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x95E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x9628 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x9670 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x96B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x9700 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x9748 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x9790 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x97D8 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x98A8 (size: 0x48)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x98F0 (size: 0xF0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x99E0 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x9A28 (size: 0xD0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x9AF8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x9B40 (size: 0x48)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x9B88 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x9BA8 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x9BC8 (size: 0x128)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x9CF0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x9D38 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x9E18 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x9EF8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x9F18 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x9F60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x9FA8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x9FF0 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0xA010 (size: 0xC8)
    FAnimCutsceneData __CustomProperty_CutsceneData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA0D8 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA0E0 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA100 (size: 0x30)
    FAnimPlayerVaultingData __CustomProperty_VaultingData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA130 (size: 0xB8)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA1E8 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA1EC (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA1F8 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA260 (size: 0x24)
    FAnimPlayerHitData __CustomProperty_HitData_DB99DA8346E0498EFBC7CF9523F2CC09;     // 0xA288 (size: 0x80)
    FAnimPlayerAutoCoverData __CustomProperty_AutoCoverData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA308 (size: 0x88)
    FAnimHandItemData __CustomProperty_HandItemData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA390 (size: 0x138)
    FAnimPlayerDetectorData __CustomProperty_DetectorData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA4C8 (size: 0x128)
    FAnimPlayerWeaponPushbackData __CustomProperty_WeaponPushbackData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA5F0 (size: 0x80)
    FAnimPlayerStateData __CustomProperty_StateData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA670 (size: 0x40)
    FAnimPlayerWeaponData __CustomProperty_WeaponData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA6B0 (size: 0x78)
    FAnimLocomotionData __CustomProperty_LocomotionData_DB99DA8346E0498EFBC7CF9523F2CC09; // 0xA728 (size: 0x130)
    FAnimCutsceneData __CustomProperty_CutsceneData_3C776DC74B03047C129453A414B90C2F; // 0xA858 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_3C776DC74B03047C129453A414B90C2F; // 0xA860 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_3C776DC74B03047C129453A414B90C2F; // 0xA880 (size: 0x30)
    FAnimPlayerVaultingData __CustomProperty_VaultingData_3C776DC74B03047C129453A414B90C2F; // 0xA8B0 (size: 0xB8)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_3C776DC74B03047C129453A414B90C2F; // 0xA968 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_3C776DC74B03047C129453A414B90C2F; // 0xA96C (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_3C776DC74B03047C129453A414B90C2F; // 0xA978 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_3C776DC74B03047C129453A414B90C2F; // 0xA9E0 (size: 0x24)
    FAnimPlayerHitData __CustomProperty_HitData_3C776DC74B03047C129453A414B90C2F;     // 0xAA08 (size: 0x80)
    FAnimPlayerAutoCoverData __CustomProperty_AutoCoverData_3C776DC74B03047C129453A414B90C2F; // 0xAA88 (size: 0x88)
    FAnimPlayerLookAtData __CustomProperty_LookAtData_3C776DC74B03047C129453A414B90C2F; // 0xAB10 (size: 0xD0)
    FAnimHandItemData __CustomProperty_HandItemData_3C776DC74B03047C129453A414B90C2F; // 0xABE0 (size: 0x138)
    FAnimPlayerDetectorData __CustomProperty_DetectorData_3C776DC74B03047C129453A414B90C2F; // 0xAD18 (size: 0x128)
    FAnimPlayerWeaponPushbackData __CustomProperty_WeaponPushbackData_3C776DC74B03047C129453A414B90C2F; // 0xAE40 (size: 0x80)
    FAnimPlayerWeaponInertiaData __CustomProperty_WeaponInertiaData_3C776DC74B03047C129453A414B90C2F; // 0xAEC0 (size: 0x98)
    FAnimPlayerWeaponSwingData __CustomProperty_WeaponSwingData_3C776DC74B03047C129453A414B90C2F; // 0xAF58 (size: 0x80)
    FAnimPlayerIdleSwayData __CustomProperty_IdleSwayData_3C776DC74B03047C129453A414B90C2F; // 0xAFD8 (size: 0xF0)
    FAnimTwoHandsIKData __CustomProperty_HandsIKData_3C776DC74B03047C129453A414B90C2F; // 0xB0C8 (size: 0x78)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_3C776DC74B03047C129453A414B90C2F; // 0xB140 (size: 0x328)
    FAnimPlayerStateData __CustomProperty_StateData_3C776DC74B03047C129453A414B90C2F; // 0xB468 (size: 0x40)
    FAnimPlayerTransitionData __CustomProperty_TransitionData_3C776DC74B03047C129453A414B90C2F; // 0xB4B0 (size: 0x70)
    FAnimPlayerCameraData __CustomProperty_CameraData_3C776DC74B03047C129453A414B90C2F; // 0xB520 (size: 0x90)
    FAnimPlayerWeaponData __CustomProperty_WeaponData_3C776DC74B03047C129453A414B90C2F; // 0xB5B0 (size: 0x78)
    FAnimLocomotionData __CustomProperty_LocomotionData_3C776DC74B03047C129453A414B90C2F; // 0xB628 (size: 0x130)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Player_AnimGraphNode_TransitionResult_05285C2F425ECCC38AFEEB800CD5B678();
    void ExecuteUbergraph_AnimBP_Player(int32 EntryPoint);
}; // Size: 0xB758

#endif
