#ifndef UE4SS_SDK_AnimBP_flesh_HPP
#define UE4SS_SDK_AnimBP_flesh_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_589;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_590;                                                // 0x0010 (size: 0x10)
    TArray<int32> __ArrayProperty_591;                                                // 0x0020 (size: 0x10)
    TArray<float> __ArrayProperty_592;                                                // 0x0030 (size: 0x10)
    TArray<int32> __ArrayProperty_593;                                                // 0x0040 (size: 0x10)
    TArray<int32> __ArrayProperty_594;                                                // 0x0050 (size: 0x10)
    FName __NameProperty_595;                                                         // 0x0060 (size: 0x8)
    TArray<float> __ArrayProperty_596;                                                // 0x0068 (size: 0x10)
    FName __NameProperty_597;                                                         // 0x0078 (size: 0x8)
    int32 __IntProperty_598;                                                          // 0x0080 (size: 0x4)
    FName __NameProperty_599;                                                         // 0x0084 (size: 0x8)
    int32 __IntProperty_600;                                                          // 0x008C (size: 0x4)
    FName __NameProperty_601;                                                         // 0x0090 (size: 0x8)
    int32 __IntProperty_602;                                                          // 0x0098 (size: 0x4)
    bool __BoolProperty_603;                                                          // 0x009C (size: 0x1)
    float __FloatProperty_604;                                                        // 0x00A0 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_605;                               // 0x00A4 (size: 0x2C)
    float __FloatProperty_606;                                                        // 0x00D0 (size: 0x4)
    EAnimSyncMethod __EnumProperty_607;                                               // 0x00D4 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_608;                             // 0x00D5 (size: 0x1)
    FName __NameProperty_609;                                                         // 0x00D8 (size: 0x8)
    FName __NameProperty_610;                                                         // 0x00E0 (size: 0x8)
    int32 __IntProperty_611;                                                          // 0x00E8 (size: 0x4)
    TArray<float> __ArrayProperty_612;                                                // 0x00F0 (size: 0x10)
    class UBlendProfile* __BlendProfile_613;                                          // 0x0100 (size: 0x8)
    class UCurveFloat* __CurveFloat_614;                                              // 0x0108 (size: 0x8)
    bool __BoolProperty_615;                                                          // 0x0110 (size: 0x1)
    EAlphaBlendOption __EnumProperty_616;                                             // 0x0111 (size: 0x1)
    EBlendListTransitionType __EnumProperty_617;                                      // 0x0112 (size: 0x1)
    TArray<float> __ArrayProperty_618;                                                // 0x0118 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_619;                                        // 0x0128 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x0148 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x01A8 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0228 (size: 0x18)

}; // Size: 0x240

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    uint8 __ByteProperty_0;                                                           // 0x0002 (size: 0x1)
    uint8 __ByteProperty_1;                                                           // 0x0003 (size: 0x1)
    uint8 __ByteProperty_2;                                                           // 0x0004 (size: 0x1)
    uint8 __ByteProperty_3;                                                           // 0x0005 (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x0006 (size: 0x1)
    bool __BoolProperty_5;                                                            // 0x0007 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0008 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0009 (size: 0x1)

}; // Size: 0xA

class UAnimBP_flesh_C : public UAnimInstanceMutant
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0B70 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0B78 (size: 0xA)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x0B88 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0B90 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0B98 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0BA0 (size: 0x20)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x0BC0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x0C08 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x0C50 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0C98 (size: 0x48)
    FAnimNode_MotionMatching AnimGraphNode_MotionMatching;                            // 0x0CE0 (size: 0x2E0)
    FAnimNode_PoseSearchHistoryCollector AnimGraphNode_PoseSearchHistoryCollector;    // 0x0FC0 (size: 0x50)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1010 (size: 0x20)
    FAnimNode_StrideWarping AnimGraphNode_StrideWarping;                              // 0x1030 (size: 0x238)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x1268 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x12B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x12F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x1340 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x1388 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x13D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x1418 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x1460 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x14A8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x14F0 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;                              // 0x1538 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_1;                              // 0x15B0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x1628 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x1670 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x16B8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x1700 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1748 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x1790 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x17D8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x1820 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x1868 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x18B0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x18F8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1940 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1988 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x19D0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1A18 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1A60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1AA8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x1AF0 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x1B38 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1B80 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1BC8 (size: 0x48)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x1C10 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1C58 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x1C78 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1D40 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x1D88 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1E90 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x1ED8 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x1F00 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x1F20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1F48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x1F70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x1F98 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1FC0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x2008 (size: 0x20)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x2028 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x20A0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x20C0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x2108 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2128 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x2170 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x2190 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x2258 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x22A0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x23A8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x23D0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2418 (size: 0x28)
    FAnimNode_Inertialization AnimGraphNode_Inertialization;                          // 0x2440 (size: 0x100)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2540 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2568 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2588 (size: 0x20)
    FAnimNode_FootPlacement AnimGraphNode_FootPlacement;                              // 0x25B0 (size: 0x4E0)
    FAnimNode_LegIK AnimGraphNode_LegIK;                                              // 0x2A90 (size: 0xF8)

    void AnimGraph(FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_flesh(int32 EntryPoint);
}; // Size: 0x2B88

#endif
