#ifndef UE4SS_SDK_AnimBP_Player_viper_HPP
#define UE4SS_SDK_AnimBP_Player_viper_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_160;                                                         // 0x0004 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_161;                                  // 0x0010 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_162;                                  // 0x0018 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_163;                                  // 0x0020 (size: 0x8)
    float __FloatProperty_164;                                                        // 0x0028 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_165;                        // 0x002C (size: 0x1)
    bool __BoolProperty_166;                                                          // 0x002D (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_167;                                  // 0x0030 (size: 0x8)
    EAnimSyncMethod __EnumProperty_168;                                               // 0x0038 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_169;                             // 0x0039 (size: 0x1)
    FName __NameProperty_170;                                                         // 0x003C (size: 0x8)
    class UBlendProfile* __BlendProfile_171;                                          // 0x0048 (size: 0x8)
    class UCurveFloat* __CurveFloat_172;                                              // 0x0050 (size: 0x8)
    bool __BoolProperty_173;                                                          // 0x0058 (size: 0x1)
    EAlphaBlendOption __EnumProperty_174;                                             // 0x0059 (size: 0x1)
    EBlendListTransitionType __EnumProperty_175;                                      // 0x005A (size: 0x1)
    TArray<float> __ArrayProperty_176;                                                // 0x0060 (size: 0x10)
    TArray<int32> __ArrayProperty_177;                                                // 0x0070 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_178;                                     // 0x0080 (size: 0x1)
    FAnimNodeFunctionRef __StructProperty_179;                                        // 0x0088 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x00A8 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0108 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0188 (size: 0x18)

}; // Size: 0x1A0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)

}; // Size: 0xD

class UAnimBP_Player_viper_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x10)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x1498 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x14A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x14A8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x14B0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x14D0 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x1598 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x1660 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x16A0 (size: 0x40)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x16E0 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x17A8 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x17E8 (size: 0x40)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x1828 (size: 0x48)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_1;                        // 0x1870 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x1928 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x1950 (size: 0x28)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x1978 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1A30 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x1B38 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x1B60 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x1C68 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1C90 (size: 0x20)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC_1;                            // 0x1CB0 (size: 0x178)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC;                              // 0x1E28 (size: 0x178)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x1FA0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x2090 (size: 0xF0)
    FAnimNode_CameraCopyBone_GSC AnimGraphNode_CameraCopyBone_GSC;                    // 0x2180 (size: 0x138)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x22B8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x22D8 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x22F8 (size: 0xE0)
    FAnimNode_SmoothCopyBone_GSC AnimGraphNode_SmoothCopyBone_GSC;                    // 0x23D8 (size: 0x160)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x2538 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x2660 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x2788 (size: 0x128)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x28B0 (size: 0xD0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2980 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x29A0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x2A90 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x2B80 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x2CA8 (size: 0x128)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2DD0 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2DF8 (size: 0xD0)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x2EC8 (size: 0x10)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2ED8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2F00 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3008 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3110 (size: 0x28)
    FAnimCutsceneData __CustomProperty_CutsceneData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3138 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3140 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3160 (size: 0x30)
    FAnimPlayerVaultingData __CustomProperty_VaultingData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3190 (size: 0xB8)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3248 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_27D52C5243F98BFDC637919BC1D3F16B; // 0x324C (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3258 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_27D52C5243F98BFDC637919BC1D3F16B; // 0x32C0 (size: 0x24)
    FAnimPlayerHitData __CustomProperty_HitData_27D52C5243F98BFDC637919BC1D3F16B;     // 0x32E8 (size: 0x80)
    FAnimPlayerDetectorData __CustomProperty_DetectorData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3368 (size: 0x128)
    FAnimPlayerWeaponPushbackData __CustomProperty_WeaponPushbackData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3490 (size: 0x80)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3510 (size: 0x328)
    FAnimPlayerStateData __CustomProperty_StateData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3838 (size: 0x40)
    FAnimPlayerWeaponData __CustomProperty_WeaponData_27D52C5243F98BFDC637919BC1D3F16B; // 0x3878 (size: 0x78)
    FAnimCutsceneData __CustomProperty_CutsceneData_25A45DFD42C83702B415B88720770BD6; // 0x38F0 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_25A45DFD42C83702B415B88720770BD6; // 0x38F8 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_25A45DFD42C83702B415B88720770BD6; // 0x3918 (size: 0x30)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_25A45DFD42C83702B415B88720770BD6; // 0x3948 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_25A45DFD42C83702B415B88720770BD6; // 0x394C (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_25A45DFD42C83702B415B88720770BD6; // 0x3958 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_25A45DFD42C83702B415B88720770BD6; // 0x39C0 (size: 0x24)
    FAnimPlayerAutoCoverData __CustomProperty_AutoCoverData_25A45DFD42C83702B415B88720770BD6; // 0x39E8 (size: 0x88)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_25A45DFD42C83702B415B88720770BD6; // 0x3A70 (size: 0x328)

    void AnimGraph(FPoseLink Idle, FPoseLink Moving, FPoseLink Look, FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Player_viper(int32 EntryPoint);
}; // Size: 0x3D98

#endif
