#ifndef UE4SS_SDK_AnimBP_player_bh_HPP
#define UE4SS_SDK_AnimBP_player_bh_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_350;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_351;                                                // 0x0010 (size: 0x10)
    FInputScaleBiasClampConstants __StructProperty_352;                               // 0x0020 (size: 0x2C)
    float __FloatProperty_353;                                                        // 0x004C (size: 0x4)
    TArray<float> __ArrayProperty_354;                                                // 0x0050 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_355;                                  // 0x0060 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_356;                                  // 0x0068 (size: 0x8)
    TArray<float> __ArrayProperty_357;                                                // 0x0070 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_358;                                  // 0x0080 (size: 0x8)
    TArray<float> __ArrayProperty_359;                                                // 0x0088 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_360;                                     // 0x0098 (size: 0x1)
    FName __NameProperty_361;                                                         // 0x009C (size: 0x8)
    int32 __IntProperty_362;                                                          // 0x00A4 (size: 0x4)
    float __FloatProperty_363;                                                        // 0x00A8 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_364;                        // 0x00AC (size: 0x1)
    bool __BoolProperty_365;                                                          // 0x00AD (size: 0x1)
    EAnimSyncMethod __EnumProperty_366;                                               // 0x00AE (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_367;                             // 0x00AF (size: 0x1)
    FName __NameProperty_368;                                                         // 0x00B0 (size: 0x8)
    FName __NameProperty_369;                                                         // 0x00B8 (size: 0x8)
    int32 __IntProperty_370;                                                          // 0x00C0 (size: 0x4)
    class UBlendProfile* __BlendProfile_371;                                          // 0x00C8 (size: 0x8)
    class UCurveFloat* __CurveFloat_372;                                              // 0x00D0 (size: 0x8)
    bool __BoolProperty_373;                                                          // 0x00D8 (size: 0x1)
    EAlphaBlendOption __EnumProperty_374;                                             // 0x00D9 (size: 0x1)
    EBlendListTransitionType __EnumProperty_375;                                      // 0x00DA (size: 0x1)
    TArray<float> __ArrayProperty_376;                                                // 0x00E0 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_377;                                        // 0x00F0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0110 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0190 (size: 0x18)

}; // Size: 0x1A8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0004 (size: 0x1)
    float __FloatProperty_3;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x000C (size: 0x4)
    bool __BoolProperty_5;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0011 (size: 0x1)
    float __FloatProperty_7;                                                          // 0x0014 (size: 0x4)
    bool __BoolProperty_8;                                                            // 0x0018 (size: 0x1)
    float __FloatProperty_9;                                                          // 0x001C (size: 0x4)
    bool __BoolProperty_10;                                                           // 0x0020 (size: 0x1)
    bool __BoolProperty_11;                                                           // 0x0021 (size: 0x1)
    float __FloatProperty_12;                                                         // 0x0024 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_13;                                   // 0x0028 (size: 0x8)
    bool __BoolProperty_14;                                                           // 0x0030 (size: 0x1)

}; // Size: 0x31

class UAnimBP_player_bh_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x38)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x14C0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x14C8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x14D0 (size: 0x20)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x14F0 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x15B8 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x1680 (size: 0x48)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x16C8 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x1790 (size: 0xD0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x1860 (size: 0xD0)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x1930 (size: 0x48)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x1978 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x1A40 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x1A88 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1B68 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x1C70 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1D50 (size: 0x108)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x1E58 (size: 0xD0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x1F28 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1F70 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_3;                                   // 0x1FB8 (size: 0x10)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x1FC8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x2010 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x2058 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x20A0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x20E8 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x2130 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x2170 (size: 0x40)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x21B0 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x2290 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x22D8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2320 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x2428 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x2450 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2478 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x24A0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x24C8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2510 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2538 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x2560 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x2640 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2688 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2790 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x27B8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x27E0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2828 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2850 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x2878 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2958 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x2980 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2A70 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2A90 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2AB0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x2AD8 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x2B18 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x2B60 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x2BA0 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x2BE8 (size: 0x10)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x2BF8 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x2C40 (size: 0x10)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x2C50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x2C78 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x2CA0 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x2CB0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x2CD0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x2D10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x2D30 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2DF8 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x2ED8 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2FA0 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x3080 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3148 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x3228 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x32F0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x3318 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3360 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x3468 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3490 (size: 0x28)

    void AnimGraph(FPoseLink Idle, FPoseLink Moving, FPoseLink Look, FPoseLink Additional, FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_player_bh(int32 EntryPoint);
}; // Size: 0x34B8

#endif
