#ifndef UE4SS_SDK_AnimBP_Fac_HPP
#define UE4SS_SDK_AnimBP_Fac_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    TArray<float> __ArrayProperty_1043;                                               // 0x0008 (size: 0x10)
    TArray<int32> __ArrayProperty_1044;                                               // 0x0018 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_1045;                                 // 0x0028 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1046;                                 // 0x0030 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1047;                                 // 0x0038 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1048;                                 // 0x0040 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1049;                                 // 0x0048 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1050;                                 // 0x0050 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1051;                                 // 0x0058 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1052;                                 // 0x0060 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1053;                                 // 0x0068 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1054;                                 // 0x0070 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1055;                                 // 0x0078 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1056;                                 // 0x0080 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1057;                                 // 0x0088 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1058;                                 // 0x0090 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1059;                                 // 0x0098 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1060;                                 // 0x00A0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1061;                                 // 0x00A8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1062;                                 // 0x00B0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1063;                                 // 0x00B8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1064;                                 // 0x00C0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1065;                                 // 0x00C8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1066;                                 // 0x00D0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1067;                                 // 0x00D8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1068;                                 // 0x00E0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1069;                                 // 0x00E8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1070;                                 // 0x00F0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1071;                                 // 0x00F8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1072;                                 // 0x0100 (size: 0x8)
    FName __NameProperty_1073;                                                        // 0x0108 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1074;                                 // 0x0110 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1075;                                 // 0x0118 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1076;                                 // 0x0120 (size: 0x8)
    FName __NameProperty_1077;                                                        // 0x0128 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1078;                                 // 0x0130 (size: 0x8)
    FName __NameProperty_1079;                                                        // 0x0138 (size: 0x8)
    TArray<float> __ArrayProperty_1080;                                               // 0x0140 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_1081;                                 // 0x0150 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1082;                                 // 0x0158 (size: 0x8)
    TArray<float> __ArrayProperty_1083;                                               // 0x0160 (size: 0x10)
    TArray<int32> __ArrayProperty_1084;                                               // 0x0170 (size: 0x10)
    FName __NameProperty_1085;                                                        // 0x0180 (size: 0x8)
    int32 __IntProperty_1086;                                                         // 0x0188 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_1087;                                 // 0x0190 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1088;                                 // 0x0198 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1089;                                 // 0x01A0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1090;                                 // 0x01A8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1091;                                 // 0x01B0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1092;                                 // 0x01B8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1093;                                 // 0x01C0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1094;                                 // 0x01C8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1095;                                 // 0x01D0 (size: 0x8)
    TArray<float> __ArrayProperty_1096;                                               // 0x01D8 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_1097;                                    // 0x01E8 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_1098;                                 // 0x01F0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1099;                                 // 0x01F8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_1100;                                 // 0x0200 (size: 0x8)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_1101;                       // 0x0208 (size: 0x1)
    class UAnimSequenceBase* __AnimSequenceBase_1102;                                 // 0x0210 (size: 0x8)
    bool __BoolProperty_1103;                                                         // 0x0218 (size: 0x1)
    float __FloatProperty_1104;                                                       // 0x021C (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_1105;                              // 0x0220 (size: 0x2C)
    float __FloatProperty_1106;                                                       // 0x024C (size: 0x4)
    EAnimSyncMethod __EnumProperty_1107;                                              // 0x0250 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_1108;                            // 0x0251 (size: 0x1)
    FName __NameProperty_1109;                                                        // 0x0254 (size: 0x8)
    class UBlendProfile* __BlendProfile_1110;                                         // 0x0260 (size: 0x8)
    class UCurveFloat* __CurveFloat_1111;                                             // 0x0268 (size: 0x8)
    EAlphaBlendOption __EnumProperty_1112;                                            // 0x0270 (size: 0x1)
    EBlendListTransitionType __EnumProperty_1113;                                     // 0x0271 (size: 0x1)
    TArray<float> __ArrayProperty_1114;                                               // 0x0278 (size: 0x10)
    bool __BoolProperty_1115;                                                         // 0x0288 (size: 0x1)
    FAnimNodeFunctionRef __StructProperty_1116;                                       // 0x0290 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x02B0 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0310 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0390 (size: 0x18)

}; // Size: 0x3A8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    uint8 __ByteProperty;                                                             // 0x0001 (size: 0x1)
    class UObject* __Object_0;                                                        // 0x0008 (size: 0x8)
    bool __BoolProperty_1;                                                            // 0x0010 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0011 (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x0012 (size: 0x1)
    class UObject* __Object_4;                                                        // 0x0018 (size: 0x8)
    uint8 __ByteProperty_5;                                                           // 0x0020 (size: 0x1)
    bool __BoolProperty_6;                                                            // 0x0021 (size: 0x1)
    bool __BoolProperty_7;                                                            // 0x0022 (size: 0x1)
    bool __BoolProperty_8;                                                            // 0x0023 (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x0024 (size: 0x1)

}; // Size: 0x25

class UAnimBP_Fac_C : public UAnimInstanceFace
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x06C0 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x06C8 (size: 0x28)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x06F0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x06F8 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0700 (size: 0x8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x0708 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x0728 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x0850 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x0978 (size: 0x128)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x0AA0 (size: 0x20)
    FAnimNode_CopyAnotherSkeletonBone_GSC AnimGraphNode_CopyAnotherSkeletonBone_GSC_2; // 0x0AC0 (size: 0xF0)
    FAnimNode_CopyAnotherSkeletonBone_GSC AnimGraphNode_CopyAnotherSkeletonBone_GSC_1; // 0x0BB0 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0CA0 (size: 0x108)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x0DA8 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_47;                   // 0x0DF0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_46;                   // 0x0E30 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_45;                   // 0x0E70 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_44;                   // 0x0EB0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_43;                   // 0x0EF0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_42;                   // 0x0F30 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_41;                   // 0x0F70 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_40;                   // 0x0FB0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_39;                   // 0x0FF0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_38;                   // 0x1030 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_37;                   // 0x1070 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_36;                   // 0x10B0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_35;                   // 0x10F0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_34;                   // 0x1130 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_33;                   // 0x1170 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_32;                   // 0x11B0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_31;                   // 0x11F0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_30;                   // 0x1230 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_29;                   // 0x1270 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_28;                   // 0x12B0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_27;                   // 0x12F0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_26;                   // 0x1330 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_25;                   // 0x1370 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_24;                   // 0x13B0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_23;                   // 0x13F0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_22;                   // 0x1430 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_21;                   // 0x1470 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_20;                   // 0x14B0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_19;                   // 0x14F0 (size: 0x40)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1530 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC_1;          // 0x1578 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x15C0 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_4;          // 0x1608 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x16D8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1700 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x1720 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x17E8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x1830 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_18;                   // 0x1858 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_17;                   // 0x1898 (size: 0x40)
    FAnimNode_CopyAnotherSkeletonBone_GSC AnimGraphNode_CopyAnotherSkeletonBone_GSC;  // 0x18D8 (size: 0xF0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_16;                   // 0x19C8 (size: 0x40)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x1A08 (size: 0x20)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_9;                              // 0x1A28 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x1AA0 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_8;                              // 0x1AE8 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x1B60 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_15;                   // 0x1BA8 (size: 0x40)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x1BE8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13;                     // 0x1C10 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x1CF0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12;                     // 0x1D18 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x1DF8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;                     // 0x1E20 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x1F00 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;                     // 0x1F28 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x2008 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x2030 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x2110 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x2138 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x2218 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x2240 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x2320 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x2348 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x2428 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x2450 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x2530 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x2558 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x2638 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x2660 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2740 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x2820 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x2848 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x2870 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x2890 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2958 (size: 0x108)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x2A60 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC;            // 0x2AA8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2AF0 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_14;                   // 0x2B18 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_13;                   // 0x2B58 (size: 0x40)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x2B98 (size: 0x48)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0x2BE0 (size: 0xD0)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_7;                              // 0x2CB0 (size: 0x78)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x2D28 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x2D70 (size: 0x10)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2D80 (size: 0xE0)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x2E60 (size: 0x10)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x2E70 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_6;                              // 0x2EB8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x2F30 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x2F50 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_12;                   // 0x3018 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_11;                   // 0x3058 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_10;                   // 0x3098 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_9;                    // 0x30D8 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_8;                    // 0x3118 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x3158 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x3198 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x31D8 (size: 0x40)
    FAnimNode_ModifyCurve AnimGraphNode_ModifyCurve;                                  // 0x3218 (size: 0x100)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x3318 (size: 0x40)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x3358 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x3380 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3448 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x3528 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x35F0 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x3638 (size: 0x48)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_5;                              // 0x3680 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_4;                              // 0x36F8 (size: 0x78)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_3;                              // 0x3770 (size: 0x78)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x37E8 (size: 0xD0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x38B8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x39C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x39E8 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x3A10 (size: 0xD0)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_2;                              // 0x3AE0 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3B58 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x3BA0 (size: 0x10)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x3BB0 (size: 0x48)
    FAnimNode_CurveBlend_GSC AnimGraphNode_CurveBlend_GSC_2;                          // 0x3BF8 (size: 0xE8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3CE0 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x3DE8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3E10 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x3E38 (size: 0xC8)
    FAnimNode_CurveBlend_GSC AnimGraphNode_CurveBlend_GSC_1;                          // 0x3F00 (size: 0xE8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3FE8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x4010 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x4038 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x4060 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x4088 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x40C8 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x4108 (size: 0x40)
    FAnimNode_CacheBlend_GSC AnimGraphNode_CacheBlend_GSC;                            // 0x4148 (size: 0x68)
    FAnimNode_ControlRig AnimGraphNode_ControlRig;                                    // 0x41B0 (size: 0x470)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x4620 (size: 0x40)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x4660 (size: 0xC8)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer_1;                              // 0x4728 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x47A0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x47E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x4810 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x4838 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4880 (size: 0x28)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x48A8 (size: 0x78)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x4920 (size: 0xD0)
    FAnimNode_CurveBlend_GSC AnimGraphNode_CurveBlend_GSC;                            // 0x49F0 (size: 0xE8)
    double __CustomProperty_ProceduralEyesIdleIntensity_E34F246B49763B8387D5AD8676DA4113; // 0x4AD8 (size: 0x8)
    double __CustomProperty_ProceduralEyesIdleAmplitude_E34F246B49763B8387D5AD8676DA4113; // 0x4AE0 (size: 0x8)
    double __CustomProperty_ProceduralEyesIdleWeight_E34F246B49763B8387D5AD8676DA4113; // 0x4AE8 (size: 0x8)
    bool __CustomProperty_bShouldOffOnEdges_E34F246B49763B8387D5AD8676DA4113;         // 0x4AF0 (size: 0x1)
    FVector __CustomProperty_LookAtLocation_E34F246B49763B8387D5AD8676DA4113;         // 0x4AF8 (size: 0x18)
    class USkeletalMeshComponent* Mesh;                                               // 0x4B10 (size: 0x8)
    float Alpha;                                                                      // 0x4B18 (size: 0x4)
    TArray<FName> blink_bs;                                                           // 0x4B20 (size: 0x10)

    void AnimGraph(FPoseLink& AnimGraph);
    bool CanPlayWoundedAnim();
    void CutsceneEndLookAt();
    void CutsceneStartLookAt(class AObj* LookAtCharacter, class AActor* LookAtActor, FName LookAtBone);
    void ExecuteUbergraph_AnimBP_Fac(int32 EntryPoint);
}; // Size: 0x4B30

#endif
