#ifndef UE4SS_SDK_AnimBP_Player_pm_HPP
#define UE4SS_SDK_AnimBP_Player_pm_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_237;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_238;                                                // 0x0010 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_239;                                  // 0x0020 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_240;                                  // 0x0028 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_241;                                  // 0x0030 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_242;                                  // 0x0038 (size: 0x8)
    TArray<float> __ArrayProperty_243;                                                // 0x0040 (size: 0x10)
    TArray<int32> __ArrayProperty_244;                                                // 0x0050 (size: 0x10)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_245;                        // 0x0060 (size: 0x1)
    bool __BoolProperty_246;                                                          // 0x0061 (size: 0x1)
    float __FloatProperty_247;                                                        // 0x0064 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_248;                                  // 0x0068 (size: 0x8)
    EAnimSyncMethod __EnumProperty_249;                                               // 0x0070 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_250;                             // 0x0071 (size: 0x1)
    FName __NameProperty_251;                                                         // 0x0074 (size: 0x8)
    class UBlendProfile* __BlendProfile_252;                                          // 0x0080 (size: 0x8)
    class UCurveFloat* __CurveFloat_253;                                              // 0x0088 (size: 0x8)
    bool __BoolProperty_254;                                                          // 0x0090 (size: 0x1)
    EAlphaBlendOption __EnumProperty_255;                                             // 0x0091 (size: 0x1)
    EBlendListTransitionType __EnumProperty_256;                                      // 0x0092 (size: 0x1)
    TArray<float> __ArrayProperty_257;                                                // 0x0098 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_258;                                     // 0x00A8 (size: 0x1)
    FAnimNodeFunctionRef __StructProperty_259;                                        // 0x00B0 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x00D0 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0130 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x01B0 (size: 0x18)

}; // Size: 0x1C8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    float __FloatProperty_0;                                                          // 0x0004 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_2;                                                           // 0x000C (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x000D (size: 0x1)
    bool __BoolProperty_4;                                                            // 0x000E (size: 0x1)

}; // Size: 0xF

class UAnimBP_Player_pm_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x10)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x1498 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x14A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x14A8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x14B0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x14D0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x14F0 (size: 0x20)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC_2;                            // 0x1510 (size: 0x178)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC_1;                            // 0x1688 (size: 0x178)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_5;                                      // 0x1800 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_4;                                      // 0x18F0 (size: 0xF0)
    FAnimNode_SmoothCopyBone_GSC AnimGraphNode_SmoothCopyBone_GSC_1;                  // 0x19E0 (size: 0x160)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x1B40 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x1C08 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x1CD0 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x1D98 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x1EC0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x1FE8 (size: 0x128)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x2110 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2218 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x2240 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2288 (size: 0xE0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x2368 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x2458 (size: 0xF0)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC;                              // 0x2548 (size: 0x178)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x26C0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x26E0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2700 (size: 0x28)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x2728 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x27F0 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x2830 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x2870 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x28B0 (size: 0x40)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x28F0 (size: 0x48)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_1;                        // 0x2938 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x29F0 (size: 0x108)
    FAnimNode_CameraCopyBone_GSC AnimGraphNode_CameraCopyBone_GSC;                    // 0x2AF8 (size: 0x138)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2C30 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2C50 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x2C70 (size: 0xE0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x2D50 (size: 0xD0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x2E20 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x2F10 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x3000 (size: 0x128)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3128 (size: 0x28)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x3150 (size: 0xB8)
    FAnimNode_SmoothCopyBone_GSC AnimGraphNode_SmoothCopyBone_GSC;                    // 0x3208 (size: 0x160)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x3368 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x3490 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x35B8 (size: 0x128)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x36E0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3708 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x3750 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x3778 (size: 0x40)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x37B8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x3800 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x3828 (size: 0xD0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x38F8 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x3920 (size: 0x10)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x3930 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3A38 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x3B40 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x3B68 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3B90 (size: 0x28)
    FAnimCutsceneData __CustomProperty_CutsceneData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BB8 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BC0 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3BE0 (size: 0x30)
    FAnimPlayerVaultingData __CustomProperty_VaultingData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3C10 (size: 0xB8)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CC8 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CCC (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3CD8 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3D40 (size: 0x24)
    FAnimPlayerHitData __CustomProperty_HitData_64C5AB764CE33167EFABBAB61CC45A52;     // 0x3D68 (size: 0x80)
    FAnimPlayerDetectorData __CustomProperty_DetectorData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3DE8 (size: 0x128)
    FAnimPlayerWeaponPushbackData __CustomProperty_WeaponPushbackData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3F10 (size: 0x80)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_64C5AB764CE33167EFABBAB61CC45A52; // 0x3F90 (size: 0x328)
    FAnimPlayerStateData __CustomProperty_StateData_64C5AB764CE33167EFABBAB61CC45A52; // 0x42B8 (size: 0x40)
    FAnimPlayerCameraData __CustomProperty_CameraData_64C5AB764CE33167EFABBAB61CC45A52; // 0x4300 (size: 0x90)
    FAnimPlayerWeaponData __CustomProperty_WeaponData_64C5AB764CE33167EFABBAB61CC45A52; // 0x4390 (size: 0x78)
    FAnimCutsceneData __CustomProperty_CutsceneData_1EE89FA940C0375ED757748B8B9782E5; // 0x4408 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_1EE89FA940C0375ED757748B8B9782E5; // 0x4410 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_1EE89FA940C0375ED757748B8B9782E5; // 0x4430 (size: 0x30)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_1EE89FA940C0375ED757748B8B9782E5; // 0x4460 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_1EE89FA940C0375ED757748B8B9782E5; // 0x4464 (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_1EE89FA940C0375ED757748B8B9782E5; // 0x4470 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_1EE89FA940C0375ED757748B8B9782E5; // 0x44D8 (size: 0x24)
    FAnimPlayerAutoCoverData __CustomProperty_AutoCoverData_1EE89FA940C0375ED757748B8B9782E5; // 0x4500 (size: 0x88)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_1EE89FA940C0375ED757748B8B9782E5; // 0x4588 (size: 0x328)

    void AnimGraph(FPoseLink Idle, FPoseLink Moving, FPoseLink Look, FPoseLink Additional, FPoseLink& AnimGraph);
    bool IsBusyLeftHand();
    void ExecuteUbergraph_AnimBP_Player_pm(int32 EntryPoint);
}; // Size: 0x48B0

#endif
