#ifndef UE4SS_SDK_AnimBP_Player_AK74_HPP
#define UE4SS_SDK_AnimBP_Player_AK74_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    class UAnimSequenceBase* __AnimSequenceBase_252;                                  // 0x0008 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_253;                                  // 0x0010 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_254;                                  // 0x0018 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_255;                                  // 0x0020 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_256;                                  // 0x0028 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_257;                                  // 0x0030 (size: 0x8)
    TArray<float> __ArrayProperty_258;                                                // 0x0038 (size: 0x10)
    TArray<int32> __ArrayProperty_259;                                                // 0x0048 (size: 0x10)
    TArray<float> __ArrayProperty_260;                                                // 0x0058 (size: 0x10)
    TArray<float> __ArrayProperty_261;                                                // 0x0068 (size: 0x10)
    class UBlendProfile* __BlendProfile_262;                                          // 0x0078 (size: 0x8)
    class UCurveFloat* __CurveFloat_263;                                              // 0x0080 (size: 0x8)
    EAlphaBlendOption __EnumProperty_264;                                             // 0x0088 (size: 0x1)
    EBlendListTransitionType __EnumProperty_265;                                      // 0x0089 (size: 0x1)
    TArray<float> __ArrayProperty_266;                                                // 0x0090 (size: 0x10)
    TArray<int32> __ArrayProperty_267;                                                // 0x00A0 (size: 0x10)
    FName __NameProperty_268;                                                         // 0x00B0 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_269;                                  // 0x00B8 (size: 0x8)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_270;                        // 0x00C0 (size: 0x1)
    bool __BoolProperty_271;                                                          // 0x00C1 (size: 0x1)
    float __FloatProperty_272;                                                        // 0x00C4 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_273;                                  // 0x00C8 (size: 0x8)
    bool __BoolProperty_274;                                                          // 0x00D0 (size: 0x1)
    EAnimSyncMethod __EnumProperty_275;                                               // 0x00D1 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_276;                             // 0x00D2 (size: 0x1)
    FName __NameProperty_277;                                                         // 0x00D4 (size: 0x8)
    TEnumAsByte<ERefPoseType> __ByteProperty_278;                                     // 0x00DC (size: 0x1)
    FAnimNodeFunctionRef __StructProperty_279;                                        // 0x00E0 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x0100 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0160 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x01E0 (size: 0x18)

}; // Size: 0x1F8

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    uint8 __ByteProperty_1;                                                           // 0x000C (size: 0x1)
    uint8 __ByteProperty_2;                                                           // 0x000D (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x000E (size: 0x1)
    uint8 __ByteProperty_4;                                                           // 0x000F (size: 0x1)

}; // Size: 0x10

class UAnimBP_Player_AK74_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x10)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x1498 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x14A0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x14A8 (size: 0x8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x14B0 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x1578 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_7;                    // 0x1640 (size: 0x40)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x1680 (size: 0xC8)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_6;                    // 0x1748 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_5;                    // 0x1788 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x17C8 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x1808 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x1848 (size: 0x40)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1888 (size: 0x108)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x1990 (size: 0x48)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph_1;                        // 0x19D8 (size: 0xB8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1A90 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1AD8 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x1B20 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x1B48 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x1C50 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x1C78 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x1CC0 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x1CE8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x1D08 (size: 0x20)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC_1;                            // 0x1D28 (size: 0x178)
    FAnimNode_TwoBoneIK_GSC AnimGraphNode_TwoBoneIK_GSC;                              // 0x1EA0 (size: 0x178)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x2018 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x2108 (size: 0xF0)
    FAnimNode_CameraCopyBone_GSC AnimGraphNode_CameraCopyBone_GSC;                    // 0x21F8 (size: 0x138)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2330 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x2350 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2370 (size: 0xE0)
    FAnimNode_SmoothCopyBone_GSC AnimGraphNode_SmoothCopyBone_GSC;                    // 0x2450 (size: 0x160)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x25B0 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x26D8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x2800 (size: 0x128)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x2928 (size: 0xD0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x29F8 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x2A18 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x2B08 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x2BF8 (size: 0x128)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x2D20 (size: 0x128)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2E48 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2E70 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2F50 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2F78 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2FA0 (size: 0xD0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x3070 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x30B0 (size: 0x40)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x30F0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x3118 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x31F8 (size: 0x108)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0x3300 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x33B8 (size: 0x108)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x34C0 (size: 0x10)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x34D0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x34F8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3520 (size: 0x28)
    FAnimCutsceneData __CustomProperty_CutsceneData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3548 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3550 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3570 (size: 0x30)
    FAnimPlayerVaultingData __CustomProperty_VaultingData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x35A0 (size: 0xB8)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3658 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x365C (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3668 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x36D0 (size: 0x24)
    FAnimPlayerHitData __CustomProperty_HitData_B8A2038546A6DF85B6BCB5A5C8065DA2;     // 0x36F8 (size: 0x80)
    FAnimPlayerDetectorData __CustomProperty_DetectorData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3778 (size: 0x128)
    FAnimPlayerWeaponPushbackData __CustomProperty_WeaponPushbackData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x38A0 (size: 0x80)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3920 (size: 0x328)
    FAnimPlayerStateData __CustomProperty_StateData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3C48 (size: 0x40)
    FAnimPlayerWeaponData __CustomProperty_WeaponData_B8A2038546A6DF85B6BCB5A5C8065DA2; // 0x3C88 (size: 0x78)
    FAnimCutsceneData __CustomProperty_CutsceneData_D0646C304A6CF78273DC23A983D691BB; // 0x3D00 (size: 0x8)
    FAnimPlayerStealthData __CustomProperty_StealthData_D0646C304A6CF78273DC23A983D691BB; // 0x3D08 (size: 0x20)
    FAnimPlayerShadowData __CustomProperty_ShadowData_D0646C304A6CF78273DC23A983D691BB; // 0x3D28 (size: 0x30)
    FAnimPlayerUnfocusableTargetData __CustomProperty_AnimPlayerUnfocusableTargetData_D0646C304A6CF78273DC23A983D691BB; // 0x3D58 (size: 0x1)
    FAnimPlayerDialogData __CustomProperty_DialogData_D0646C304A6CF78273DC23A983D691BB; // 0x3D5C (size: 0x8)
    FAnimPlayerDodgeData __CustomProperty_DodgeData_D0646C304A6CF78273DC23A983D691BB; // 0x3D68 (size: 0x68)
    FAnimPlayerGuitarData __CustomProperty_GuitarData_D0646C304A6CF78273DC23A983D691BB; // 0x3DD0 (size: 0x24)
    FAnimPlayerAutoCoverData __CustomProperty_AutoCoverData_D0646C304A6CF78273DC23A983D691BB; // 0x3DF8 (size: 0x88)
    FAnimPlayerCollectionsData __CustomProperty_CollectionData_D0646C304A6CF78273DC23A983D691BB; // 0x3E80 (size: 0x328)

    void AnimGraph(FPoseLink Idle, FPoseLink Moving, FPoseLink Look, FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Player_AK74(int32 EntryPoint);
}; // Size: 0x41A8

#endif
