#ifndef UE4SS_SDK_AnimBP_Player_Slots_HPP
#define UE4SS_SDK_AnimBP_Player_Slots_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_429;                                                         // 0x0004 (size: 0x8)
    TArray<float> __ArrayProperty_430;                                                // 0x0010 (size: 0x10)
    TArray<float> __ArrayProperty_431;                                                // 0x0020 (size: 0x10)
    FInputScaleBiasClampConstants __StructProperty_432;                               // 0x0030 (size: 0x2C)
    float __FloatProperty_433;                                                        // 0x005C (size: 0x4)
    FName __NameProperty_434;                                                         // 0x0060 (size: 0x8)
    TArray<float> __ArrayProperty_435;                                                // 0x0068 (size: 0x10)
    FName __NameProperty_436;                                                         // 0x0078 (size: 0x8)
    int32 __IntProperty_437;                                                          // 0x0080 (size: 0x4)
    float __FloatProperty_438;                                                        // 0x0084 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_439;                        // 0x0088 (size: 0x1)
    bool __BoolProperty_440;                                                          // 0x0089 (size: 0x1)
    EAnimSyncMethod __EnumProperty_441;                                               // 0x008A (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_442;                             // 0x008B (size: 0x1)
    FName __NameProperty_443;                                                         // 0x008C (size: 0x8)
    FName __NameProperty_444;                                                         // 0x0094 (size: 0x8)
    int32 __IntProperty_445;                                                          // 0x009C (size: 0x4)
    TArray<float> __ArrayProperty_446;                                                // 0x00A0 (size: 0x10)
    TEnumAsByte<ERefPoseType> __ByteProperty_447;                                     // 0x00B0 (size: 0x1)
    class UBlendProfile* __BlendProfile_448;                                          // 0x00B8 (size: 0x8)
    class UCurveFloat* __CurveFloat_449;                                              // 0x00C0 (size: 0x8)
    bool __BoolProperty_450;                                                          // 0x00C8 (size: 0x1)
    EAlphaBlendOption __EnumProperty_451;                                             // 0x00C9 (size: 0x1)
    EBlendListTransitionType __EnumProperty_452;                                      // 0x00CA (size: 0x1)
    TArray<float> __ArrayProperty_453;                                                // 0x00D0 (size: 0x10)
    FAnimNodeFunctionRef __StructProperty_454;                                        // 0x00E0 (size: 0x20)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0100 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x0180 (size: 0x18)

}; // Size: 0x198

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    bool __BoolProperty;                                                              // 0x0001 (size: 0x1)
    bool __BoolProperty_0;                                                            // 0x0002 (size: 0x1)
    bool __BoolProperty_1;                                                            // 0x0003 (size: 0x1)
    bool __BoolProperty_2;                                                            // 0x0004 (size: 0x1)
    bool __BoolProperty_3;                                                            // 0x0005 (size: 0x1)
    class UObject* __Object_4;                                                        // 0x0008 (size: 0x8)
    bool __BoolProperty_5;                                                            // 0x0010 (size: 0x1)
    float __FloatProperty_6;                                                          // 0x0014 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_7;                                    // 0x0018 (size: 0x8)
    bool __BoolProperty_8;                                                            // 0x0020 (size: 0x1)
    bool __BoolProperty_9;                                                            // 0x0021 (size: 0x1)

}; // Size: 0x22

class UAnimBP_Player_Slots_C : public UAnimInstancePlayer
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x1480 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x1488 (size: 0x28)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x14B0 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x14B8 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x14C0 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x14E0 (size: 0x108)
    FAnimNode_Slot AnimGraphNode_Slot_7;                                              // 0x15E8 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x1630 (size: 0x108)
    FAnimNode_Slot AnimGraphNode_Slot_6;                                              // 0x1738 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;                     // 0x1780 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_5;                                              // 0x1860 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;                     // 0x18A8 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_4;                                              // 0x1988 (size: 0x48)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x19D0 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x1A98 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_3;          // 0x1B60 (size: 0xD0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;                            // 0x1C30 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x1CF8 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1D40 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_3;                                   // 0x1D88 (size: 0x10)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x1D98 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x1E60 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1EA8 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x1EF0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1F38 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1F80 (size: 0x48)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x1FC8 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x2090 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_2;          // 0x2158 (size: 0xD0)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive_1;          // 0x2228 (size: 0xD0)
    FAnimNode_BlendBoneByChannel AnimGraphNode_BlendBoneByChannel;                    // 0x22F8 (size: 0x68)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x2360 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x2388 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x2490 (size: 0xE0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x2570 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x2678 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_3;                                              // 0x26A0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x26E8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x2710 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x27F0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x2818 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x2920 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x2948 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x2A10 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x2A38 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x2A60 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x2B40 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x2B68 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x2C30 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x2C58 (size: 0x28)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x2C80 (size: 0xD0)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x2D50 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x2E18 (size: 0xE0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x2EF8 (size: 0xE0)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x2FD8 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x3020 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x3068 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x3090 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x30B8 (size: 0xE0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x3198 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x31E0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x3228 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x3330 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x3358 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x3380 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x3488 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x34B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x34D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x3500 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x3528 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3550 (size: 0x48)
    FAnimNode_BlendListByPointer_GSC AnimGraphNode_BlendListByPointer_GSC;            // 0x3598 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x35E0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3628 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x3648 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x3710 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x3758 (size: 0x10)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x3768 (size: 0xC8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x3830 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3878 (size: 0xE0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x3958 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x3980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x39A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x39D0 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x39F8 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x3A08 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x3A28 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3A68 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x3A88 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3B50 (size: 0x48)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x3B98 (size: 0x10)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x3BA8 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x3CB0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x3CD8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x3D00 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x3DE0 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x3EA8 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x3F88 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x4050 (size: 0xE0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x4130 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x41F8 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x4220 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4268 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x4370 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x4398 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x43C0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x43E8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4410 (size: 0x28)

    void AnimGraph(FPoseLink WeaponBase, FPoseLink WeaponAdditive, FPoseLink Moving, FPoseLink Look, FPoseLink UnderbarrelAdditive, FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Player_Slots(int32 EntryPoint);
}; // Size: 0x4438

#endif
