#ifndef UE4SS_SDK_AnimBP_Player_Shadow_HPP
#define UE4SS_SDK_AnimBP_Player_Shadow_HPP

struct FAnimBlueprintGeneratedConstantData : public FAnimBlueprintConstantData
{
    FName __NameProperty_588;                                                         // 0x0004 (size: 0x8)
    FName __NameProperty_589;                                                         // 0x000C (size: 0x8)
    int32 __IntProperty_590;                                                          // 0x0014 (size: 0x4)
    FName __NameProperty_591;                                                         // 0x0018 (size: 0x8)
    int32 __IntProperty_592;                                                          // 0x0020 (size: 0x4)
    FName __NameProperty_593;                                                         // 0x0024 (size: 0x8)
    int32 __IntProperty_594;                                                          // 0x002C (size: 0x4)
    FName __NameProperty_595;                                                         // 0x0030 (size: 0x8)
    int32 __IntProperty_596;                                                          // 0x0038 (size: 0x4)
    FName __NameProperty_597;                                                         // 0x003C (size: 0x8)
    int32 __IntProperty_598;                                                          // 0x0044 (size: 0x4)
    FName __NameProperty_599;                                                         // 0x0048 (size: 0x8)
    FName __NameProperty_600;                                                         // 0x0050 (size: 0x8)
    FName __NameProperty_601;                                                         // 0x0058 (size: 0x8)
    TArray<float> __ArrayProperty_602;                                                // 0x0060 (size: 0x10)
    FName __NameProperty_603;                                                         // 0x0070 (size: 0x8)
    TArray<float> __ArrayProperty_604;                                                // 0x0078 (size: 0x10)
    EAnimSyncMethod __EnumProperty_605;                                               // 0x0088 (size: 0x1)
    FName __NameProperty_606;                                                         // 0x008C (size: 0x8)
    FName __NameProperty_607;                                                         // 0x0094 (size: 0x8)
    class UBlendProfile* __BlendProfile_608;                                          // 0x00A0 (size: 0x8)
    class UCurveFloat* __CurveFloat_609;                                              // 0x00A8 (size: 0x8)
    EAlphaBlendOption __EnumProperty_610;                                             // 0x00B0 (size: 0x1)
    EBlendListTransitionType __EnumProperty_611;                                      // 0x00B1 (size: 0x1)
    TArray<float> __ArrayProperty_612;                                                // 0x00B8 (size: 0x10)
    class UAnimSequenceBase* __AnimSequenceBase_613;                                  // 0x00C8 (size: 0x8)
    class UAnimSequenceBase* __AnimSequenceBase_614;                                  // 0x00D0 (size: 0x8)
    TEnumAsByte<ERefPoseType> __ByteProperty_615;                                     // 0x00D8 (size: 0x1)
    FName __NameProperty_616;                                                         // 0x00DC (size: 0x8)
    int32 __IntProperty_617;                                                          // 0x00E4 (size: 0x4)
    FName __NameProperty_618;                                                         // 0x00E8 (size: 0x8)
    int32 __IntProperty_619;                                                          // 0x00F0 (size: 0x4)
    FName __NameProperty_620;                                                         // 0x00F4 (size: 0x8)
    int32 __IntProperty_621;                                                          // 0x00FC (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_622;                                  // 0x0100 (size: 0x8)
    FName __NameProperty_623;                                                         // 0x0108 (size: 0x8)
    int32 __IntProperty_624;                                                          // 0x0110 (size: 0x4)
    FName __NameProperty_625;                                                         // 0x0114 (size: 0x8)
    int32 __IntProperty_626;                                                          // 0x011C (size: 0x4)
    FName __NameProperty_627;                                                         // 0x0120 (size: 0x8)
    int32 __IntProperty_628;                                                          // 0x0128 (size: 0x4)
    FInputScaleBiasClampConstants __StructProperty_629;                               // 0x012C (size: 0x2C)
    float __FloatProperty_630;                                                        // 0x0158 (size: 0x4)
    FName __NameProperty_631;                                                         // 0x015C (size: 0x8)
    int32 __IntProperty_632;                                                          // 0x0164 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_633;                                  // 0x0168 (size: 0x8)
    FName __NameProperty_634;                                                         // 0x0170 (size: 0x8)
    int32 __IntProperty_635;                                                          // 0x0178 (size: 0x4)
    TEnumAsByte<ESequenceEvalReinit::Type> __ByteProperty_636;                        // 0x017C (size: 0x1)
    bool __BoolProperty_637;                                                          // 0x017D (size: 0x1)
    float __FloatProperty_638;                                                        // 0x0180 (size: 0x4)
    class UAnimSequenceBase* __AnimSequenceBase_639;                                  // 0x0188 (size: 0x8)
    bool __BoolProperty_640;                                                          // 0x0190 (size: 0x1)
    EAnimSyncMethod __EnumProperty_641;                                               // 0x0191 (size: 0x1)
    TEnumAsByte<EAnimGroupRole::Type> __ByteProperty_642;                             // 0x0192 (size: 0x1)
    FName __NameProperty_643;                                                         // 0x0194 (size: 0x8)
    FName __NameProperty_644;                                                         // 0x019C (size: 0x8)
    int32 __IntProperty_645;                                                          // 0x01A4 (size: 0x4)
    FAnimNodeFunctionRef __StructProperty_646;                                        // 0x01A8 (size: 0x20)
    FAnimSubsystem_Tag AnimBlueprintExtension_Tag;                                    // 0x01C8 (size: 0x60)
    FAnimSubsystem_PropertyAccess AnimBlueprintExtension_PropertyAccess;              // 0x0228 (size: 0x80)
    FAnimSubsystem_Base AnimBlueprintExtension_Base;                                  // 0x02A8 (size: 0x18)

}; // Size: 0x2C0

struct FAnimBlueprintGeneratedMutableData : public FAnimBlueprintMutableData
{
    float __FloatProperty;                                                            // 0x0004 (size: 0x4)
    float __FloatProperty_0;                                                          // 0x0008 (size: 0x4)
    float __FloatProperty_1;                                                          // 0x000C (size: 0x4)
    float __FloatProperty_2;                                                          // 0x0010 (size: 0x4)
    float __FloatProperty_3;                                                          // 0x0014 (size: 0x4)
    float __FloatProperty_4;                                                          // 0x0018 (size: 0x4)
    float __FloatProperty_5;                                                          // 0x001C (size: 0x4)
    float __FloatProperty_6;                                                          // 0x0020 (size: 0x4)
    float __FloatProperty_7;                                                          // 0x0024 (size: 0x4)
    float __FloatProperty_8;                                                          // 0x0028 (size: 0x4)
    float __FloatProperty_9;                                                          // 0x002C (size: 0x4)
    float __FloatProperty_10;                                                         // 0x0030 (size: 0x4)
    float __FloatProperty_11;                                                         // 0x0034 (size: 0x4)
    float __FloatProperty_12;                                                         // 0x0038 (size: 0x4)
    float __FloatProperty_13;                                                         // 0x003C (size: 0x4)
    float __FloatProperty_14;                                                         // 0x0040 (size: 0x4)
    float __FloatProperty_15;                                                         // 0x0044 (size: 0x4)
    float __FloatProperty_16;                                                         // 0x0048 (size: 0x4)
    float __FloatProperty_17;                                                         // 0x004C (size: 0x4)
    float __FloatProperty_18;                                                         // 0x0050 (size: 0x4)
    float __FloatProperty_19;                                                         // 0x0054 (size: 0x4)
    float __FloatProperty_20;                                                         // 0x0058 (size: 0x4)
    float __FloatProperty_21;                                                         // 0x005C (size: 0x4)
    float __FloatProperty_22;                                                         // 0x0060 (size: 0x4)
    float __FloatProperty_23;                                                         // 0x0064 (size: 0x4)
    float __FloatProperty_24;                                                         // 0x0068 (size: 0x4)
    float __FloatProperty_25;                                                         // 0x006C (size: 0x4)
    float __FloatProperty_26;                                                         // 0x0070 (size: 0x4)
    float __FloatProperty_27;                                                         // 0x0074 (size: 0x4)
    float __FloatProperty_28;                                                         // 0x0078 (size: 0x4)
    float __FloatProperty_29;                                                         // 0x007C (size: 0x4)
    float __FloatProperty_30;                                                         // 0x0080 (size: 0x4)
    float __FloatProperty_31;                                                         // 0x0084 (size: 0x4)
    bool __BoolProperty_32;                                                           // 0x0088 (size: 0x1)
    float __FloatProperty_33;                                                         // 0x008C (size: 0x4)
    float __FloatProperty_34;                                                         // 0x0090 (size: 0x4)
    bool __BoolProperty_35;                                                           // 0x0094 (size: 0x1)
    float __FloatProperty_36;                                                         // 0x0098 (size: 0x4)
    float __FloatProperty_37;                                                         // 0x009C (size: 0x4)
    float __FloatProperty_38;                                                         // 0x00A0 (size: 0x4)
    float __FloatProperty_39;                                                         // 0x00A4 (size: 0x4)
    float __FloatProperty_40;                                                         // 0x00A8 (size: 0x4)
    float __FloatProperty_41;                                                         // 0x00AC (size: 0x4)
    float __FloatProperty_42;                                                         // 0x00B0 (size: 0x4)
    bool __BoolProperty_43;                                                           // 0x00B4 (size: 0x1)
    float __FloatProperty_44;                                                         // 0x00B8 (size: 0x4)
    float __FloatProperty_45;                                                         // 0x00BC (size: 0x4)
    float __FloatProperty_46;                                                         // 0x00C0 (size: 0x4)
    float __FloatProperty_47;                                                         // 0x00C4 (size: 0x4)
    float __FloatProperty_48;                                                         // 0x00C8 (size: 0x4)
    float __FloatProperty_49;                                                         // 0x00CC (size: 0x4)
    float __FloatProperty_50;                                                         // 0x00D0 (size: 0x4)
    float __FloatProperty_51;                                                         // 0x00D4 (size: 0x4)

}; // Size: 0xD8

class UAnimBP_Player_Shadow_C : public UAnimInstancePlayerShadow
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0470 (size: 0x8)
    FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                       // 0x0478 (size: 0xD8)
    FAnimSubsystemInstance AnimBlueprintExtension_Tag;                                // 0x0550 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_PropertyAccess;                     // 0x0558 (size: 0x8)
    FAnimSubsystemInstance AnimBlueprintExtension_Base;                               // 0x0560 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0568 (size: 0x20)
    FAnimNode_CachePoseExternal_GSC AnimGraphNode_CachePoseExternal_GSC;              // 0x0588 (size: 0xA8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x0630 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x06F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0748 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0770 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0798 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x07C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x07E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x08B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x08D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0900 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0928 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0950 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0978 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x09A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x09C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x09F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0A18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0A40 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_15;                     // 0x0A68 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0AD8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_14;                     // 0x0AF8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0B68 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_13;                     // 0x0B88 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0BF8 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x0C18 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_12;                     // 0x0CF8 (size: 0x70)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x0D68 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x0DB0 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_11;                     // 0x0DD0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_10;                     // 0x0E40 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x0EB0 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x0F90 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_9;                      // 0x0FB0 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x1020 (size: 0x70)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1090 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x1170 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x1190 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x1200 (size: 0x20)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x1220 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x1248 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x12B8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x12D8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x1348 (size: 0x70)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x13B8 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x1400 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x1420 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1490 (size: 0x20)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x14B0 (size: 0x48)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x14F8 (size: 0x70)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x1568 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x15D8 (size: 0x20)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x15F8 (size: 0x70)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1668 (size: 0x20)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x1688 (size: 0xC8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x1750 (size: 0x48)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_4;                    // 0x1798 (size: 0x40)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_3;                    // 0x17D8 (size: 0x40)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x1818 (size: 0x10)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1828 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x1848 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x1910 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1938 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x1960 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x1988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x19B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x19D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x1A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x1A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x1A78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1AA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1AE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1B08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1B50 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1B70 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1BB8 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_2;                    // 0x1BD8 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x1C18 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1C38 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1C80 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1CA0 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1CE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1D08 (size: 0x48)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1D50 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x1D70 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x1DB0 (size: 0x20)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x1DD0 (size: 0x40)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1E10 (size: 0x20)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1E30 (size: 0xC8)
    FAnimNode_ApplyMeshSpaceAdditive AnimGraphNode_ApplyMeshSpaceAdditive;            // 0x1EF8 (size: 0xD0)
    FAnimNode_EvaluateInputs_GSC AnimGraphNode_EvaluateInputs_GSC;                    // 0x1FC8 (size: 0x38)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2000 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2108 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2130 (size: 0x28)

    void AnimGraph(FPoseLink& AnimGraph);
    void ExecuteUbergraph_AnimBP_Player_Shadow(int32 EntryPoint);
}; // Size: 0x2158

#endif
