#ifndef UE4SS_SDK_CtrlRig_Exoskeleton_HPP
#define UE4SS_SDK_CtrlRig_Exoskeleton_HPP

class UCtrlRig_Exoskeleton_C : public UControlRig
{
}; // Size: 0x560

class URigVMMemory_Literal : public URigVMMemoryStorage
{
    FRigElementKey RigVMModel___AimItem_Item__Const;                                  // 0x0028 (size: 0xC)
    FRigUnit_AimItem_Target RigVMModel___AimItem_Primary__Const;                      // 0x0038 (size: 0x48)
    FRigElementKey RigVMModel___RigUnit_GetTransform_Item__Const;                     // 0x0080 (size: 0xC)
    TEnumAsByte<EBoneGetterSetterMode> RigVMModel___RigUnit_GetTransform_Space__Const; // 0x008C (size: 0x1)
    uint8 RigVMModel___RigUnit_GetTransform_bInitial__Const;                          // 0x008D (size: 0x1)
    FRigUnit_AimItem_Target RigVMModel___AimItem_Secondary__Const;                    // 0x0090 (size: 0x48)
    float RigVMModel___AimItem_Weight__Const;                                         // 0x00D8 (size: 0x4)
    FRigUnit_AimBone_DebugSettings RigVMModel___AimItem_DebugSettings__Const;         // 0x00E0 (size: 0x70)
    FRigElementKey RigVMModel___AimItem_1_Item__Const;                                // 0x0150 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_1_Item__Const;                   // 0x015C (size: 0xC)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_Secondary__Const;                  // 0x0168 (size: 0x48)
    FRigElementKey RigVMModel___AimItem_1_1_Item__Const;                              // 0x01B0 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_2_Item__Const;                   // 0x01BC (size: 0xC)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_1_Secondary__Const;                // 0x01C8 (size: 0x48)
    FRigElementKey RigVMModel___AimItem_2_Item__Const;                                // 0x0210 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_3_Item__Const;                   // 0x021C (size: 0xC)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_Secondary__Const;                  // 0x0228 (size: 0x48)
    FRigElementKey RigVMModel___AimItem_1_2_Item__Const;                              // 0x0270 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_4_Item__Const;                   // 0x027C (size: 0xC)
    FRigElementKey RigVMModel___AimItem_1_1_1_Item__Const;                            // 0x0288 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_5_Item__Const;                   // 0x0294 (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_Item__Const;                              // 0x02A0 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_6_Item__Const;                   // 0x02AC (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_Item__Const;                            // 0x02B8 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_7_Item__Const;                   // 0x02C4 (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_Item__Const;                          // 0x02D0 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_8_Item__Const;                   // 0x02DC (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_1_Item__Const;                        // 0x02E8 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_9_Item__Const;                   // 0x02F4 (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_1_1_Item__Const;                      // 0x0300 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_10_Item__Const;                  // 0x030C (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_2_Item__Const;                            // 0x0318 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_11_Item__Const;                  // 0x0324 (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_2_Item__Const;                          // 0x0330 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_12_Item__Const;                  // 0x033C (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_2_Item__Const;                        // 0x0348 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_13_Item__Const;                  // 0x0354 (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_1_2_Item__Const;                      // 0x0360 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_14_Item__Const;                  // 0x036C (size: 0xC)
    FRigElementKey RigVMModel___AimItem_2_1_1_1_1_1_1_Item__Const;                    // 0x0378 (size: 0xC)
    FRigElementKey RigVMModel___RigUnit_GetTransform_15_Item__Const;                  // 0x0384 (size: 0xC)

}; // Size: 0x390

class URigVMMemory_Work : public URigVMMemoryStorage
{
    FControlRigExecuteContext ExecuteContext_;                                        // 0x0028 (size: 0x38)
    FTransform RigVMModel___RigUnit_GetTransform_Transform;                           // 0x0060 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_CachedIndex;          // 0x00C0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_Primary__IO;                         // 0x00D0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_CachedItem;                        // 0x0118 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_PrimaryCachedSpace;                // 0x0128 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_SecondaryCachedSpace;              // 0x0138 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_1_Transform;                         // 0x0150 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_1_CachedIndex;        // 0x01B0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_Primary__IO;                       // 0x01C0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_CachedItem;                      // 0x0208 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_PrimaryCachedSpace;              // 0x0218 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_SecondaryCachedSpace;            // 0x0228 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_2_Transform;                         // 0x0240 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_2_CachedIndex;        // 0x02A0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_1_Primary__IO;                     // 0x02B0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_CachedItem;                    // 0x02F8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_PrimaryCachedSpace;            // 0x0308 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_SecondaryCachedSpace;          // 0x0318 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_3_Transform;                         // 0x0330 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_3_CachedIndex;        // 0x0390 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_Primary__IO;                       // 0x03A0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_CachedItem;                      // 0x03E8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_PrimaryCachedSpace;              // 0x03F8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_SecondaryCachedSpace;            // 0x0408 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_4_Transform;                         // 0x0420 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_4_CachedIndex;        // 0x0480 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_2_Primary__IO;                     // 0x0490 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_2_CachedItem;                    // 0x04D8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_2_PrimaryCachedSpace;            // 0x04E8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_2_SecondaryCachedSpace;          // 0x04F8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_5_Transform;                         // 0x0510 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_5_CachedIndex;        // 0x0570 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_1_1_1_Primary__IO;                   // 0x0580 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_1_CachedItem;                  // 0x05C8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_1_PrimaryCachedSpace;          // 0x05D8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_1_1_1_SecondaryCachedSpace;        // 0x05E8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_6_Transform;                         // 0x0600 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_6_CachedIndex;        // 0x0660 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_Primary__IO;                     // 0x0670 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_CachedItem;                    // 0x06B8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_PrimaryCachedSpace;            // 0x06C8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_SecondaryCachedSpace;          // 0x06D8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_7_Transform;                         // 0x06F0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_7_CachedIndex;        // 0x0750 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_Primary__IO;                   // 0x0760 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_CachedItem;                  // 0x07A8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_PrimaryCachedSpace;          // 0x07B8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_SecondaryCachedSpace;        // 0x07C8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_8_Transform;                         // 0x07E0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_8_CachedIndex;        // 0x0840 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_Primary__IO;                 // 0x0850 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_CachedItem;                // 0x0898 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_PrimaryCachedSpace;        // 0x08A8 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_SecondaryCachedSpace;      // 0x08B8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_9_Transform;                         // 0x08D0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_9_CachedIndex;        // 0x0930 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_1_Primary__IO;               // 0x0940 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_CachedItem;              // 0x0988 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_PrimaryCachedSpace;      // 0x0998 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_SecondaryCachedSpace;    // 0x09A8 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_10_Transform;                        // 0x09C0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_10_CachedIndex;       // 0x0A20 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_1_1_Primary__IO;             // 0x0A30 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_CachedItem;            // 0x0A78 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_PrimaryCachedSpace;    // 0x0A88 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_SecondaryCachedSpace;  // 0x0A98 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_11_Transform;                        // 0x0AB0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_11_CachedIndex;       // 0x0B10 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_2_Primary__IO;                   // 0x0B20 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_2_CachedItem;                  // 0x0B68 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_2_PrimaryCachedSpace;          // 0x0B78 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_2_SecondaryCachedSpace;        // 0x0B88 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_12_Transform;                        // 0x0BA0 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_12_CachedIndex;       // 0x0C00 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_2_Primary__IO;                 // 0x0C10 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_2_CachedItem;                // 0x0C58 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_2_PrimaryCachedSpace;        // 0x0C68 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_2_SecondaryCachedSpace;      // 0x0C78 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_13_Transform;                        // 0x0C90 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_13_CachedIndex;       // 0x0CF0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_2_Primary__IO;               // 0x0D00 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_2_CachedItem;              // 0x0D48 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_2_PrimaryCachedSpace;      // 0x0D58 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_2_SecondaryCachedSpace;    // 0x0D68 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_14_Transform;                        // 0x0D80 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_14_CachedIndex;       // 0x0DE0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_1_2_Primary__IO;             // 0x0DF0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_2_CachedItem;            // 0x0E38 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_2_PrimaryCachedSpace;    // 0x0E48 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_2_SecondaryCachedSpace;  // 0x0E58 (size: 0x10)
    FTransform RigVMModel___RigUnit_GetTransform_15_Transform;                        // 0x0E70 (size: 0x60)
    TArray<FCachedRigElement> RigVMModel___RigUnit_GetTransform_15_CachedIndex;       // 0x0ED0 (size: 0x10)
    FRigUnit_AimItem_Target RigVMModel___AimItem_2_1_1_1_1_1_1_Primary__IO;           // 0x0EE0 (size: 0x48)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_1_CachedItem;          // 0x0F28 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_1_PrimaryCachedSpace;  // 0x0F38 (size: 0x10)
    TArray<FCachedRigElement> RigVMModel___AimItem_2_1_1_1_1_1_1_SecondaryCachedSpace; // 0x0F48 (size: 0x10)

}; // Size: 0xF58

#endif
