#ifndef UE4SS_SDK_S_LightPresset_HPP
#define UE4SS_SDK_S_LightPresset_HPP

struct FS_LightPresset
{
    FName PresetName_34_C1D83792488CFFDA2C21A3AAF90EE6EA;                             // 0x0000 (size: 0x8)
    double Intensity_24_B7457FA4450E0594B8730DB897C90029;                             // 0x0008 (size: 0x8)
    FLinearColor LightColor_51_D85CA13646FF6D9681BFD48E9D070768;                      // 0x0010 (size: 0x10)
    double AttenuationRadius_55_F7F4985C4E2287E41B4C6C89997A2F09;                     // 0x0020 (size: 0x8)
    double Temperature_27_AD29837C45EFC7D318D691917DB22001;                           // 0x0028 (size: 0x8)
    FLinearColor EmissiveColor_28_6A8A0BC6453F40804B070D8929155F0B;                   // 0x0030 (size: 0x10)
    double EmissiveBrightness_30_10099DA34E135293FEE5FCBCEA5E7166;                    // 0x0040 (size: 0x8)
    double EmissivePower_31_CAC08C9540A7712284335A8736B80B6E;                         // 0x0048 (size: 0x8)
    FLinearColor LightBeamColor_29_3C643F944312643E65EA99A813E8F3F2;                  // 0x0050 (size: 0x10)
    double LightBeamBrightness_32_7BC012CD490A9BA4F4F8CF99377E192C;                   // 0x0060 (size: 0x8)
    double LightBeamPower_33_B2D587144F8BCFC3B91C20A3CE419B3D;                        // 0x0068 (size: 0x8)
    double EmissiveIntensity_62_F7CB52AD49DADA90F0CACBA7230567A8;                     // 0x0070 (size: 0x8)
    FLinearColor GlowColor_65_09D495DF45FF83D9D2CF9EA41DF7A1C3;                       // 0x0078 (size: 0x10)
    double GlowIntensity_64_1515650F49BCC0C0A42F0BA645DAFAD7;                         // 0x0088 (size: 0x8)

}; // Size: 0x90

#endif
