#ifndef UE4SS_SDK_TilingGridBack_HPP
#define UE4SS_SDK_TilingGridBack_HPP

class UTilingGridBack_C : public UTilingGridBack
{
    class UImage* Center;                                                             // 0x0298 (size: 0x8)
    class UImage* DownCenter;                                                         // 0x02A0 (size: 0x8)
    class UImage* DownLeft;                                                           // 0x02A8 (size: 0x8)
    class UImage* DownRight;                                                          // 0x02B0 (size: 0x8)
    class UImage* LeftCenter;                                                         // 0x02B8 (size: 0x8)
    class UImage* RightCenter;                                                        // 0x02C0 (size: 0x8)
    class UImage* TopCenter;                                                          // 0x02C8 (size: 0x8)
    class UImage* TopLeft;                                                            // 0x02D0 (size: 0x8)
    class UImage* TopRight;                                                           // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
