#ifndef UE4SS_SDK_W_AmmoPanel_HPP
#define UE4SS_SDK_W_AmmoPanel_HPP

class UW_AmmoPanel_C : public UAmmoWidget
{
    class UImage* Back;                                                               // 0x03A0 (size: 0x8)
    class UImage* circle;                                                             // 0x03A8 (size: 0x8)
    class UImage* Dot_slot;                                                           // 0x03B0 (size: 0x8)
    class UImage* Dot_slot_1;                                                         // 0x03B8 (size: 0x8)
    class UImage* Dot_slot_2;                                                         // 0x03C0 (size: 0x8)
    class UImage* Dot_slot_3;                                                         // 0x03C8 (size: 0x8)
    class UImage* Dot_slot_4;                                                         // 0x03D0 (size: 0x8)
    class UImage* Dot_slot_5;                                                         // 0x03D8 (size: 0x8)
    class UImage* Seperator;                                                          // 0x03E0 (size: 0x8)
    class UW_FireType_C* W_FireType_1;                                                // 0x03E8 (size: 0x8)
    class UW_FireType_C* W_FireType_2;                                                // 0x03F0 (size: 0x8)
    class UW_FireType_C* W_FireType_3;                                                // 0x03F8 (size: 0x8)

}; // Size: 0x400

#endif
