#ifndef UE4SS_SDK_W_EquipmentSlots_HPP
#define UE4SS_SDK_W_EquipmentSlots_HPP

class UW_EquipmentSlots_C : public UEquipmentSlots
{
    class UImage* BackgroundBottom;                                                   // 0x04C0 (size: 0x8)
    class UImage* BackgroundLeft;                                                     // 0x04C8 (size: 0x8)
    class UImage* BackgroundRight;                                                    // 0x04D0 (size: 0x8)
    class UImage* BackgroundTilling;                                                  // 0x04D8 (size: 0x8)
    class UImage* BackgroundTop;                                                      // 0x04E0 (size: 0x8)
    class UImage* Bottom;                                                             // 0x04E8 (size: 0x8)
    class UImage* Image;                                                              // 0x04F0 (size: 0x8)
    class UImage* Image_68;                                                           // 0x04F8 (size: 0x8)
    class UImage* Image_198;                                                          // 0x0500 (size: 0x8)
    class UImage* Left;                                                               // 0x0508 (size: 0x8)
    class UImage* Right;                                                              // 0x0510 (size: 0x8)
    class UImage* Tittle;                                                             // 0x0518 (size: 0x8)
    class UW_Text_C* W_Text;                                                          // 0x0520 (size: 0x8)

}; // Size: 0x528

#endif
