#ifndef UE4SS_SDK_W_ItemInfo_HPP
#define UE4SS_SDK_W_ItemInfo_HPP

class UW_ItemInfo_C : public UItemInfo
{
    class UImage* AmmoTypeUnderline;                                                  // 0x0D40 (size: 0x8)
    class UInvalidationBox* BackgroundInvalidationBox;                                // 0x0D48 (size: 0x8)
    class URetainerBox* DurabilityRetainerBox;                                        // 0x0D50 (size: 0x8)
    class UImage* FittingWeaponsUnderline;                                            // 0x0D58 (size: 0x8)
    class UImage* FullBack_Bottom_Left;                                               // 0x0D60 (size: 0x8)
    class UImage* FullBack_Bottom_Right;                                              // 0x0D68 (size: 0x8)
    class UImage* FullBack_Top_Left;                                                  // 0x0D70 (size: 0x8)
    class UImage* FullBack_Top_Right;                                                 // 0x0D78 (size: 0x8)
    class UImage* Image;                                                              // 0x0D80 (size: 0x8)
    class UImage* Image_191;                                                          // 0x0D88 (size: 0x8)
    class UImage* Image_323;                                                          // 0x0D90 (size: 0x8)
    class UImage* Stroke_Center_Top;                                                  // 0x0D98 (size: 0x8)

}; // Size: 0xDA0

#endif
