#ifndef UE4SS_SDK_W_StackSplitContextual_V3_HPP
#define UE4SS_SDK_W_StackSplitContextual_V3_HPP

class UW_StackSplitContextual_V3_C : public UStackSplitContextual
{
    class UImage* Image;                                                              // 0x0480 (size: 0x8)
    class UImage* Image_747;                                                          // 0x0488 (size: 0x8)
    class UImage* Image_801;                                                          // 0x0490 (size: 0x8)
    class UImage* Image_847;                                                          // 0x0498 (size: 0x8)
    class UImage* Image_893;                                                          // 0x04A0 (size: 0x8)
    class UImage* Lefttile;                                                           // 0x04A8 (size: 0x8)
    class UImage* MainframeCenterCenter;                                              // 0x04B0 (size: 0x8)
    class UImage* MainframeCenterLeft;                                                // 0x04B8 (size: 0x8)
    class UImage* MainframeTopCenter;                                                 // 0x04C0 (size: 0x8)
    class UImage* MainframeTopLeft;                                                   // 0x04C8 (size: 0x8)
    class UImage* MainframeTopRight;                                                  // 0x04D0 (size: 0x8)
    class UImage* RightTile;                                                          // 0x04D8 (size: 0x8)
    class UImage* ToplineCenter;                                                      // 0x04E0 (size: 0x8)
    class UImage* ToplineLeft;                                                        // 0x04E8 (size: 0x8)
    class UImage* ToplineRight;                                                       // 0x04F0 (size: 0x8)
    class UW_HintInputController_C* W_HintInputController;                            // 0x04F8 (size: 0x8)
    class UW_HintInputController_C* W_HintInputController_92;                         // 0x0500 (size: 0x8)

}; // Size: 0x508

#endif
