#ifndef UE4SS_SDK_W_PopupBackground_HPP
#define UE4SS_SDK_W_PopupBackground_HPP

class UW_PopupBackground_C : public UWidgetBase
{
    class UImage* x0y0_1;                                                             // 0x0278 (size: 0x8)
    class UImage* x0y1_1;                                                             // 0x0280 (size: 0x8)
    class UImage* x0y2_1;                                                             // 0x0288 (size: 0x8)
    class UImage* x1y0_1;                                                             // 0x0290 (size: 0x8)
    class UImage* x1y1_1;                                                             // 0x0298 (size: 0x8)
    class UImage* x1y2_1;                                                             // 0x02A0 (size: 0x8)
    class UImage* x2y0_1;                                                             // 0x02A8 (size: 0x8)
    class UImage* x2y1_1;                                                             // 0x02B0 (size: 0x8)
    class UImage* x2y2_1;                                                             // 0x02B8 (size: 0x8)

}; // Size: 0x2C0

#endif
