#ifndef UE4SS_SDK_W_UserWaterElement_HPP
#define UE4SS_SDK_W_UserWaterElement_HPP

class UW_UserWaterElement_C : public UUserWaterElement
{
    class UW_UserWaterElementText_C* TextElement;                                     // 0x0280 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement1;                                    // 0x0288 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement2;                                    // 0x0290 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement3;                                    // 0x0298 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement4;                                    // 0x02A0 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement5;                                    // 0x02A8 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement6;                                    // 0x02B0 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement7;                                    // 0x02B8 (size: 0x8)
    class UW_UserWaterElementText_C* TextElement7_1;                                  // 0x02C0 (size: 0x8)

}; // Size: 0x2C8

#endif
